Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/mount_vfolder/mount_vfolder.po
Languages: ja, ko, th

source: Mounting Folders to a Compute Session
ja: コンピュートセッションへのフォルダのマウント
ko: 연산 세션에 폴더 마운트
th: การเชื่อมต่อโฟลเดอร์เข้ากับเซสชันการคอมพิวเตอร์

source: Backend.AI provides a function to mount storage folders when creating a compute session. When new compute session is started, user will have access to the``/home/work/`` directory. Normal directories and files created under ``/home/work/`` will disappear when the compute session is terminated. This is because compute sessions are dynamically created and deleted based on the container. To preserve data inside a container regardless of the container's lifecycle, a separate host folder must be mounted in the container, and then files must be created within the mounted folder.
ko: Backend.AI는 스토리지 폴더 연산 세션 생성 시 마운트 할 수 있는 기능을 제공합니다.연산 세션을 시작하면 사용자는 ``/home/work/`` 폴더에 접근 권한을 가지게 되는데, ``/home/work/`` 및 그 하위에 생성된 일반 폴더와 파일은 연산 세션이 삭제되면 함께 사라집니다. 이는 연산 세션이 컨테이너에 기반하여 동적으로 생성/삭제 되기 때문으로, 컨테이너 내부의 데이터를 컨테이너 수명 주기와 상관없이 보존하기 위해서는 별도의 호스트 폴더를 컨테이너에 마운트 한 뒤, 마운트 된 폴더 안에 파일을 생성해야 합니다.

source: Go to 'Sessions' page and click the 'Start' button. After filling out the 'Session Type', 'Environments & Resource allocation' steps, navigate to the 'Data & Storage' step to see a list of folders that users can mount. From this list, choose the folders to mount and add them, or select multiple folders to mount more. The documentation will explain how to mount two folders, ``user1-ml-test`` and ``user2-vfolder``, and then create a session.
ko: '세션' 페이지에서 '시작' 버튼을 누르면 새로운 세션을 생성할 수 있습니다. '세션 타입', '실행 환경 & 자원 할당' 단계를 작성한 후, '데이터 & 폴더' 단계로 이동하면 사용자가 마운트할 수 있는 폴더의 리스트를 확인할 수 있습니다. 해당 리스트에서 마운트 하고자 하는 폴더를 선택하여 추가할 수 있으며, 여러 개의 폴더를 선택하면 다수의 폴더를 마운트 할 수 있습니다. 해당 문서에서는 ``user1-ml-test`` 와 ``user2-vfolder`` 두 개의 폴더를 마운트한 후 세션을 생성하는 법에 대해 설명합니다.

source: Launch a compute session with storage folders
ja: ストレージフォルダを使用してコンピュートセッションを開始します
ko: 자동 마운트 폴더를 이용하여 연산 세션 환경 구성하기
th: เริ่มเซสชันการคอมพิวเตอร์พร้อมโฟลเดอร์จัดเก็บข้อมูล

source: By looking at the data and folder information within that project, users can see information such as usage mode, the storage host the folder belongs to, permissions, and more. Note that the 'Data & Storage' step only outputs data folders that are mountable by the current user. For example, folders that belong to other projects cannot be viewed.
ko: 해당 프로젝트 내의 데이터와 폴더 정보를 살펴보면 사용 모드, 해당 폴더가 속해 있는 스토리지 호스트, 권한 등의 정보를 확인할 수 있습니다. 참고로, '데이터 & 폴더' 단계에서는 현재 사용자가 마운트 가능한 데이터 폴더만 출력됩니다. 다른 프로젝트에 속한 폴더는 해당 메뉴를 통해 조회할 수 없습니다.

source: Clicking a 'folder name' in the 'Data & Storage' step will open the folder explorer for that folder. From this, users can view the folders that have been created, create new folders, and upload files. For more detailed instructions related to folders, please refer :ref:`Explore Folder<explore_folder>` section.
ko: '데이터 & 폴더' 단계에서 폴더 이름을 클릭하면, '폴더' 정보를 한 눈에 확인할 수 있습니다. 해당 메뉴에서는 생성되어 있는 폴더를 확인하고, 새로운 폴더를 생성하고, 파일을 업로드할 수 있습니다. 자세한 설명은 :ref:`폴더 내용 조회하기<explore_folder>` 를 참조하세요.

source: Alternatively, a new virtual folder can be created by clicking the '+' button. For further information on how to create a new folder in session launcher page, please refer :ref:`Create storage folder<create_storage_folder>` section.
ko: 여기에 더해, '+' 버튼을 클릭하여 새로운 폴더를 생성할 수도 있습니다. 세션 런처에서 새로운 폴더를 생성하는 자세한 방법을 확인하시려면, :ref:`Storage 폴더 생성<create_storage_folder>` 을 참조하세요.

source: In the created session, screen terminal window can be brought up by clicking the terminal icon. ``ls`` command will mount ``user1-ml-test` folder and ``user2-vfolder`` under the ``user1-ml-test`` and ``user2-vfolder`` folders are mounted under the home directory.
ko: 생성된 세션에서 터미널 아이콘을 클릭하면 터미널 창을 띄울 수 있습니다. 터미널에서 ``ls`` 명령을 내리면 ``user1-ml-test`` 폴더와 ``user2-vfolder`` 폴더가 홈 디렉토리 하위에 마운트되는 것을 확인할 수 있습니다.

source: The selected folder will be mounted with its name under ``/home/work/`` inside the compute session, by its default. For example, if folder's name is ``test``, it is mounted on ``/home/work/test``. To customize the mount path, write an absolute path in the 'Path and Alias' input fields. Writing ``/workspace`` in the input field of the ``test`` folder will mount to ``/workspace`` inside the session. Writing a relative path will mount the folder under ``/home/work/`` with the path.
ko: 선택한 폴더는 기본적으로 연산 세션 내의 ``/home/work/`` 하위에 폴더의 이름으로 마운트 됩니다. 예를 들어, 폴더의 이름이 ``test`` 일 경우, ``/home/work/test`` 에 마운트 됩니다. 만약, 연산 세션 내 마운트 경로를 변경하고 싶다면 '경로 & 대체 이름' 입력 필드에 절대 경로를 입력합니다. 만약, ``test`` 폴더의 마운트 경로를 ``/workspace`` 로 입력한 경우에는 ``test`` 폴더가 연산 세션 내 ``/workspace`` 경로에 마운트 됩니다. 상대 경로를 입력하면 ``/home/work/`` 아래에 마운트 됩니다.

source: Backend.AI gives an option to preserve files in folders when a compute session is deleted. The example below illustrates what's happening.
ja: Backend.AIは、計算セッションが削除される際にフォルダー内のファイルを保持するオプションを提供します。以下の例は、何が起こっているかを示しています。
ko: Backend.AI에서는 연산 세션을 삭제해도 폴더 안의 파일을 보존할 수 있는 옵션을 제공합니다. 아래 예제를 통해 관련된 내용을 확인할 수 있습니다.

source: Under the ``user2-vfolder``, create a ``test_file``. Fill the contents with \"file inside user2-vfolder\".
ja: ``user2-vfolder``の下に``test_file``を作成します。内容を「user2-vfolderの中のファイル」で埋めます。
ko: 우선, ``user2-vfolder`` 하위에 ``test_file`` 파일을 생성합니다. 해당 파일의 내용은 《file inside user2-vfolder》로 채우겠습니다.

source: Running ``ls`` command against ``user2-vfolder``, users can confirm the file was created successfully. Please note the contents of the file can be chekced with ``cat`` command.
ko: ``user2-vfolder`` 를 대상으로 ``ls`` 명령을 실행해보면 파일이 생성된 것을 확인할 수 있습니다. 참고로, ``cat`` 명령을 사용하면 파일 내용을 확인할 수 있습니다.

source: Now delete the compute session and go to the Storage page. Locate the ``user2-vfolder folder``, open a file explorer and check that the ``test_file`` exists. Click the 'download' button in 'Actions' tab to download the file to the local machine and open it to confirm that the contents are \"file inside user2-vfolder\".
ko: 이제 세션을 삭제한 후 Data & Storage 페이지로 이동합니다. ``user2-vfolder`` 폴더를 찾아 클릭하여 파일 탐색기를 열고 ``test_file`` 파일이 존재하는 것을 확인합니다. '작업' 탭의 파일 다운로드 버튼을 클릭하여 파일을 로컬 머신에 내려받은 후, 내용이 "file inside user2-vfolder" 임을 확인합니다.

source: Performing file management on a mounted folder when you create a compute session, data can be preserved even after users ends the compute session.
ja: コンピュートセッションを作成するときにマウントされたフォルダでファイル管理を行うと、ユーザーがコンピュートセッションを終了した後でもデータが保持されることがあります。
ko: 연산 세션을 생성할 때 폴더를 마운트한 후, 마운트 된 폴더에서 파일 작업을 수행하면 연산 세션이 종료된 이후에도 데이터를 보존할 수 있습니다.

source: Configure a compute session environment using an automount folder
ja: 自動マウントフォルダを使用して計算セッション環境を構成する
ko: 자동 마운트 폴더를 이용하여 연산 세션 환경 구성하기
th: กำหนดค่าบริเวณเซสชั่นการคอมพิวเตอร์โดยใช้โฟลเดอร์อัตโนมัติ

source: If a new program or library is required that is not pre-installed in a compute session, a Storage folder attribute and :ref:`automount-folder<automount-folder>`, which is independent of the compute session lifecycle, can be used to install the package. Configure a consistent environment regardless of the type of compute session.
ja: コンピューティングセッションにプリインストールされていない新しいプログラムやライブラリが必要な場合、ストレージフォルダー属性と :ref:`automount-folder<automount-folder>` を使用して、コンピューティングセッションのライフサイクルとは独立してパッケージをインストールできます。コンピューティングセッションのタイプに関係なく、一貫した環境を構成します。
ko: 연산 세션에 사전 설치되어 있지 않은 새 프로그램이나 라이브러리를 필요로 하는 경우, 연산 세션의 수명 주기와 관계 없는 Storage 폴더 특성과 :ref:`자동 마운트 폴더<automount-folder>` 를 이용해서 패키지를 설치하고, 연산 세션의 종류에 상관없이 일정한 환경을 구성할 수 있습니다.

source: Install Python packages via pip
ja: pipでPythonパッケージをインストールする
ko: pip를 통한 파이썬 패키지 설치
th: ติดตั้งแพ็คเกจ Python ผ่าน pip

source: Creating a folder named ``.local`` allows a user to install Python user packages in same folder. ``pip`` by default installs the packages in the ``.local`` folder under the user's home folder (Please note that automount folder is mounted under user's home folder). So, to keep a Python package called ``tqdm`` installed at all times, regardless of the computing environment, a command like the following could be issued from the terminal:
ko: ``.local`` 이라는 이름의 폴더를 생성하면 파이썬 사용자 패키지를 해당 폴더에 설치하고 공유할 수 있습니다. ``pip``로 패키지를 설치하면 사용자 홈 폴더 하위에 있는 ``.local`` 폴더에 패키지를 설치하기 때문입니다. (자동 마운트 폴더는 사용자 홈폴더 하위에 마운트 됩니다.) 따라서, 연산 환경과 상관없이``tqdm`` 이라는 파이썬 패키지의 설치 상태를 항상 유지하려면 터미널에서 다음과 같은 명령을 내릴 수 있습니다.

source: After that, when a new compute session is created, the ``.local`` folder where the ``tqdm`` package is installed is automatically mounted, so users can use it without reinstalling the ``tqdm`` package.
ko: 이후, 연산 세션을 새로 생성하게 되면 ``tqdm`` 패키지가 설키된 ``.local`` 폴더가 자동으로 마운트 되므로, ``tqdm`` 패키지를 다시 설치하지 않고 사용할 수 있습니다.

source: When using multiple Python versions or sessions with different Python versions, packages may have compatibility issues. This can be circumvented by branching ``PYTHONPATH`` environment variable via the ``.bashrc``. This is because the user's ``pip`` package is installed in the path specified in the ``PYTHONPATH``.
ko: 여러 파이썬 버전이나 다른 파이썬 버전을 사용하는 세션을 사용할 경우 패키지들의 호환성 문제가 있을 수 있습니다. 이를 해결하기 위해, ``.bashrc`` 편집기능을 통해 ``PYTHONPATH`` 를 분기하는 방식의 적용이 가능합니다. 해당 방법을 사용하면, ``PYTHONPATH`` 환경 변수에 지정된 경로에 사용자 ``pip`` 패키지를 설치할 수 있습니다.

source: Install packages via Homebrew
ja: Homebrew を介してパッケージをインストールする
ko: Homebrew를 통해 패키지 설치
th: ติดตั้งแพ็กเกจผ่าน Homebrew

source: Package managers like Ubuntu ``apt`` or CentOS ``yum`` usually require the ``root`` permission. For security reasons, ``sudo`` and ``root`` accesses are blocked by default in Backend.AI's compute session (Depending on the configuration, this may be allowed), so we recommend to use `Homebrew on Linux <https://docs.brew.sh/Homebrew-on-Linux>`_ which does not require ``sudo``.
ko: Ubuntu의 ``apt`` 나 CentOS의 ``yum`` 같은 패키지 매니저는 일반적으로 ``root`` 권한을 필요로 합니다. Backend.AI의 연산 세션은 보안을 위해 ``sudo`` 권한 및 ``root`` 접근이 기본적으로 막혀 있기 때문에 (설정에 따라 접근이 허용될 수도 있습니다), 패키지 설치를 위해 ``sudo`` 접근이 필요하지 않은 `Homebrew on Linux <https://docs.brew.sh/Homebrew-on-Linux>`_ 사용을 권장하고 있습니다.

source: Homebrew can be configured as follows:
ja: Homebrewは次のように設定できます。
ko: Homebrew는 다음과 같이 구성할 수 있습니다.
th: Homebrew สามารถตั้งค่าได้ดังนี้:

source: Create ``.linuxbrew`` folder in Data & Storage page.
ja: Data & Storageページで ``.linuxbrew`` フォルダーを作成します。
ko: Data & Storage 페이지에서 ``.linuxbrew`` 폴더 생성
th: สร้างโฟลเดอร์ ``.linuxbrew`` ในหน้าข้อมูลและการจัดเก็บข้อมูล

source: Create a compute session (``.linuxbrew`` folder is automatically mounted at ``/home/linuxbrew/.linuxbrew``).
ja: コンピュートセッションを作成します（``.linuxbrew`` フォルダは自動的に ``/home/linuxbrew/.linuxbrew`` にマウントされます）。
ko: 연산 세션을 생성(``.linuxbrew`` 폴더가 자동으로 ``/home/linuxbrew/.linuxbrew`` 위치에 마운트)
th: สร้างเซสชันการคอมพิวเตอร์ (โฟลเดอร์ ``.linuxbrew`` จะถูกเมานต์โดยอัตโนมัติที่ ``/home/linuxbrew/.linuxbrew``)

source: Install Homebrew in the compute session, if not yet installed.
ja: まだインストールされていない場合は、計算セッションにHomebrewをインストールします。
ko: 연산 세션 내에서 Homebrew 설치(아직 설치하지 않은 경우)
th: ติดตั้ง Homebrew ในเซสชันการคอมพิวเตอร์ หากยังไม่ได้ติดตั้ง

source: Homebrew packages can be installed like following:
ko: Homebrew 패키지는 다음과 같이 설치할 수 있습니다.

source: ``brew`` installs packages under ``/home/linuxbrew/.linuxbrew`` which is automatically mounted when ``.linuxbrew`` folder exists. So, if an automount folder named ''.linuxbrew'' is created, the Homebrew packages previously installed can be used again, even if the compute session is deleted and a new compute session is created.
ko: ``brew`` 는 패키지를 ``/home/linuxbrew/.linuxbrew`` 디렉토리 하위에 설치하는데, ``.linuxbrew`` 라는 데이터 폴더가 있다면 연산 세션 생성 시 자동으로 그 위치에 마운트합니다. 따라서, ``.linuxbrew`` 라는 자동 마운트 폴더를 생성해두면 연산 세션을 삭제하고 새로운 연산 세션을 생성하더라도 기존에 설치했던 Homebrew 패키지를 다시 사용할 수 있습니다.

source: When you start a compute session, the user has access to the ``/home/work/`` directory, and the normal directories and files created under ``/home/work/`` will disappear when the compute session is terminated. This is because compute sessions are dynamically created and deleted based on the container. To preserve the data inside the container independent of the life cycle of the container, a separate host folder must be mounted into the container, and then files must be created within the mounted folder. Backend.AI provides a function to mount storage folders when creating a compute session.
th: เมื่อคุณเริ่มเซสชันการประมวลผล ผู้ใช้จะเข้าถึงไดเรกทอรี ``/home/work/`` และไดเรกทอรีและไฟล์ที่สร้างขึ้นภายใต้ ``/home/work/`` จะหายไปเมื่อเซสชันการประมวลผลสิ้นสุด นี่เป็นเพราะเซสชันการประมวลผลถูกสร้างและลบแบบไดนามิกตามคอนเทนเนอร์ เพื่อรักษาข้อมูลภายในคอนเทนเนอร์ให้เป็นอิสระจากวงจรชีวิตของคอนเทนเนอร์ โฟลเดอร์โฮสต์แยกต้องถูกติดตั้งในคอนเทนเนอร์ และจากนั้นไฟล์จะต้องถูกสร้างขึ้นภายในโฟลเดอร์ที่ติดตั้ง Backend.AI มีฟังก์ชันในการติดตั้งโฟลเดอร์เก็บข้อมูลเมื่อสร้างเซสชันการประมวลผล

source: Let's go to the Sessions page and click the START button to create a new compute session. In the Folders to mount panel in the session creation dialog, you can see a list of storage folders that can be mount. By clicking the folder you want to mount, you can mount it. You can also mount multiple folders simultaneously by clicking multiple items. In this example, we will mount two folders, ``user1-ml-test`` and ``user2-vfolder``, and then create a compute session.
th: ไปที่หน้า Sessions และคลิกปุ่ม START เพื่อสร้าง session คอมพิวเตอร์ใหม่ ในแผง Folders to mount ในกล่องโต้ตอบการสร้างเซสชัน คุณจะเห็นรายการโฟลเดอร์จัดเก็บที่สามารถนำมาใช้ได้ โดยการคลิกที่โฟลเดอร์ที่คุณต้องการนำมาใช้ คุณสามารถนำมาใช้ได้ คุณยังสามารถนำเข้าโฟลเดอร์หลาย ๆ โฟลเดอร์พร้อมกันโดยการคลิกที่หลายรายการ ในตัวอย่างนี้ เราจะนำเข้าโฟลเดอร์สองโฟลเดอร์คือ ``user1-ml-test`` และ ``user2-vfolder`` และจากนั้นสร้างเซสชันคอมพิวเตอร์

source: Folders to mount only lists the data folders that the user can currently mount. For example, project folders used by other projects are not exposed in Folders to mount. The storage host for each folder is also displayed under the folder's name.
th: โฟลเดอร์ที่จะแมปจะแสดงเฉพาะโฟลเดอร์ข้อมูลที่ผู้ใช้สามารถแมปได้ในขณะนี้ ตัวอย่างเช่น โฟลเดอร์โครงการที่ใช้โดยโครงการอื่นจะไม่แสดงในโฟลเดอร์ที่จะแมป โฮสต์เก็บข้อมูลสำหรับแต่ละโฟลเดอร์จะแสดงอยู่ใต้ชื่อโฟลเดอร์ด้วย

source: Now, open the terminal by clicking the terminal icon in the created session. If you run ``ls`` command in the terminal, you can see that the ``user1-ml-test`` and ``user2-vfolder`` folders are mounted under the home directory.
th: ตอนนี้เปิดเทอร์มินัลโดยการคลิกที่ไอคอนเทอร์มินัลในเซสชันที่สร้างขึ้น หากคุณรันคำสั่ง ``ls`` ในเทอร์มินัล คุณจะเห็นว่าโฟลเดอร์ ``user1-ml-test`` และ ``user2-vfolder`` ถูกเมานต์อยู่ใต้ไดเรกทอรีโฮม

source: The selected folder, by default, will be mounted with its name under ``/home/work/`` inside the compute session. For example, if a folder's name is ``test``, it is mounted on ``/home/work/test``. In case you want to customize the mount path, write the absolute path in the Path & Alias input field. If you write ``/workspace`` in the input field for the ``test`` folder, it will be mounted on ``/workspace`` inside the session. Writing a relative path will mount the folder under ``/home/work/`` with the path.
th: โฟลเดอร์ที่เลือกจะถูกนำเข้ามาโดยค่าเริ่มต้นด้วยชื่อของมันที่อยู่ภายใต้ ``/home/work/`` ในเซสชันการคอมพิวเตอร์ ตัวอย่างเช่น หากชื่อโฟลเดอร์คือ ``test`` มันจะถูกนำเข้าไปที่ ``/home/work/test`` ในกรณีที่คุณต้องการปรับแต่งเส้นทางการนำเข้า ให้เขียนเส้นทางที่แน่นอนในช่องป้อนข้อมูล Path & Alias หากคุณเขียน ``/workspace`` ในช่องป้อนข้อมูลสำหรับโฟลเดอร์ ``test`` มันจะถูกนำเข้าไปที่ ``/workspace`` ภายในเซสชัน การเขียนเส้นทางสัมพันธ์จะนำเข้าโฟลเดอร์ภายใต้ ``/home/work/`` ด้วยเส้นทางนั้น

source: Let's create a ``test_file`` under ``user2-vfolder`` to see if the file can be preserved after the compute session is terminated. The contents of this file will be "file inside user2-vfolder".
th: มาสร้าง ``test_file`` ภายใต้ ``user2-vfolder`` เพื่อดูว่าไฟล์สามารถเก็บรักษาได้หลังจากเซสชันการประมวลผลสิ้นสุดลงหรือไม่ เนื้อหาของไฟล์นี้จะเป็น "ไฟล์ภายใน user2-vfolder"

source: Mounted folders in terminal
ja: 端末にマウントされたフォルダ
th: โฟลเดอร์ที่ถูกติดตั้งในเทอร์มินัล

source: If you run ``ls`` command against ``user2-vfolder``, you can see that the file was created successfully. Also note the contents of the file with the ``cat`` command.
th: หากคุณรันคำสั่ง ``ls`` กับ ``user2-vfolder`` คุณจะเห็นว่าไฟล์ถูกสร้างขึ้นสำเร็จ นอกจากนี้ยังให้สังเกตเนื้อหาของไฟล์ด้วยคำสั่ง ``cat``

source: Now delete the compute session and go to the Storage page. Locate the ``user2-vfolder folder``, open a file explorer and check that the file ``test_file`` exists. Click the file download button in Actions to download the file to the local machine and open it to confirm that the contents of the file are "file inside user2-vfolder".
th: ตอนนี้ลบเซสชันการคอมพิวเตอร์และไปที่หน้าที่จัดเก็บ ค้นหาโฟลเดอร์ ``user2-vfolder`` เปิดไฟล์สำรวจและตรวจสอบว่าไฟล์ ``test_file`` มีอยู่ คลิกปุ่มดาวน์โหลดไฟล์ใน Actions เพื่อดาวน์โหลดไฟล์ไปยังเครื่องโดยใช้และเปิดมันเพื่อยืนยันว่าข้อมูลในไฟล์คือ "ไฟล์ภายใน user2-vfolder"

source: Download icon in the folder explorer
ja: フォルダーエクスプローラーのダウンロードアイコン
th: ไอคอนดาวน์โหลดในโฟลเดอร์สำรวจ

source: Like this, when creating a compute session, you can mount storage folders and perform any file operations on those mounted folders to save data even after the compute session termination.
th: เช่นนี้เมื่อสร้างเซสชันการประมวลผล คุณสามารถเชื่อมต่อโฟลเดอร์จัดเก็บข้อมูลและดำเนินการไฟล์ใด ๆ บนโฟลเดอร์ที่เชื่อมต่อนั้นเพื่อบันทึกข้อมูลแม้หลังจากการสิ้นสุดเซสชันการประมวลผล

source: Sometimes you need a new program or library that is not pre-installed in a compute session. In that case, you can install packages and configure a certain environment regardless of the type of compute session by using the Storage folder, which persists independent of session lifecycle, and the :ref:`automount folder<automount-folder>`.
th: บางครั้งคุณจำเป็นต้องใช้โปรแกรมหรือไลบรารีใหม่ที่ไม่ได้ติดตั้งไว้ล่วงหน้าในเซสชันการคำนวณ ในกรณีนี้คุณสามารถติดตั้งแพ็คเกจและกำหนดค่าบางสภาพแวดล้อมได้โดยไม่คำนึงถึงประเภทของเซสชันการคำนวณโดยใช้โฟลเดอร์ Storage ซึ่งยังคงมีอยู่และไม่ขึ้นอยู่กับวงจรชีวิตของเซสชัน และ :ref:`automount folder<automount-folder>`

source: Creating a folder named ``.local`` allows a user to install Python user packages in that folder. This is because ``pip`` by default installs the packages in the ``.local`` folder under the user's home folder (note that automount folder is mounted under user's home folder). So, if you want to install and keep the Python package ``tqdm`` regardless of the type of computing environment, you can issue the following command in your terminal:
th: การสร้างโฟลเดอร์ที่มีชื่อว่า ``.local`` จะอนุญาตให้ผู้ใช้ติดตั้งแพ็คเกจ Python ในโฟลเดอร์นั้น นี่เป็นเพราะว่า ``pip`` โดยปริยายจะติดตั้งแพ็คเกจในโฟลเดอร์ ``.local`` ที่อยู่ภายใต้โฟลเดอร์โฮมของผู้ใช้ (โปรดทราบว่าโฟลเดอร์ที่ติดตั้งแบบอัตโนมัติจะถูกติดตั้งอยู่ภายใต้โฟลเดอร์โฮมของผู้ใช้) ดังนั้น หากคุณต้องการติดตั้งและเก็บรักษาแพ็คเกจ Python ``tqdm`` โดยไม่คำนึงถึงประเภทของสภาพแวดล้อมการคำนวณ คุณสามารถป้อนคำสั่งต่อไปนี้ในเทอร์มินัลของคุณ:

source: After that, when a new compute session is created, the ``.local`` folder where the ``tqdm`` package is installed is automatically mounted, so you can use the ``tqdm`` package without reinstalling.
th: หลังจากนั้น เมื่อมีการสร้างเซสชันการคอมพิวเตอร์ใหม่ โฟลเดอร์ ``.local`` ซึ่งติดตั้งแพ็คเกจ ``tqdm`` จะถูกเมานต์โดยอัตโนมัติ ดังนั้นคุณสามารถใช้แพ็คเกจ ``tqdm`` ได้โดยไม่ต้องติดตั้งใหม่

source: If you spawn multiple sessions that use different Python versions, there may be compatibility issues with the packages. This can be circumvented by branching ``PYTHONPATH`` environment variable via the ``.bashrc``. This is because the user's ``pip`` package is installed in the path specified in the ``PYTHONPATH``.
th: ถ้าคุณสร้างเซสชันหลายอันที่ใช้เวอร์ชัน Python ที่แตกต่างกัน อาจมีปัญหาความเข้ากันได้กับแพ็กเกจต่างๆ วิธีแก้ไขคือการแยกสาขาตัวแปรสภาพแวดล้อม ``PYTHONPATH`` ผ่านไฟล์ ``.bashrc`` นี่เป็นเพราะแพ็กเกจ ``pip`` ของผู้ใช้ถูกติดตั้งในเส้นทางที่ระบุใน ``PYTHONPATH``

source: Package managers like Ubuntu ``apt`` or CentOS ``yum`` usually require the ``root`` permission. For security reasons, ``sudo`` and ``root`` accesses are blocked by default in Backend.AI's compute session (it may be allowed depending on the configuration), so we recommend to use `Homebrew on Linux <https://docs.brew.sh/Homebrew-on-Linux>`_ which does not require ``sudo``.
th: โปรแกรมจัดการแพ็คเกจเช่น Ubuntu ``apt`` หรือ CentOS ``yum`` มักต้องการสิทธิ์ ``root`` จากเหตุผลด้านความปลอดภัย สิทธิ์ ``sudo`` และ ``root`` จะถูกบล็อกตามค่าเริ่มต้นในเซสชันการคำนวณของ Backend.AI (อาจได้รับอนุญาตขึ้นอยู่กับการกำหนดค่า) ดังนั้นเราขอแนะนำให้ใช้ `Homebrew on Linux <https://docs.brew.sh/Homebrew-on-Linux>`_ ซึ่งไม่ต้องการ ``sudo``.

source: Homebrew packages can be installed like:
th: สามารถติดตั้งแพ็คเกจ Homebrew ได้ดังนี้:

source: ``brew`` installs packages under ``/home/linuxbrew/.linuxbrew`` which is automatically mounted when ``.linuxbrew`` folder exists. So, if you create a automount folder named ``.linuxbrew``, Homebrew packages can be kept after the compute session is destroyed and then reused for the next compute session.
th: ``brew`` ติดตั้งแพ็กเกจภายใต้ ``/home/linuxbrew/.linuxbrew`` ซึ่งจะถูกติดตั้งอัตโนมัติเมื่อมีโฟลเดอร์ ``.linuxbrew`` อยู่ ดังนั้น หากคุณสร้างโฟลเดอร์อัตโนมัติที่ชื่อว่า ``.linuxbrew`` แพ็กเกจของ Homebrew สามารถเก็บไว้ได้หลังจากที่เซสชันการคอมพิวเตอร์ถูกทำลายและนำกลับมาใช้งานสำหรับเซสชันการคอมพิวเตอร์ถัดไปได้

source: Go to 'Sessions' page and click the 'Start' button. After filling out the 'Session Type', 'Environments & Resource allocation' pages, navigate to the 'Data & Folders' page to see a list of folders that users can mount. From this list, choose the folders to mount and add them, or select multiple folders to mount more. The documentation will explain how to mount two folders, ``user1-ml-test`` and ``user2-vfolder``, and then create a session.
ja: 「セッション」ページに移動し、「スタート」ボタンをクリックします。「セッションタイプ」、「環境およびリソース割り当て」ページを入力した後、「データ＆フォルダ」ページに移動して、ユーザーがマウントできるフォルダの一覧を確認します。この一覧からマウントするフォルダを選択して追加するか、複数のフォルダを選択してさらにマウントします。ドキュメントでは、2つのフォルダ「user1-ml-test」と「user2-vfolder」をマウントし、セッションを作成する方法を説明します。

source: By looking at the data and folder information within that project, users can see information such as usage mode, the storage host the folder belongs to, permissions, and more. Note that the 'Data & Folders' page only outputs data folders that are mountable by the current user. For example, folders that belong to other projects cannot be viewed.
ja: そのプロジェクト内のデータとフォルダー情報を見ることで、ユーザーは使用モード、フォルダーが所属するストレージホスト、権限などの情報を確認できます。「データ＆フォルダー」ページは、現在のユーザーによってマウント可能なデータフォルダーのみを出力することに注意してください。たとえば、他のプロジェクトに属するフォルダーは表示できません。

source: Accessing the 'Data & Storage' side menu will show the information related to the folders. From this menu, users can view the folders that have been created, create new folders, and upload files. For more detailed instructions related to folders, please refer :ref:`Explore Folder<explore_folder>` section.
ja: 「データとストレージ」のサイドメニューにアクセスすると、フォルダに関連する情報が表示されます。このメニューから、ユーザーは作成されたフォルダを表示したり、新しいフォルダを作成したり、ファイルをアップロードしたりできます。フォルダに関連する詳細な手順については、:ref:`Explore Folder<explore_folder>` セクションを参照してください。

source: Alternatively, a new virtual folder can be created by clicking the '+ Add' button. For further information on how to create a new folder in session launcher page, please refer :ref:`Create storage folder<create_storage_folder>` section.
ja: 代わりに、「+ 追加」ボタンをクリックすることで新しい仮想フォルダーを作成することができます。セッションランチャーページで新しいフォルダーを作成する方法の詳細については、:ref:`ストレージフォルダーの作成<create_storage_folder>`セクションを参照してください。
