Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/vfolder/vfolder.po
Languages: ja, ko, th

source: You can create a storage folder with the desired name by clicking the NEW FOLDER button. Enter the name of the folder to be created in Folder name, and select one of User / Project for Type. (Depending on the server settings, only one of User or Project may be selectable.) When creating a project folder, the Project field must be set. The project folder will be bound to the project specified in the Project field, and only users belonging to the project can mount and use the project folder. After setting the values as desired, you can create a folder by clicking the CREATE button.
ko: NEW FOLDER 버튼을 눌러서 폴더를 원하는 이름으로 생성할 수 있습니다. Folder name에 생성할 폴더의 이름을 입력하고, Type은 User/Project 중 하나를 선택합니다. (서버 설정에 따라 User, Project 중 하나만 선택 가능할 수 있습니다.) 프로젝트 폴더를 생성할 경우 Project 필드를 설정해 주어야 합니다. 프로젝트 폴더는 Project 필드에 지정된 프로젝트 전용이 되며, 해당 프로젝트에 속해있는 사용자만 그 프로젝트 폴더를 마운트해서 사용할 수 있습니다. 원하는 대로 값을 설정한 후 CREATE 버튼을 클릭하여 폴더를 생성할 수 있습니다.

source: You can click the folder icon in the Control panel to bring up a file explorer where you can view the contents of that folder.
ko: Control 열의 폴더 아이콘을 클릭하여 해당 폴더의 내용을 조회할 수 있는 파일 탐색기를 띄울 수 있습니다.

source: You can see that directories and files inside the folder will be listed, if exists. Click a directory name in the Name panel to move to the directory. You can click the download button or delete button in the Actions panel to download it or delete it entirely from the directory. You can rename a file/directory as well. For more detailed file operations, you can mount this folder when creating a compute session, and then use a service like Terminal or Jupyter Notebook to do it.
ko: 내부에 폴더 및 파일이 존재하고 있는 것을 확인할 수 있습니다. Name 열에 있는 폴더 이름을 클릭하면 해당 폴더로 이동할 수 있습니다. Actions 열의 다운로드 버튼과 삭제 버튼을 클릭하여 파일을 받거나 폴더 상에서 완전히 삭제할 수 있습니다. 파일과 디렉토리의 이름을 변경하는 것도 가능합니다. 보다 섬세한 파일 작업이 필요하다면 이 폴더를 연산 세션 생성 시 마운트 한 뒤 터미널이나 Jupyter Notebook 등과 같은 서비스를 활용해서 수행할 수 있습니다.

source: You can create a new directory on the current path with the NEW FOLDER button (in the file explorer), or upload a local file with the UPLOAD FILES button. All of these file operations can also be performed using the above-described method of mounting folders into a compute session.
ko: NEW FOLDER 버튼으로 현재 경로 상에 새로운 폴더를 생성할 수 있으며, UPLOAD FILES 버튼으로 현재 경로에 로컬 파일을 업로드 할 수도 있습니다. 이런 파일 작업은 앞서 설명한 연산 세션 마운트 방식으로도 모두 수행 가능합니다.

source: If you have permission to rename the storage folder, you can rename it by clicking the edit icon in the Control panel. When you click the icon button, a rename dialog will appear. Write new folder name and then click UPDATE button.
ko: Storage 폴더의 이름을 변경할 수 있는 권한을 가지고 있는 경우, Control 열의 편집 아이콘을 클릭해서 이름 변경 작업을 수행할 수 있습니다. 편집 아이콘을 클릭하면 이름 변경 다이얼로그가 나타나게 됩니다. 새로운 폴더 이름을 기록한 후 UPDATE 버튼을 클릭하십시오.

source: If you have permission to delete the storage folder, you can delete it by clicking the trash can icon in the Control panel. When you click the Delete button, a confirm dialog appears. To prevent accidental deletion, you have to enter the name of the folder to be deleted, explicitly.
ko: 저장소 폴더 삭제 권한이 있는 경우 제어판에서 휴지통 아이콘을 클릭하여 삭제할 수 있습니다. 삭제 버튼을 클릭하면 확인 대화 상자가 나타납니다. 실수로 삭제되는 것을 방지하기 위해 삭제할 폴더의 이름을 명시적으로 입력해야합니다.

source: When delete operation starts, It may take some time in order to delete the target folder completely from storage host. Meanwhile, in order to block unintended operation such as accessing any file/directory inside the folder on-delete status, we disable any accessing operations.
ko: 삭제 작업이 시작되고 나서도, 실제 저장된 공간에서 대상 폴더를 삭제하는 데 시간이 다소 소요될 수 있습니다. 삭제중인 상태의 폴더에 접근하려 하는 것과 같은 의도치 않은 작업을 막기 위해, 폴더에 접근할 수 있는 액션은 모두 비활성화됩니다.

source: The folders created here can be mounted when creating a compute session. Folders are mounted under the user's default working directory, ``/home/work/``, and the files stored in the mounted directory will not be deleted when the compute session is terminated. (However, if you delete the folder itself, it will be gone).
ko: 여기서 생성한 폴더는 연산 세션을 만들 때 마운트 할 수 있습니다. 폴더는 사용자의 기본 작업 폴더인 ``/home/work/`` 폴더 아래에 마운트 되며, 이 폴더에 저장한 파일은 연산 세션이 종료되어도 사라지지 않습니다(단, 폴더 자체를 삭제하면 사라지게 됩니다).

source: Data & Storage page has an Automount Folders tab. Click this tab to see a list of folders whose names prefixed with a dot (.). When you create a folder, if you specify a name that starts with a dot (.), it is added to the Automount Folders tab, not the Folders tab. Automount Folders are special folders that are automatically mounted in your home directory even if you do not mount them manually when creating a compute session. By using this feature, creating and using Storage folders such as ``.local``, ``.linuxbrew``, ``.pyenv``, etc., you can configure a certain user packages or environments that do not change with different kinds of compute session.
ko: 데이터 & 폴더 페이지에는 Automount Folders 탭이 있습니다. 이 탭을 클릭하면 이름이 점(.)으로 시작하는 폴더 리스트를 볼 수 있습니다. 폴더를 생성할 때 점(``.``)으로 시작하는 이름을 지정하면 Folders 탭이 아닌 Automount Folders 탭에 추가됩니다. Automount Folders는 연산 세션 생성 시 별도로 마운트 하지 않더라도 자동으로 홈 디렉토리에 마운트 되는 특수한 폴더입니다. 이를 이용하여, ``.local``, ``.linuxbrew``, ``.pyenv`` 등과 같은 Storage 폴더를 생성해서 사용하면 연산 세션에 관계없이 늘 일정한 사용자 패키지 또는 환경을 구성할 수 있습니다.

source: Model folders
ko: 모델 폴더

source: From the 24.03, Backend.AI supports a new feature called 'Model Store'. The newly added \"Models\" tab offers users a unified model store interface, enabling easy management and access to various machine learning and deep learning models. The features and usage of the \"Models\" tab will be updated in the 24.03 documentation.
ko: Backend.AI는 24.03 버전 이후 'Model Store' 기능을 제공합니다. 새롭게 추가된 “Model“ 탭은 사용자에게 통합된 모델 저장소 인터페이스를 제공하여 다양한 머신 러닝 및 딥러닝 모델을 쉽게 관리하고 액세스할 수 있도록 합니다. “Model” 탭의 기능과 사용법은 24.03 문서에서 업데이트될 예정입니다.

source: User can create at least one compute session
ko: 최소 1개 이상의 세션 생성 가능

source: User can allocated at least 1 core of CPU and 512 MB of memory
ko: 최소 CPU 1 core, RAM 0.5 GB 이상의 여유 자원

source: Image that supports FileBrowser has been installed
ko: 파일 브라우저를 지원하는 이미지가 설치되어 있음

source: Execute FileBrowser from file explorere dialog of a data folder in Data & Stroage page
ko: Data & Storage 메뉴 내 폴더 탐색기 창에서 실행

source: Launch a compute session directly from a FileBrowser image on Sessions page
ko: Sessions 페이지에서 파일 브라우저 이미지로 연산 세션 직접 생성

source: Go to the Data & Storage page and open the file explorer dialog of target data folder. Click the folder icon or the folder name to open the file explorer.
ko: Data & Storage 페이지로 이동 후 원하는 데이터 폴더의 탐색기 창을 띄웁니다. 폴더 아이콘 혹은 폴더 이름을 클릭하여 파일 탐색기를 띄웁니다.

source: Click EXECUTE FILEBROWSER button in the upper-right corner of the explorer.
ko: 탐색기 우측 상단의 파일 브라우저 실행 버튼을 클릭해주세요.

source: When user clicks EXECUTE FILEBROWSER, Backend.AI automatically creates a dedicated compute session for the app. So, in the Sessions page, you should see FileBrowser compute session. It is user's reponsibility to delete this compute session.
ko: 사용자가 EXECUTE FILEBROWSER 버튼을 클릭하면, Backend.AI는 자동으로 파일 브라우저 전용 연산 세션을 하나 생성하게 됩니다. 따라서, Sesssions 페이지에서 파일 브라우저 연산 세션이 조회되는 것을 확인할 수 있습니다. 이 연산 세션을 삭제하는 것은 사용자의 몫입니다.

source: If you accidentally close the FileBrowser window and want to reopen it, just go to Sessions page and click the FileBrowser application icon of the FileBrowser compute session.
ko: 파일 브라우저 창을 실수로 종료하여 다시 열고자 한다면, Sessions 페이지로 가서 해당 세션의 Control 열에 있는 애플리케이션 아이콘을 선택하고 파일 브라우저 버튼을 클릭하면 됩니다.

source: When you click EXECUTE FILEBROWSER button again in the data folder explorer, a new compute session will be created and a total of two FileBrowser sessions will appear.
ko: 만약 탐색기에서 파일브라우저 실행 버튼을 다시 클릭하면 새로운 세션이 생성되어 총 두 개의 파일 브라우저 연산 세션이 나타나게 됩니다.

source: Click the arrow icon in the upper right corner of FileBrowser
ko: 파일 브라우저 창 우측 상단의 화살표 아이콘을 클릭합니다.

source: Click MOVE button
ko: MOVE 버튼을 클릭합니다.

source: From 22.09, Backend.AI supports SSH / SFTP file upload from both desktop app and web-based Web-UI. The SFTP server allows you to upload files quickly through reliable data streams.
ko: Backend.AI 22.09 버전부터 데스크탑 앱 및 웹 기반 Web-UI 환경에서 SSH / SFTP 프로토콜을 통해 파일을 업로드 할 수 있는 방법을 제공합니다. SFTP 서버를 사용하여 안정적으로 빠르게 파일을 업로드할 수 있습니다.

source: Click RUN SFTP SERVER button in the upper-right corner of the explorer.
ko: 탐색기 우측 상단의 SFTP 서버 사용 버튼을 클릭해주세요.

source: We provide a detailed information about using large file upload via ssh/sftp connection. For more information, please click the ``Read more`` text link to see all the details of execution.
ko: 대용량 파일 업로드를 SSH/SFTP 연결을 통해 수행하는 방법을 상세히 제공하고 있습니다. 자세한 정보를 확인하시려면, ``더 알아보기`` 텍스트 링크를 클릭하여 실행에 대한 상세 정보를 확인해주시기 바랍니다.

source: For the connection, click "DOWNLOAD SSH KEY" button to download the SSH private key (``id_container``). Also, remember the host and port number. Then, you can copy your files to the session using the Connection Example code written in the dialog, or referring to the following guide: :ref:`link<sftp_connection_for_linux_and_mac>`. To perserve the files, you need to transfer the files to the data folder. Also, the session will be terminated when there is no transfer for some time.
ko: 연결을 위해 “SSH 키 다운로드” 버튼을 클릭하여 SSH 비밀키(``id_container``)를 다운로드 합니다. 접속 주소와 포트 번호도 기억해 두십시오. 다이얼로그에 적힌 접속 예제 코드를 참고하거나, 다음 링크 를 참고하여 세션으로 파일을 전송할 수 있습니다. :ref:`link<sftp_connection_for_linux_and_mac>` 파일을 보존하려면 데이터 폴더로 복사하십시오. 또한, 일정 시간 동안 파일 전송이 없는 경우에는 세션이 삭제될 수 있습니다.
