Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/vfolder/vfolder.po
Languages: ja, ko, th

source: Click one of the model cards and you will see the modal that describes what is all about the model. If you want to clone the current model card to your folder, click 'Clone to a folder' button on the right top of the modal.
ja: モデルカードの1つをクリックすると、モデルに関する説明が表示されるモーダルが表示されます。現在のモデルカードを自分のフォルダにクローンしたい場合は、モーダルの右上にある「フォルダにクローン」ボタンをクリックしてください。
th: คลิกที่การ์ดโมเดลใด ๆ และคุณจะเห็นโมดัลที่อธิบายว่าโมเดลนั้นเกี่ยวกับอะไร หากคุณต้องการโคลนการ์ดโมเดลปัจจุบันไปยังโฟลเดอร์ของคุณ ให้คลิกที่ปุ่ม 'Clone to a folder' ที่มุมขวาบนของโมดัล

source: Only project admin can edit model cards in model store. If you want to add your own model card and share it to others, please contact your project admin.
ja: プロジェクト管理者のみがモデルストアでモデルカードを編集できます。自分のモデルカードを追加して他の人と共有したい場合は、プロジェクト管理者に連絡してください。
th: เฉพาะผู้ดูแลโครงการเท่านั้นที่สามารถแก้ไขการ์ดโมเดลในร้านโมเดลได้ หากคุณต้องการเพิ่มการ์ดโมเดลของคุณเองและแบ่งปันให้ผู้อื่น กรุณาติดต่อผู้ดูแลโครงการของคุณ

source: Model card description
ja: モデルカードの説明
th: คำอธิบายบัตรโมเดล

source: After clicking the button, another modal will appear which configures model card cloning. Enter the folder name and set the permission as is (if you want to use it by yourself), and Click 'Clone' button below.
ja: ボタンをクリックすると、モデルカードのクローン作成を設定する別のモーダルが表示されます。フォルダー名を入力し、（自分で使用したい場合は）そのままの権限を設定し、下の「Clone」ボタンをクリックします。
th: หลังจากคลิกปุ่มแล้ว โมดัลอีกอันจะปรากฏขึ้นซึ่งใช้ในการกำหนดค่าการทำซ้ำการ์ดโมเดล ให้กรอกชื่อโฟลเดอร์และตั้งค่าการอนุญาตตามที่เป็นอยู่ (หากคุณต้องการใช้ด้วยตนเอง) จากนั้นคลิกปุ่ม 'Clone' ด้านล่าง

source: Model card clone dialog
ja: モデルカードクローンダイアログ
th: กล่องโต้ตอบการโคลนบัตรโมเดล

source: After cloning process is successfully done, you can see the new folder has been created in your folder list. You can find it in 'Models' tab.
ja: クローンプロセスが正常に完了すると、新しいフォルダーがフォルダーリストに作成されたことがわかります。それは「モデル」タブで見つけることができます。
th: หลังจากกระบวนการโคลนเสร็จสิ้น คุณจะเห็นว่าโฟลเดอร์ใหม่ได้ถูกสร้างขึ้นในรายการโฟลเดอร์ของคุณ คุณสามารถค้นหาได้ในแท็บ 'Models'

source: Model card in folder list
ja: フォルダリスト内のモデルカード
th: บัตรโมเดลในรายชื่อโฟลเดอร์

source: Also, you can check what's inside the model card by accessing the folder you just cloned.
ja: また、クローンしたフォルダーにアクセスして、モデルカードの中身を確認することもできます。
th: นอกจากนี้ คุณยังสามารถตรวจสอบสิ่งที่อยู่ภายในการ์ดโมเดลโดยการเข้าถึงโฟลเดอร์ที่คุณเพิ่งโคลนมา。

source: Cloned model card folder explorer
ja: クローンされたモデルカードフォルダエクスプローラー
th: โฟลเดอร์สำรวจการ์ดโมเดลที่ทำสำเนา

source: If you want to use pre-trained model that you cloned from, then please refer to `Model Variant: Easily Serving Various Model Services <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_.
ja: クローンした事前訓練モデルを使用したい場合は、`モデルバリアント：様々なモデルサービスを簡単に提供 <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_ を参照してください。
th: หากคุณต้องการใช้โมเดลที่ผ่านการฝึกสอนล่วงหน้าซึ่งคุณได้ทำการโคลนจากนั้นกรุณาอ้างอิงไปที่ `Model Variant: Easily Serving Various Model Services <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_.

source: Using FileBrowser
ja: ファイルブラウザの使用
ko: 파일 브라우저 사용하기
th: การใช้ FileBrowser

source: GPU Platform supports `FileBrowser <https://filebrowser.org>`_ from version 20.09. FileBrowser is a program that helps you manage files on a remote server through a web browser. This is especially useful when uploading a directory from the user's local machine.
th: GPU Platform รองรับ `FileBrowser <https://filebrowser.org>`_ ตั้งแต่เวอร์ชัน 20.09 FileBrowser เป็นโปรแกรมที่ช่วยให้คุณจัดการไฟล์บนเซิร์ฟเวอร์ระยะไกลผ่านเว็บเบราว์เซอร์ ซึ่งมีประโยชน์โดยเฉพาะเมื่ออัปโหลดไดเรกทอรีจากเครื่องคอมพิวเตอร์ท้องถิ่นของผู้ใช้

source: Currently, GPU Platform provides a FileBrowser as an application of a compute session. Therefore, the following conditions are required to launch it.
th: ปัจจุบัน GPU Platform มี FileBrowser เป็นแอปพลิเคชันของเซสชันการคำนวณ ดังนั้น จึงมีเงื่อนไขต่อไปนี้ที่จำเป็นต้องมีเพื่อเรียกใช้มัน

source: User can create at least one compute session.
ja: ユーザーは、少なくとも1つのコンピュートセッションを作成できます。
th: ผู้ใช้สามารถสร้างเซสชันการคอมพิวเตอร์ได้อย่างน้อยหนึ่งเซสชัน

source: User can allocated at least 1 core of CPU and 512 MB of memory.
ja: ユーザーは少なくとも1コアのCPUと512 MBのメモリを割り当てることができる。
th: ผู้ใช้สามารถกำหนดสรรพคุณอย่างน้อย 1 แกนของ CPU และ 512 MB ของหน่วยความจำ

source: Image that supports FileBrowser must be installed.
ja: FileBrowser をサポートするイメージをインストールする必要があります。
th: ภาพที่สนับสนุน FileBrowser ต้องถูกติดตั้ง

source: You can access FileBrowser in two ways.
ja: ファイルブラウザには2つの方法でアクセスできます。
ko: 파일 브라우저는 두 가지 방법으로 사용할 수 있습니다.
th: คุณสามารถเข้าถึง FileBrowser ได้สองวิธี

source: Execute FileBrowser from file explorer dialog of a data folder in Data & Storage page.
ja: Data & StorageページのデータフォルダのファイルエクスプローラーダイアログからFileBrowserを実行します。
th: เรียกใช้ FileBrowser จากกล่องโต้ตอบสำรวจไฟล์ของโฟลเดอร์ข้อมูลในหน้าข้อมูล & การจัดเก็บ

source: Launch a compute session directly from a FileBrowser image on Sessions page.
ja: セッションページのFileBrowserイメージから直接コンピュートセッションを起動します。
th: เริ่มเซสชันการคอมพิวเตอร์โดยตรงจากภาพ FileBrowser ในหน้าเซสชัน

source: Execute FileBrowser from folder explorer dialog in Data & Storage page
ja: データ＆ストレージページのフォルダーエクスプローラーダイアログからFileBrowserを実行
ko: Data & Storage 페이지의 폴더 탐색기에서 파일 브라우저 실행
th: เรียกใช้ FileBrowser จากกล่องโต้ตอบสำรวจโฟลเดอร์ในหน้าข้อมูลและที่เก็บข้อมูล

source: Go to the Data & Storage page and open the file explorer dialog of target data folder. Click the folder button or the folder name to open the file explorer.
ja: データ & ストレージページに移動し、対象データフォルダーのファイルエクスプローラーダイアログを開きます。フォルダーボタンまたはフォルダー名をクリックしてファイルエクスプローラーを開きます。
th: ไปที่หน้าข้อมูล & การจัดเก็บ และเปิดกล่องโต้ตอบเรียกดูไฟล์ของโฟลเดอร์ข้อมูลเป้าหมาย คลิกที่ปุ่มโฟลเดอร์หรือชื่อโฟลเดอร์เพื่อเปิดตัวเรียกดูไฟล์

source: first step to access FileBrowser
ja: FileBrowserにアクセスする最初のステップ
th: ขั้นตอนแรกในการเข้าถึง FileBrowser

source: Click 'EXECUTE FILEBROWSER' button in the upper-right corner of the explorer.
ja: エクスプローラーの右上にある「EXECUTE FILEBROWSER」ボタンをクリックします。
th: คลิกปุ่ม 'EXECUTE FILEBROWSER' ที่มุมขวาบนของตัวสำรวจ

source: Folder explorer with FileBrowser
ja: FileBrowserによるフォルダーエクスプローラー
th: การสำรวจโฟลเดอร์ด้วย FileBrowser

source: You can see the FileBrowser is opened in a new window. You can also see that the data folder you opened the explorer dialog becomes the root directory. From the FileBrowser window, you can freely upload, modify, and delete any directories and files.
ja: FileBrowserが新しいウィンドウで開かれているのがわかります。また、エクスプローラーダイアログで開いたデータフォルダがルートディレクトリになっているのがわかります。FileBrowserウィンドウから、ディレクトリやファイルを自由にアップロード、変更、削除することができます。
ko: 파일 브라우저가 새 창에서 열린 것을 확인할 수 있습니다. 탐색기를 열었던 저장 폴더가 파일 브라우저의 루트 디렉토리가 되는 것도 알 수 있습니다. 파일 브라우저 창에서 디렉토리와 파일을 자유롭게 업로드하고 수정하고 삭제할 수 있습니다.
th: คุณสามารถเห็นว่า FileBrowser ถูกเปิดในหน้าต่างใหม่ คุณยังสามารถเห็นว่าหมายเหตุข้อมูลที่คุณเปิดหน้าต่างสำรวจกลายเป็นโฟลเดอร์หลัก จากหน้าต่าง FileBrowser คุณสามารถอัปโหลด แก้ไข และลบโฟลเดอร์และไฟล์ใด ๆ ได้อย่างอิสระ

source: FileBrowser with new window
ja: 新しいウィンドウでファイルブラウザ
th: FileBrowser กับหน้าต่างใหม่

source: When user clicks 'EXECUTE FILEBROWSER' button, GPU Platform automatically creates a dedicated compute session for the app. So, in the Sessions page, you should see FileBrowser compute session. It is user's responsibility to delete this compute session.
th: เมื่อผู้ใช้คลิกปุ่ม 'EXECUTE FILEBROWSER' ระบบ GPU Platform จะสร้างเซสชันการคำนวณเฉพาะสำหรับแอปโดยอัตโนมัติ ดังนั้นในหน้าเซสชัน คุณควรเห็นเซสชันการคำนวณ FileBrowser เป็นความรับผิดชอบของผู้ใช้ในการลบเซสชันการคำนวณนี้

source: FileBrowser in session page
ja: セッションページのファイルブラウザ
th: FileBrowser ในหน้าเซสชัน

source: If you accidentally close the FileBrowser window and want to reopen it, just go to Sessions page and click the FileBrowser application button of the FileBrowser compute session.
ja: 誤ってFileBrowserウィンドウを閉じてしまい、再度開きたい場合は、Sessionsページに移動してFileBrowserコンピュートセッションのFileBrowserアプリケーションボタンをクリックします。
th: หากคุณปิดหน้าต่าง FileBrowser โดย accident และต้องการเปิดใหม่เพียงแค่ไปที่หน้า Sessions และคลิกปุ่มแอปพลิเคชัน FileBrowser ของเซสชันการคอมพิวเตอร์ FileBrowser

source: When you click 'EXECUTE FILEBROWSER' button again in the data folder explorer, a new compute session will be created and a total of two FileBrowser sessions will appear.
ja: データフォルダーエクスプローラーで 'EXECUTE FILEBROWSER' ボタンを再度クリックすると、新しいコンピュートセッションが作成され、合計で2つのFileBrowserセッションが表示されます。
th: เมื่อคุณคลิกที่ปุ่ม 'EXECUTE FILEBROWSER' อีกครั้งในตัวสำรวจโฟลเดอร์ข้อมูล จะมีการสร้างเซสชันการคำนวณใหม่และจะมีการแสดงเซสชัน FileBrowser ทั้งหมดสองรายการ

source: Create a compute session with FileBrowser image
ja: FileBrowserイメージでコンピュートセッションを作成する
ko: 파일 브라우저 이미지로 연산 세션 생성하기
th: สร้างเซสชันการคำนวณด้วยภาพ FileBrowser

source: You can directly create a compute session with FileBrowser supported images. You need to mount at least one or more data folders to access them. You can use FileBrowser without a problem even if you do not mount any data folder, but every uploaded/updated files will be lost after the session is terminated.
ja: FileBrowser対応のイメージを使用して直接コンピュートセッションを作成できます。アクセスするには、1つ以上のデータフォルダをマウントする必要があります。どのデータフォルダもマウントしなくても問題なくFileBrowserを使用できますが、セッション終了後にアップロード/更新されたファイルはすべて失われます。
ko: 파일 브라우저를 지원하는 이미지를 선택해서 연산 세션을 직접 생성할 수도 있습니다. 연산 세션 생성 시 작업하기 원하는 데이터 폴더를 하나 이상 마운트 하십시오. 아무 데이터 폴더를 마운트 하지 않아도 파일 브라우저 사용에는 문제가 없지만, 연산 세션이 종료되면 연산 세션에서 작업한 모든 파일이 삭제됩니다.
th: คุณสามารถสร้างเซสชันคอมพิวเตอร์ได้โดยตรงด้วยภาพที่รองรับโดย FileBrowser คุณจำเป็นต้องติดตั้งโฟลเดอร์ข้อมูลอย่างน้อยหนึ่งโฟลเดอร์เพื่อเข้าถึงพวกเขา คุณสามารถใช้ FileBrowser ได้โดยไม่มีปัญหาแม้ว่าคุณจะไม่ติดตั้งโฟลเดอร์ข้อมูลใด ๆ แต่ไฟล์ที่อัปโหลด/อัปเดตทุกไฟล์จะหายไปหลังจากเซสชันสิ้นสุด

source: The root directory of FileBrowser will be ``/home/work``. Therefore, you can access any mounted data folders for the compute session.
ja: FileBrowserのルートディレクトリは ``/home/work`` になります。したがって、計算セッションでマウントされたデータフォルダにアクセスできます。
ko: Sessions 페이지에서 생성한 파일브라우저의 root 디렉토리는 ``/home/work`` 입니다. 따라서, 연산 세션이 마운트된 모든 데이터 폴더에 자유롭게 접근할 수 있습니다.
th: ไดเรกทอรีรูทของ FileBrowser จะอยู่ที่ ``/home/work`` ดังนั้นคุณสามารถเข้าถึงโฟลเดอร์ข้อมูลที่ถูกติดตั้งสำหรับเซสชันการคอมพิวเตอร์ได้ทุกโฟลเดอร์

source: Basic usage examples of FileBrowser
ja: FileBrowserの基本的な使用例
ko: 파일 브라우저 기본 사용법
th: ตัวอย่างการใช้งานพื้นฐานของ FileBrowser

source: Here, we present some basic usage examples of FileBrowser in GPU Platform. Most of the FileBrowser operations are intuitive, but if you need more detailed guide, please refer to the `FileBrowser documentation <https://filebrowser.org>`_.
th: ที่นี่เรานำเสนอการใช้งานพื้นฐานบางอย่างของ FileBrowser ใน GPU Platform โดยการดำเนินการของ FileBrowser ส่วนใหญ่จะเป็นไปตามสัญชาตญาณ แต่หากคุณต้องการคู่มือที่ละเอียดมากขึ้น โปรดดูที่ `เอกสารของ FileBrowser <https://filebrowser.org>`_.

source: **Upload local directory using FileBrowser**
ja: **FileBrowserを使用してローカルディレクトリをアップロード**
ko: **파일 브라우저로 로컬 디렉토리 업로드 하기**
th: **อัปโหลดไดเรกทอรีท้องถิ่นโดยใช้ FileBrowser**

source: FileBrowser supports uploading one or more local directories while maintaining the tree structure. Click the upload button in the upper right corner of the window, and click Folder button. Then, local file explorer dialog will appear and you can select any directory you want to upload.
ja: FileBrowserは、ツリー構造を維持したまま、1つ以上のローカルディレクトリのアップロードをサポートしています。ウィンドウの右上隅にあるアップロードボタンをクリックし、フォルダボタンをクリックします。すると、ローカルファイルエクスプローラのダイアログが表示され、アップロードしたいディレクトリを選択できます。
ko: 파일 브라우저는 로컬 디렉토리 구조를 그대로 보존하여 업로드 할 수 있는 기능을 지원합니다. 파일 브라우저 윈도우 우측 상단의 업로드 버튼을 클릭한 후 Folder 버튼을 클릭하십시오. 로컬 파일 탐색창이 뜨는데, 여기서 업로드 하기 원하는 디렉토리를 선택하면 됩니다.
th: FileBrowser รองรับการอัปโหลดไดเรกทอรีท้องถิ่นหนึ่งหรือหลายไดเรกทอรีในขณะที่รักษาโครงสร้างต้นไม้ไว้ คลิกปุ่มอัปโหลดที่มุมขวาบนของหน้าต่าง จากนั้นคลิกปุ่มโฟลเดอร์ จะมีการแสดงกล่องโต้ตอบสำรวจไฟล์ท้องถิ่นขึ้นมา และคุณสามารถเลือกไดเรกทอรีใดก็ได้ที่คุณต้องการอัปโหลด

source: If you try to upload a file to a read-only folder, FileBrowser will raise a server error.
ja: 読み取り専用フォルダーにファイルをアップロードしようとすると、FileBrowser がサーバーエラーを発生させます。
ko: 읽기 전용 폴더에 파일을 업로드 하는 경우, FileBrowser가 서버 에러를 띄우게 됩니다.
th: หากคุณพยายามอัปโหลดไฟล์ไปยังโฟลเดอร์ที่มีสถานะเป็นอ่านอย่างเดียว FileBrowser จะเกิดข้อผิดพลาดของเซิร์ฟเวอร์

source: Let's upload a directory with the following structure.
ja: 次の構造を持つディレクトリをアップロードしましょう。
ko: 다음과 같은 구조를 가진 폴더를 업로드 해보겠습니다.
th: ให้เราอัปโหลดไดเรกทอรีที่มีโครงสร้างดังต่อไปนี้

source: After selecting ``foo`` directory, you can see the directory just uploaded successfully.
ja: ``foo`` ディレクトリを選択すると、アップロードが完了したディレクトリが表示されます。
ko: ``foo`` 디렉토리를 선택한 후 폴더가 성공적으로 업로드 된 것을 확인할 수 있습니다.
th: หลังจากที่เลือกไดเรกทอรี ``foo`` แล้ว คุณจะเห็นว่าไดเรกทอรีที่เพิ่งอัปโหลดสำเร็จแล้ว

source: You can also upload local files and directories by drag and drop.
ja: ドラッグアンドドロップでローカルファイルやディレクトリをアップロードすることもできます。
ko: 또한, 파일과 디렉토를 드래그 앤 드롭 하여 업로드할 수도 있습니다.
th: คุณยังสามารถอัปโหลดไฟล์และไดเรกทอรีในเครื่องได้โดยการลากและวาง

source: **Move files or directories to another directory**
ja: **ファイルまたはディレクトリを別のディレクトリに移動**
ko: **파일 또는 디렉토리를 다른 디렉토리로 옮기기**
th: **ย้ายไฟล์หรือไดเรกทอรีไปยังไดเรกทอรีอื่น**

source: Moving files or directories in data folder is also possible from FileBrowser. You can move files or directories by following steps below.
ja: データフォルダー内のファイルまたはディレクトリを移動することも、FileBrowserから可能です。以下の手順に従ってファイルまたはディレクトリを移動できます。
ko: 데이터 폴더 내 파일 또는 디렉토리를 옮기는 것도 가능합니다. 파일 또는 디렉토리의 위치를 변경하는 방법은 다음과 같습니다.
th: การย้ายไฟล์หรือไดเรกทอรีในโฟลเดอร์ข้อมูลก็เป็นไปได้จาก FileBrowser คุณสามารถย้ายไฟล์หรือไดเรกทอรีได้โดยทำตามขั้นตอนด้านล่าง

source: Select directories or files from FileBrowser.
ja: ファイルブラウザからディレクトリまたはファイルを選択します。
ko: 파일 브라우저에서 원하는 디렉토리나 파일을 선택하십시오.
th: เลือกไดเรกทอรีหรือไฟล์จาก FileBrowser.

source: Click the 'arrow' button in the upper right corner of FileBrowser
ja: FileBrowserの右上隅にある「矢印」ボタンをクリックします
th: คลิกที่ปุ่ม 'ลูกศร' ที่มุมขวาบนของ FileBrowser

source: Select the destination
ja: 宛先を選択
ko: 이동할 경로를 선택합니다.
th: เลือกปลายทาง

source: Click 'MOVE' button
ja: 「移動」ボタンをクリック
th: คลิกที่ปุ่ม 'ย้าย'

source: You will see that moving operation is successfully finished.
ja: 移動操作が正常に完了したことが確認できます。
ko: 옮기기 작업이 성공적으로 완료된 것을 확인할 수 있습니다.
th: คุณจะเห็นว่าการดำเนินการย้ายเสร็จสมบูรณ์แล้ว

source: FileBrowser is provided via application inside a compute session currently. We are planning to update FileBrowser so that it can run independently without creating a session.
ja: 現在、FileBrowser はコンピュートセッション内のアプリケーションを通じて提供されています。私たちは、FileBrowser がセッションを作成せずに単独で実行できるように更新する予定です。
ko: 현재 파일 브라우저는 연산 세션 내 애플리케이션 형태로 제공되고 있습니다. 향후 세션을 생성하지 않고 파일브라우저를 독립적으로 실행할 수 있는 기능을 추가할 예정입니다.
th: FileBrowser จะถูกจัดเตรียมผ่านแอปพลิเคชันภายในเซสชันการคอมพิวเตอร์ในขณะนี้ เรากำลังวางแผนที่จะอัปเดต FileBrowser เพื่อให้สามารถทำงานได้เองโดยไม่ต้องสร้างเซสชัน

source: Using SFTP Server
ja: SFTPサーバーの使用
ko: SFTP 서버 사용
th: การใช้ SFTP เซิร์ฟเวอร์

source: From 22.09, GPU Platform supports SSH / SFTP file upload from both desktop app and web-based Web-UI. The SFTP server allows you to upload files quickly through reliable data streams.
th: ตั้งแต่วันที่ 22.09 เป็นต้นไป GPU Platform รองรับการอัปโหลดไฟล์ผ่าน SSH / SFTP จากทั้งแอปพลิเคชันเดสก์ท็อปและเว็บ UI แบบเว็บ เซิร์ฟเวอร์ SFTP ช่วยให้คุณสามารถอัปโหลดไฟล์ได้อย่างรวดเร็วผ่านสตรีมข้อมูลที่เชื่อถือได้

source: Depending on the system settings, running SFTP server from the file dialog may not be allowed.
ja: システム設定によっては、ファイルダイアログからSFTPサーバーを実行することが許可されていない場合があります。
ko: 설정에 따라, SFTP 서버 실행하기가 허용되지 않을 수 있습니다.
th: ขึ้นอยู่กับการตั้งค่าของระบบ การเรียกใช้งานเซิร์ฟเวอร์ SFTP จากกล่องโต้ตอบไฟล์อาจไม่อนุญาต

source: Execute SFTP server from folder explorer dialog in Data & Storage page
ja: データとストレージページのフォルダエクスプローラーダイアログからSFTPサーバーを実行します
ko: Data & Storage 페이지의 폴더 탐색기에서 파일 브라우저 실행
th: เรียกใช้เซิร์ฟเวอร์ SFTP จากกล่องโต้ตอบสำรวจโฟลเดอร์ในหน้า Data & Storage

source: Click 'RUN SFTP SERVER' button in the upper-right corner of the explorer.
ja: エクスプローラの右上隅にある「RUN SFTP SERVER」ボタンをクリックします。
th: คลิกปุ่ม 'RUN SFTP SERVER' ที่มุมขวาบนของตัวสำรวจ

source: Folder explorer with SFTP Server
ja: SFTPサーバーによるフォルダエクスプローラー
th: ตัวสำรวจโฟลเดอร์ด้วยเซิร์ฟเวอร์ SFTP

source: You can see the SSH / SFTP connection dialog. And a new SFTP session will be created automatically. (This session will not affect resource occupancy.)
ja: SSH / SFTP 接続ダイアログが表示されます。そして、新しいSFTPセッションが自動的に作成されます。（このセッションはリソースの占有に影響を与えません。）
ko: SSH / SFTP 연결 다이얼로그가 뜨면서, 새로운 SFTP 세션이 자동으로 생성됩니다. (이 세션은 자원 점유 상태에 영향을 주지 않습니다.)
th: คุณสามารถดูการสนทนาเชื่อมต่อ SSH / SFTP และเซสชัน SFTP ใหม่จะถูกสร้างขึ้นโดยอัตโนมัติ (เซสชันนี้จะไม่ส่งผลต่อการใช้ทรัพยากร)

source: SSH / SFTP connection dialog
ja: SSH / SFTP 接続ダイアログ
th: กล่องสนทนาเชื่อมต่อ SSH / SFTP

source: We provide a detailed information about using large file upload via ssh/sftp connection. For more information, please click the 'Read more' text link to see all the details of execution.
ja: SSH/SFTP接続を介した大きなファイルのアップロードに関する詳細情報を提供しています。詳しくは、実行の詳細をすべて見るために「続きを読む」テキストリンクをクリックしてください。
th: เรามีข้อมูลรายละเอียดเกี่ยวกับการอัปโหลดไฟล์ขนาดใหญ่ผ่านการเชื่อมต่อ ssh/sftp สำหรับข้อมูลเพิ่มเติม กรุณาคลิกที่ลิงก์ข้อความ 'อ่านเพิ่มเติม' เพื่ดูรายละเอียดทั้งหมดของการดำเนินการ

source: SSH / SFTP connection dialog expanded
ja: SSH / SFTP 接続ダイアログが展開されました
th: ขยายกล่องสนทนาเชื่อมต่อ SSH / SFTP

source: For the connection, click 'DOWNLOAD SSH KEY' button to download the SSH private key (``id_container``). Also, remember the host and port number. Then, you can copy your files to the session using the Connection Example code written in the dialog, or referring to the following guide: :ref:`link<sftp_connection_for_linux_and_mac>`. To preserve the files, you need to transfer the files to the data folder. Also, the session will be terminated when there is no transfer for some time.
ja: 接続のために、'DOWNLOAD SSH KEY' ボタンをクリックして SSH プライベートキー（``id_container``）をダウンロードします。また、ホストとポート番号も記憶してください。それから、ダイアログに書かれている接続例コードを使用するか、以下のガイドを参照してセッションにファイルをコピーできます。:ref:`link<sftp_connection_for_linux_and_mac>` ファイルを保存するには、データフォルダーにファイルを転送する必要があります。また、しばらく転送がないと、セッションは終了します。
th: สำหรับการเชื่อมต่อ ให้คลิกที่ปุ่ม 'DOWNLOAD SSH KEY' เพื่อลงทุนกุญแจ SSH ส่วนตัว (``id_container``) นอกจากนี้ให้จดจำหมายเลขโฮสต์และพอร์ต แล้วคุณสามารถคัดลอกไฟล์ของคุณไปยังเซสชันโดยใช้โค้ดตัวอย่างการเชื่อมต่อที่เขียนในกล่องโต้ตอบ หรืออ้างอิงจากคำแนะนำต่อไปนี้: :ref:`link<sftp_connection_for_linux_and_mac>` สำหรับการเก็บรักษาไฟล์ คุณจะต้องโอนย้ายไฟล์ไปยังโฟลเดอร์ข้อมูล นอกจากนี้ เซสชันจะสิ้นสุดเมื่อไม่มีการถ่ายโอนเป็นเวลานาน

source: If you upload your SSH keypair, the ``id_container`` will be set with your own SSH private key. So, you don't need to download it every time you want to connect via SSH to your container. Please refer to :ref:`managing user's SSH keypair<user-ssh-keypair-management>`.
ja: SSHキーペアをアップロードすると、``id_container`` が自分のSSH秘密鍵で設定されます。そのため、コンテナにSSHで接続するたびにダウンロードする必要はありません。ユーザーのSSHキーペアの管理については、:ref:`managing user's SSH keypair<user-ssh-keypair-management>` を参照してください。
ko: 미리 사용자 SSH 키페어를 업로드 해두면 ``id_container`` 의 내용이 업로드한 SSH 사설키로 채워집니다. 따라서, 연산 세션에 SSH 접속을 할 때마다 파일을 다운로드 할 필요가 없습니다. :ref:`사용자의 SSH 키페어 관리하기<user-ssh-keypair-management>` 부분을 참고하십시오.
th: หากคุณอัปโหลดคู่กุญแจ SSH ของคุณ ``id_container`` จะถูกตั้งค่าด้วยกุญแจ SSH ส่วนตัวของคุณ ดังนั้นคุณไม่จำเป็นต้องดาวน์โหลดทุกครั้งที่ต้องการเชื่อมต่อผ่าน SSH กับคอนเทนเนอร์ของคุณ กรุณาอ้างอิงที่ :ref:`การจัดการคู่กุญแจ SSH ของผู้ใช้<user-ssh-keypair-management>`

source: Backend.AI supports dedicated storage to preserve user's files. Since the files and directories of a compute session are deleted upon session termination, it is recommended to save them in a storage folder. List of storage folders can be found by selecting the Data & Storage page on the sidebar. You can see the information such as the folder name and ID, the NFS host name where the folder is located (Location), and folder access rights (Permission).
ja: Backend.AIは、ユーザーのファイルを保存するための専用ストレージをサポートしています。計算セッションのファイルとディレクトリは、セッションの終了時に削除されるため、これらをストレージフォルダに保存することをお勧めします。ストレージフォルダの一覧は、サイドバーのデータとストレージのページを選択すると表示されます。フォルダ名とID、フォルダが配置されているNFSホスト名（場所）、およびフォルダのアクセス権（権限）などの情報を見ることができます。
ko: Backend.AI는 사용자의 파일을 보존할 수 있도록 별도의 저장소를 지원합니다. 연산 세션의 기본 폴더는 세션이 삭제되면 같이 삭제되므로, 보존해야 하는 파일이 있을 경우 Storage 폴더에 저장하는 것이 좋습니다. Storage 폴더는 좌측 메뉴의 Storage 탭을 선택하면 조회할 수 있습니다.

source: Cloneable: Shown only when you select usage model to "Model". Select whether the vfolder to be created is cloneable.
ja: クローン可能: 使用モデルを「モデル」に選択したときのみ表示されます。作成されるvfolderがクローン可能かどうかを選択します。

source: Backend.AI supports `FileBrowser <https://filebrowser.org>`_ from version 20.09. FileBrowser is a program that helps you manage files on a remote server through a web browser. This is especially useful when uploading a directory from the user's local machine.
ja: Backend.AIはバージョン20.09から `FileBrowser <https://filebrowser.org>`_ をサポートしています。FileBrowserは、ウェブブラウザを通じてリモートサーバー上のファイルを管理するのに役立つプログラムです。特にユーザーのローカルマシンからディレクトリをアップロードする際に便利です。
ko: Backend.AI 에서는 20.09 버전부터 `파일 브라우저 <https://filebrowser.org>`_ 를 지원합니다. 파일 브라우저는 웹 브라우저를 통해 원격 서버에 있는 파일 관리를 도와주는 프로그램입니다. 특히 사용자의 로컬 머신에 있는 디렉토리를 업로드 할 때에도 유용하게 사용할 수 있습니다.

source: Currently, Backend.AI provides a FileBrowser as an application of a compute session. Therefore, the following conditions are required to launch it.
ja: 現在、Backend.AIは計算セッションのアプリケーションとしてFileBrowserを提供しています。したがって、それを起動するためには以下の条件が必要です。
ko: 현재 Backend.AI에서는 파일 브라우저를 연산 세션 내에서 실행되는 어플리케이션 형태로 제공합니다. 따라서, 다음과 같은 최소 조건이 필요합니다.

source: When user clicks 'EXECUTE FILEBROWSER' button, Backend.AI automatically creates a dedicated compute session for the app. So, in the Sessions page, you should see FileBrowser compute session. It is user's responsibility to delete this compute session.
ja: ユーザーが 'EXECUTE FILEBROWSER' ボタンをクリックすると、Backend.AI はそのアプリ専用のコンピュートセッションを自動で作成します。したがって、セッションページで FileBrowser のコンピュートセッションが表示されるはずです。このコンピュートセッションを削除するかどうかはユーザーの責任です。

source: Here, we present some basic usage examples of FileBrowser in Backend.AI. Most of the FileBrowser operations are intuitive, but if you need more detailed guide, please refer to the `FileBrowser documentation <https://filebrowser.org>`_.
ja: ここでは、Backend.AIにおけるFileBrowserの基本的な使用例を紹介します。FileBrowserの操作のほとんどは直感的ですが、より詳細なガイドが必要な場合は、`FileBrowserのドキュメント <https://filebrowser.org>`_ を参照してください。
ko: 여기서는 Backend.AI 상에서 파일 브라우저의 간단한 사용 예를 보여 드립니다. 대부분의 파일 브라우저 작업은 매우 직관적이지만, 보다 자세한 가이드가 필요하실 경우 `파일 브라우저 문서 <https://filebrowser.org>`_ 를 참조하십시오.

source: There are two types of storage folders. User folders can be created by normal users, and you can see that there is one user icon in the Type panel. On the other hand, Project folders can be recognized by an icon with multiple users in the panel. Project folders are created by domain admins, and normal users can only see project folders created for the project in which the users belong.
ko: Storage 폴더에는 두 가지 형태가 있습니다. 사용자 형태(User)의 경우 일반 사용자가 자신의 폴더를 생성한 것으로, Type 컬럼에서 한 명의 사용자가 있는 것으로 확인할 수 있습니다. 프로젝트 폴더(Project)의 경우 Type 컬럼에 여러 명의 사용자가 있는 아이콘으로 알아볼 수 있으며, 도메인 관리자에 의해서만 프로젝트별로 생성되고 일반 사용자는 생성된 프로젝트 폴더를 사용만 할 수 있습니다.

source: Check marks on the Owner panel in the folder list indicate the user created folders.
ko: 폴더 목록의 소유자 패널에있는 확인 표시는 사용자가 만든 폴더를 나타냅니다.
