Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/vfolder/vfolder.po
Languages: ja, ko, th

source: Handling Data & Storage Folders
ja: データとストレージフォルダの取り扱い
ko: 데이터 & 폴더 활용하기
th: การจัดการข้อมูลและโฟลเดอร์เก็บข้อมูล

source: GPU Platform supports dedicated storage to preserve user's files. Since the files and directories of a compute session are deleted upon session termination, it is recommended to save them in a storage folder. List of storage folders can be found by selecting the Data & Storage page on the sidebar. You can see the information such as the folder name and ID, the NFS host name where the folder is located (Location), and folder access rights (Permission).
th: GPU Platform รองรับการจัดเก็บข้อมูลเฉพาะเพื่อรักษาไฟล์ของผู้ใช้ เนื่องจากไฟล์และไดเรกทอรีของเซสชันการคอมพิวเตอร์จะถูกลบเมื่อสิ้นสุดเซสชัน จึงแนะนำให้บันทึกไว้ในโฟลเดอร์จัดเก็บ สามารถดูรายการโฟลเดอร์จัดเก็บได้โดยการเลือกหน้าข้อมูลและการจัดเก็บในแถบด้านข้าง คุณสามารถดูข้อมูลเช่น ชื่อโฟลเดอร์และ ID, ชื่อโฮสต์ NFS ที่ตั้งของโฟลเดอร์ (สถานที่), และสิทธิ์การเข้าถึงโฟลเดอร์ (สิทธิ์)

source: Folder list in Storage page
ja: ストレージページのフォルダリスト
th: รายการโฟลเดอร์ในหน้าเก็บข้อมูล

source: There are two types of storage folders. User folders can be created by normal users, and you can see that there is one user button in the Type column. On the other hand, Project folders can be recognized by an button with multiple users in the column. Project folders are created by domain admins, and normal users can only see project folders created for the project in which the users belong.
ja: ストレージフォルダには2種類あります。ユーザーフォルダは通常のユーザーによって作成され、タイプ列にユーザーのボタンが1つあることで確認できます。一方、プロジェクトフォルダは列に複数のユーザーのボタンで認識できます。プロジェクトフォルダはドメイン管理者によって作成され、通常のユーザーは所属するプロジェクトのために作成されたプロジェクトフォルダのみを閲覧できます。
th: มีโฟลเดอร์เก็บข้อมูลสองประเภท โฟลเดอร์ผู้ใช้สามารถสร้างได้โดยผู้ใช้ทั่วไป และคุณสามารถเห็นว่ามีปุ่มผู้ใช้หนึ่งปุ่มในคอลัมน์ประเภท ในทางกลับกัน โฟลเดอร์โปรเจกต์สามารถรู้จักได้จากปุ่มที่มีผู้ใช้หลายคนในคอลัมน์ โฟลเดอร์โปรเจกต์ถูกสร้างโดยผู้ดูแลระบบโดเมน และผู้ใช้ทั่วไปสามารถเห็นเฉพาะโฟลเดอร์โปรเจกต์ที่สร้างขึ้นสำหรับโปรเจกต์ที่ผู้ใช้สังกัดเท่านั้น

source: Storage status in Storage page
ja: ストレージページのストレージステータス
th: สถานะการจัดเก็บในหน้า Storage

source: Storage Status on top of the folder list shows the following information:
ja: フォルダリストの上部にあるストレージステータスには、以下の情報が表示されます。
ko: 폴더 목록 상단의 저장소 상태는 다음 정보를 표시합니다.
th: สถานะพื้นที่จัดเก็บที่อยู่ด้านบนของรายการโฟลเดอร์จะแสดงข้อมูลดังต่อไปนี้:

source: Number of folders
ja: フォルダーの数
ko: 폴더 개수
th: จำนวนโฟลเดอร์

source: Created: The number of folders that the user created.
ja: 作成数: ユーザーが作成したフォルダーの数。
ko: Created: 사용자가 생성 한 폴더 수입니다.
th: สร้าง: จำนวนโฟลเดอร์ที่ผู้ใช้สร้างขึ้น。

source: Limit: The maximum number of folders that the user can create afterwards. This value depends on the resource policy applied to the user and cannot be changed without changing the resource policy. Folders that were not created by the user (eg. folders invited to share, or project folders) are not counted.
ja: 制限: ユーザーがその後作成できるフォルダーの最大数。この値はユーザーに適用されるリソースポリシーに依存しており、リソースポリシーを変更しない限り変更できません。ユーザーによって作成されていないフォルダー（例: 共有に招待されたフォルダーやプロジェクトフォルダー）はカウントされません。
ko: Limit: 사용자가 현재 만들 수 있는 최대 폴더 수입니다. 이 값은 사용자에게 적용된 자원 정책에 따라 다르며 자원 정책을 변경하지 않고 변경할 수 없습니다. 사용자가 생성하지 않은 폴더(예 : 공유하도록 초대된 폴더 또는 프로젝트 폴더)는 계산에 포함되지 않습니다.
th: ข้อจำกัด: จำนวนโฟลเดอร์สูงสุดที่ผู้ใช้สามารถสร้างได้ภายหลัง ค่าใช้จ่ายนี้ขึ้นอยู่กับนโยบายทรัพยากรที่นำไปใช้กับผู้ใช้และไม่สามารถเปลี่ยนแปลงได้หากไม่เปลี่ยนนโยบายทรัพยากร โฟลเดอร์ที่ไม่ได้สร้างโดยผู้ใช้ (เช่น โฟลเดอร์ที่ถูกเชิญให้แชร์ หรือโฟลเดอร์โปรเจกต์) จะไม่ถูกนับรวม

source: Project Folder: The number of project folders that the user created.
ja: プロジェクトフォルダー: ユーザーが作成したプロジェクトフォルダーの数。
ko: Project Folder: 사용자가 생성한 프로젝트 폴더 수입니다.
th: โฟลเดอร์โปรเจกต์: จำนวนโฟลเดอร์โปรเจกต์ที่ผู้ใช้สร้างขึ้น

source: Invited: The number of folders that the user was invited to share.
ja: 招待された: ユーザーが共有の招待を受けたフォルダーの数。
ko: Invited: 다른 사용자가 초대를 통해 공유한 폴더 수입니다.
th: เชิญ: จำนวนโฟลเดอร์ที่ผู้ใช้ได้รับเชิญให้แบ่งปัน

source: Quota per storage volume
ja: ストレージボリュームごとのクォータ
ko: 스토리지 볼륨별 가용량
th: โควตาต่อปริมาตรการจัดเก็บ

source: Host: The name of the storage host.
ja: ホスト: ストレージホストの名前。
ko: Host: 스토리지 호스트의 이름입니다.
th: โฮสต์: ชื่อของโฮสต์ที่เก็บข้อมูล。

source: Project: Current project folder usage / current project folder quota scope.
ja: プロジェクト: 現在のプロジェクトフォルダ使用量 / 現在のプロジェクトフォルダクオータ範囲。
ko: Project: 현재 프로젝트의 폴더 사용량 / 현재 프로젝트의 폴더 가용량입니다.
th: โครงการ: การใช้งานโฟลเดอร์โครงการปัจจุบัน / ขอบเขตการจัดสรรโฟลเดอร์โครงการปัจจุบัน

source: User: Current user folder usage / current user folder quota scope.
ja: ユーザー: 現在のユーザーフォルダー使用量 / 現在のユーザーフォルダーのクオータースコープ。
ko: User: 현재 사용자의 폴더 사용량 / 현재 사용자의 폴더 가용량입니다.
th: ผู้ใช้: การใช้งานโฟลเดอร์ของผู้ใช้ปัจจุบัน / ขอบเขตของโควต้าของโฟลเดอร์ผู้ใช้ปัจจุบัน

source: Please remind that quota is only available in storage that provides quota setting (e.g. XFS, CephFS, NetApp, Purestorage, etc.). For the quota setting, please refer to the :ref:`Quota Setting Panel<quota-setting-panel>` section.
ja: クォータはクォータ設定を提供するストレージ（例：XFS、CephFS、NetApp、Purestorageなど）でのみ利用可能であることに注意してください。クォータ設定については、:ref:`Quota Setting Panel<quota-setting-panel>` セクションを参照してください。
ko: 쿼타(가용량)는 쿼타 설정을 제공하는 스토리지에서만 사용할 수 있습니다(XFS, CephFS, NetApp, Purestorage 등). 가용량 설정에 대해서는 :ref:`쿼타 설정 패널<quota-setting-panel>` 섹션을 참고하십시오.
th: โปรดจำไว้ว่าคุณสมบัติการกำหนดโควต้า มีอยู่เฉพาะในพื้นที่เก็บข้อมูลที่รองรับการตั้งค่าโควต้า (เช่น XFS, CephFS, NetApp, Purestorage, เป็นต้น) สำหรับการตั้งค่าโควต้า โปรดดูในหัวข้อ :ref:`แผงการตั้งค่าโควต้า<quota-setting-panel>`

source: Check marks on the Owner column in the folder list indicate the user created folders.
ja: フォルダーリストのオーナー列のチェックマークは、ユーザーが作成したフォルダーを示しています。
th: เครื่องหมายถูกในคอลัมน์เจ้าของในรายการโฟลเดอร์แสดงถึงผู้ใช้ที่สร้างโฟลเดอร์

source: Owner panel in Storage page
ja: ストレージページのオーナーパネル
ko: Storage 페이지의 소유자 여부
th: แผงเจ้าของในหน้าสตอเรจ

source: If there are lots of folders in the list, you can filter the list by using the search boxes on top of the list.
ja: リストにフォルダーがたくさんある場合は、リストの上部にある検索ボックスを使用してリストをフィルタリングできます。
ko: 많은 수의 폴더를 사용하고 있는 경우, 리스트 상단의 검색 상자를 이용하여 폴더 목록을 필터링할 수 있습니다.
th: ถ้ามีโฟลเดอร์จำนวนมากในรายการ คุณสามารถกรองรายการโดยใช้กล่องค้นหาที่อยู่ด้านบนของรายการ

source: Create storage folder
ja: ストレージフォルダを作成
ko: Storage 폴더 생성
th: สร้างโฟลเดอร์จัดเก็บ

source: You can create a storage folder with the desired name by clicking the 'NEW FOLDER' button. Enter the name of the folder to be created in Folder name, and select one of User / Project for Type. (Depending on the server settings, only one of User or Project may be selectable.) When creating a project folder, the Project field must be set. The project folder will be bound to the project specified in the Project field, and only users belonging to the project can mount and use the project folder. After setting the values as desired, you can create a folder by clicking the 'CREATE' button.
th: คุณสามารถสร้างโฟลเดอร์สำหรับจัดเก็บด้วยชื่อที่ต้องการได้โดยการคลิกที่ปุ่ม 'NEW FOLDER' กรอกชื่อของโฟลเดอร์ที่จะสร้างในชื่อโฟลเดอร์ และเลือกหนึ่งในประเภท User / Project (ขึ้นอยู่กับการตั้งค่าเซิร์ฟเวอร์ อาจเลือกได้เพียงหนึ่งใน User หรือ Project เท่านั้น) เมื่อสร้างโฟลเดอร์โครงการฟิลด์ Project จะต้องถูกตั้งค่า โฟลเดอร์โครงการจะถูกผูกกับโครงการที่ระบุในฟิลด์ Project และผู้ใช้ที่เป็นสมาชิกของโครงการเท่านั้นจึงจะสามารถติดตั้งและใช้โฟลเดอร์โครงการได้ หลังจากตั้งค่าค่าต่างๆ ตามต้องการแล้ว คุณสามารถสร้างโฟลเดอร์ได้โดยคลิกที่ปุ่ม 'CREATE'

source: Folder creation dialog
ja: フォルダ作成ダイアログ
th: กล่องโต้ตอบการสร้างโฟลเดอร์

source: The meaning of each fields that can be selected in the creation dialog is as follows.
ja: 作成ダイアログで選択できる各フィールドの意味は以下の通りです。
ko: 생성 대화 상자에서 선택할 수 있는 각 필드의 의미는 다음과 같습니다.
th: ความหมายของแต่ละฟิลด์ที่สามารถเลือกได้ในกล่องสนทนาการสร้างมีดังนี้

source: Folder name: The name of the folder. You can enter up to 64 characters.
ja: フォルダ名: フォルダの名前を入力します。最大64文字まで入力できます。
ko: Folder name: 폴더의 이름입니다. 최대 64 자까지 입력 할 수 있습니다.
th: ชื่อโฟลเดอร์: ชื่อของโฟลเดอร์ คุณสามารถป้อนตัวอักษรได้สูงสุด 64 ตัว.

source: Host: NFS host to create folder. You can choose one if you have multiple NFS hosts. You can check whether the selected host has enough capacity remaining through the indicator.
ja: ホスト: フォルダを作成するためのNFSホスト。複数のNFSホストがある場合は1つ選択できます。インジケーターを通じて、選択したホストに十分な容量が残っているかどうか確認できます。
ko: Host: 폴더를 만들 NFS 호스트입니다. NFS 호스트가 여러 개인 경우 하나를 선택할 수 있습니다.선택한 호스트가 충분한 용량을 가지고 있는지 여부는 표시기를 통해 확인할 수 있습니다.
th: โฮสต์: โฮสต์ NFS ที่จะสร้างโฟลเดอร์ คุณสามารถเลือกหนึ่งรายการหากคุณมีโฮสต์ NFS หลายรายการ คุณสามารถตรวจสอบว่าโฮสต์ที่เลือกมีความจุเหลืออยู่เพียงพอหรือไม่ผ่านตัวบ่งชี้

source: Type: Determines the type of folder to be created. It can be set as User or Project. The User folder is a folder that users can create and use alone and the Project folder is a folder created by admin and shared by users in the project.
ja: 種類: 作成するフォルダーの種類を決定します。ユーザーまたはプロジェクトとして設定できます。ユーザーフォルダーは、ユーザーが自身で作成して使用できるフォルダーであり、プロジェクトフォルダーは管理者によって作成され、プロジェクト内のユーザーと共有されるフォルダーです。
ko: Type: 생성 할 폴더 유형을 결정합니다. 사용자(User) 또는 프로젝트(Project)로 설정할 수 있습니다. 사용자 폴더는 사용자가 단독으로 생성하여 사용할 수 있는 폴더이며 프로젝트 폴더는 관리자가 생성하고 프로젝트의 사용자가 공유하는 폴더입니다.
th: ประเภท: กำหนดประเภทของโฟลเดอร์ที่จะสร้าง สามารถตั้งค่าเป็นผู้ใช้หรือโครงการ โฟลเดอร์ผู้ใช้คือโฟลเดอร์ที่ผู้ใช้สามารถสร้างและใช้งานได้เพียงคนเดียว และโฟลเดอร์โครงการคือโฟลเดอร์ที่สร้างโดยผู้ดูแลระบบและแชร์โดยผู้ใช้ในโครงการ

source: Usage Mode: You can set the purpose of the folder. There are three types of mode: General, Data, and Model. It is classified for the development of exclusive functions for Data & Model Stores in the future and currently there is no difference in UI depending on the purpose.
ja: 使用モード: フォルダーの目的を設定できます。モードには、一般、データ、モデルの3種類があります。これは、将来的なデータ＆モデルストアの専用機能の開発のために分類されており、現在は目的に応じたUIの違いはありません。
ko: Usage Mode: 폴더의 용도를 설정할 수 있습니다. 모드에는 일반, 데이터 및 모델의 세 가지 유형이 있습니다. 향후 Data & Model Store 전용 기능 개발을 위한 분류이며 현재는 목적에 따른 UI 차이가 없습니다.
th: โหมดการใช้งาน: คุณสามารถตั้งวัตถุประสงค์ของโฟลเดอร์ได้ มีสามประเภทโหมด: ทั่วไป, ข้อมูล, และโมเดล ซึ่งได้รับการจัดประเภทเพื่อพัฒนาฟังก์ชันเฉพาะสำหรับ Data & Model Stores ในอนาคต และในปัจจุบันไม่มีความแตกต่างใน UI ขึ้นอยู่กับวัตถุประสงค์

source: Project: Designates the project to which the folder belongs when creating a new project folder. Project folders must belong to a project. However, it does not play any role when creating a user folder.
ko: Project: 새 프로젝트 폴더를 만들 때 폴더가 속한 그룹을 지정합니다. 프로젝트 폴더는 프로젝트에 속해야 합니다. 그러나 사용자 폴더를 생성할 때 어떤 역할도 하지 않습니다.
th: โปรเจกต์: กำหนดโปรเจกต์ที่โฟลเดอร์นั้นสังกัดเมื่อสร้างโฟลเดอร์โปรเจกต์ใหม่ โฟลเดอร์โปรเจกต์ต้องเป็นของโปรเจกต์หนึ่ง อย่างไรก็ตาม มันไม่มีบทบาทใด ๆ เมื่อสร้างโฟลเดอร์ผู้ใช้

source: Permission: Set permission of a project folder for project members. If this is set to "Read-Only", project members cannot write to this folder inside their compute session.
ja: パーミッション: プロジェクトフォルダのプロジェクトメンバーに対するパーミッションを設定します。これが「読み取り専用」に設定されている場合、プロジェクトメンバーは計算セッション内でこのフォルダに書き込みを行うことができません。
ko: Permission: 프로젝트 폴더의 권한을 설정합니다. “Read-Only”로 설정된 경우, 프로젝트 멤버가 이 폴더에 쓰기 작업을 수행할 수 없습니다.
th: สิทธิ์: กำหนดสิทธิ์ของโฟลเดอร์โปรเจกต์สำหรับสมาชิกโปรเจกต์ หากตั้งค่าเป็น "อ่านอย่างเดียว" สมาชิกโปรเจกต์จะไม่สามารถเขียนลงในโฟลเดอร์นี้ภายในเซสชันการคอมพิวเตอร์ของพวกเขาได้

source: Explore folder
ja: フォルダーを探索
ko: 폴더 내용 조회하기
th: สำรวจโฟลเดอร์

source: You can click the folder button in the Control column to bring up a file explorer where you can view the contents of that folder.
ja: コントロール列のフォルダボタンをクリックすると、ファイルエクスプローラーが表示され、そのフォルダの内容を確認できます。
th: คุณสามารถคลิกปุ่มโฟลเดอร์ในคอลัมน์การควบคุมเพื่อเปิดโปรแกรมสำรวจไฟล์ที่คุณสามารถดูเนื้อหาของโฟลเดอร์นั้นได้

source: Controls in folder item
ja: フォルダー項目のコントロール
th: การควบคุมในรายการโฟลเดอร์

source: You can see that directories and files inside the folder will be listed, if exists. Click a directory name in the Name column to move to the directory. You can click the download button or delete button in the Actions column to download it or delete it entirely from the directory. You can rename a file/directory as well. For more detailed file operations, you can mount this folder when creating a compute session, and then use a service like Terminal or Jupyter Notebook to do it.
ja: フォルダ内にディレクトリやファイルが存在する場合、それらが一覧表示されます。Name列でディレクトリ名をクリックすると、そのディレクトリに移動します。Actions列のダウンロードボタンまたは削除ボタンをクリックして、ダウンロードしたり、ディレクトリから完全に削除したりすることができます。また、ファイル/ディレクトリの名前を変更することも可能です。より詳細なファイル操作については、コンピュートセッションを作成する際にこのフォルダをマウントし、TerminalやJupyter Notebookなどのサービスを使用して行うことができます。
th: คุณสามารถเห็นได้ว่าไดเรกทอรีและไฟล์ภายในโฟลเดอร์จะถูกแสดงรายการ หากมีอยู่ คลิกที่ชื่อไดเรกทอรีในคอลัมน์ชื่อเพื่อย้ายไปยังไดเรกทอรีนั้น คุณสามารถคลิกที่ปุ่มดาวน์โหลดหรือปุ่มลบในคอลัมน์การกระทำเพื่อลงดาวน์โหลดหรือลบออกจากไดเรกทอรีโดยสิ้นเชิง คุณสามารถเปลี่ยนชื่อไฟล์/ไดเรกทอรีได้เช่นกัน สำหรับการดำเนินการไฟล์ที่ละเอียดมากขึ้น คุณสามารถทำการเมานต์โฟลเดอร์นี้เมื่อสร้างเซสชันการคอมพิวเตอร์ จากนั้นใช้บริการเช่น Terminal หรือ Jupyter Notebook ทำการดำเนินการดังกล่าว

source: File explorer of a storage folder
ja: ストレージフォルダのファイルエクスプローラー
ko: Storage 폴더의 파일 탐색기
th: ตัวสำรวจไฟล์ของโฟลเดอร์เก็บข้อมูล

source: You can create a new directory on the current path with the 'NEW FOLDER' button (in the file explorer), or upload a local file with the 'UPLOAD FILES' button. All of these file operations can also be performed using the above-described method of mounting folders into a compute session.
th: คุณสามารถสร้างไดเรกทอรีใหม่ในเส้นทางปัจจุบันโดยใช้ปุ่ม 'NEW FOLDER' (ในตัวสำรวจไฟล์) หรืออัปโหลดไฟล์จากเครื่องของคุณโดยใช้ปุ่ม 'UPLOAD FILES' การดำเนินการเกี่ยวกับไฟล์ทั้งหมดนี้ยังสามารถทำได้โดยใช้วิธีการที่กล่าวถึงข้างต้นในการเชื่อมต่อไดเรกทอรีเข้ากับเซสชันการคำนวณ

source: The maximum length of file or directory inside a folder may depends on the host file system. But, it usually cannot exceed 255 characters.
ja: フォルダ内のファイルまたはディレクトリの最大長は、ホストファイルシステムに依存することがあります。しかし、通常は255文字を超えることはできません。
ko: 폴더 내 파일 또는 디렉토리의 최대 길이는 호스트 파일 시스템에 따라 달라질 수 있습니다. 그러나 일반적으로 255자를 초과할 수 없습니다.
th: ความยาวสูงสุดของไฟล์หรือไดเร็กทอรีภายในโฟลเดอร์อาจขึ้นอยู่กับระบบไฟล์ของโฮสต์ แต่โดยปกติจะไม่สามารถเกิน 255 ตัวอักษร

source: To close file explorer, click the X button in the upper right.
ja: ファイルエクスプローラーを閉じるには、右上のXボタンをクリックします。
ko: 파일 탐색기를 닫기 위해서는 우측 상단의 X 버튼을 누르면 됩니다.
th: ในการปิดตัวสำรวจไฟล์ ให้คลิกที่ปุ่ม X ที่มุมขวาบน

source: Rename folder
ja: フォルダー名を変更
ko: 폴더 이름 변경
th: เปลี่ยนชื่อโฟลเดอร์

source: If you have permission to rename the storage folder, you can rename it by clicking the edit button in the Control column. When you click the button, a rename dialog will appear. Write new folder name and then click 'UPDATE' button.
ja: ストレージフォルダの名前を変更する権限がある場合、コントロール列の編集ボタンをクリックして名前を変更できます。ボタンをクリックすると、名前変更ダイアログが表示されます。新しいフォルダ名を入力し、「UPDATE」ボタンをクリックしてください。
th: ถ้าคุณมีสิทธิ์ในการเปลี่ยนชื่อโฟลเดอร์ที่เก็บข้อมูล คุณสามารถเปลี่ยนชื่อได้โดยการคลิกปุ่มแก้ไขในคอลัมน์การควบคุม เมื่อคุณคลิกที่ปุ่ม จะมีหน้าต่างเปลี่ยนชื่อปรากฏขึ้น ให้เขียนชื่อโฟลเดอร์ใหม่แล้วคลิกปุ่ม 'อัปเดต'

source: Folder rename dialog
ja: フォルダー名変更ダイアログ
th: กล่องโต้ตอบการเปลี่ยนชื่อโฟลเดอร์

source: Delete folder
ja: フォルダーを削除
ko: 폴더 삭제하기
th: ลบโฟลเดอร์

source: If you have permission to delete the storage folder, you can send the folder to the 'trash can' tab by clicking the 'trash can' button. Clicking the 'trash can' button in the Control column will open the following modal.
ja: ストレージフォルダーを削除する権限がある場合は、「ゴミ箱」ボタンをクリックしてフォルダーを「ゴミ箱」タブに送ることができます。コントロール列の「ゴミ箱」ボタンをクリックすると、次のモーダルが開きます。
th: หากคุณมีสิทธิ์ในการลบโฟลเดอร์เก็บข้อมูล คุณสามารถส่งโฟลเดอร์ไปยังแท็บ 'ถังขยะ' ได้โดยการคลิกที่ปุ่ม 'ถังขยะ' การคลิกที่ปุ่ม 'ถังขยะ' ในคอลัมน์การควบคุมจะเปิดโมดอลต่อไปนี้

source: Folder delete notification modal
ja: フォルダ削除通知モーダル
th: โมดัลการแจ้งเตือนลบโฟลเดอร์

source: Pressing the 'MOVE TO TRASH' button will change the folder's status to ``delete-pending``.
ja: 「ゴミ箱に移動」ボタンを押すと、フォルダーのステータスが``delete-pending``に変更されます。
th: การกดปุ่ม 'ย้ายไปที่ถังขยะ' จะเปลี่ยนสถานะของโฟลเดอร์เป็น ``delete-pending``.

source: Trash bin table
ja: ごみ箱テーブル
th: ตารางถังขยะ

source: In this status, you can restore the folder by clicking restore button in Control column. If you want to permanently delete the folder, please click 'red trash can' button in the same column. A confirmation modal will pop up with an input field saying ``Type folder name to delete``. Make sure you type the exact folder name correctly into the field, and click the red 'DELETE FOREVER' button to permanently delete the folder.
ja: この状態では、コントロール列の復元ボタンをクリックしてフォルダを復元することができます。フォルダを完全に削除したい場合は、同じ列の「赤いゴミ箱」ボタンをクリックしてください。確認モーダルが表示され、「削除するフォルダ名を入力」という入力フィールドが表示されます。フィールドに正確なフォルダ名を正しく入力し、赤い「永久に削除」ボタンをクリックしてフォルダを完全に削除してください。
th: ในสถานะนี้ คุณสามารถกู้คืนโฟลเดอร์ได้โดยการคลิกปุ่มกู้คืนในคอลัมน์การควบคุม หากคุณต้องการลบโฟลเดอร์อย่างถาวร โปรดคลิกปุ่ม 'ถังขยะสีแดง' ในคอลัมน์เดียวกัน แสดงกล่องตรวจสอบยืนยันที่จะปรากฏขึ้นพร้อมกับฟิลด์ข้อมูลที่เขียนว่า พิมพ์ชื่อโฟลเดอร์เพื่อลบ โปรดตรวจสอบให้แน่ใจว่าคุณพิมพ์ชื่อโฟลเดอร์ที่ถูกต้องตรงตามที่กำหนดในฟิลด์ และคลิกปุ่มสีแดง 'ลบตลอดไป' เพื่อลบโฟลเดอร์อย่างถาวร

source: Folder deletion dialog
ja: フォルダー削除ダイアログ
th: กล่องโต้ตอบการลบโฟลเดอร์

source: The folders created here can be mounted when creating a compute session. Folders are mounted under the user's default working directory, ``/home/work/``, and the file stored in the mounted directory will not be deleted when the compute session is terminated. (If you delete the folder, the file will also be deleted.)
ja: ここで作成されたフォルダは、コンピュートセッションを作成する際にマウントすることができます。フォルダはユーザーのデフォルト作業ディレクトリ ``/home/work/`` にマウントされ、マウントされたディレクトリに保存されたファイルはコンピュートセッションが終了しても削除されません。（フォルダを削除した場合、ファイルも削除されます。）
th: โฟลเดอร์ที่สร้างขึ้นที่นี่สามารถถูกเมานต์เมื่อสร้างเซสชันการคอมพิวเตอร์ โฟลเดอร์จะถูกเมานต์ภายใต้ไดเรกทอรีการทำงานเริ่มต้นของผู้ใช้ ``/home/work/`` และไฟล์ที่ถูกเก็บไว้ในไดเรกทอรีที่เมานต์จะไม่ถูกลบเมื่อเซสชันการคอมพิวเตอร์สิ้นสุดลง (หากคุณลบโฟลเดอร์ ไฟล์ก็จะถูกลบเช่นกัน)

source: Pipeline folders
ja: パイプラインフォルダー
ko: 파이프라인 폴더
th: โฟลเดอร์พายป์ไลน์

source: This tab shows the list of folders that are automatically created when executing a pipeline in FastTrack. When a pipeline is created, a new folder is created and mounted under ``/pipeline`` for each instance of work (computing session).
ja: このタブには、FastTrackでパイプラインを実行した際に自動的に作成されるフォルダの一覧が表示されます。パイプラインが作成されると、作業の各インスタンス（コンピューティングセッション）ごとに新しいフォルダが作成され、「/pipeline」にマウントされます。
ko: 이 탭은 FastTrack에서 파이프라인을 실행할 때 자동으로 생성되는 폴더 목록을 보여줍니다. 파이프라인을 만들면 각 태스크 인스턴스(연산 세션)에 대응되는 컨테이너의 ``/pipeline`` 위치에 새 폴더가 생성되고 마운트됩니다.
th: แท็บนี้จะแสดงรายการของโฟลเดอร์ที่ถูกสร้างขึ้นโดยอัตโนมัติเมื่อทำการประมวลผล Pipeline ใน FastTrack เมื่อมีการสร้าง Pipeline โฟลเดอร์ใหม่จะถูกสร้างและถูกติดตั้งภายใต้ ``/pipeline`` สำหรับแต่ละตัวอย่างของงาน (การใช้งานคอมพิวเตอร์)

source: Automount folders
ja: 自動マウントフォルダー
ko: 자동 마운트 폴더
th: การติดตั้งโฟลเดอร์อัตโนมัติ

source: Data & Storage page has an Automount Folders tab. Click this tab to see a list of folders whose names prefixed with a dot (``.``). When you create a folder, if you specify a name that starts with a dot (``.``), it is added to the Automount Folders tab, not the Folders tab. Automount Folders are special folders that are automatically mounted in your home directory even if you do not mount them manually when creating a compute session. By using this feature, creating and using Storage folders such as ``.local``, ``.linuxbrew``, ``.pyenv``, etc., you can configure a certain user packages or environments that do not change with different kinds of compute session.
ja: データ & ストレージページには、自動マウントフォルダーのタブがあります。このタブをクリックすると、名前がドット（``.``）で始まるフォルダーの一覧が表示されます。フォルダーを作成する際、名前をドット（``.``）で始めると、そのフォルダーはフォルダータブではなく自動マウントフォルダータブに追加されます。自動マウントフォルダーは、計算セッションを作成するときに手動でマウントしなくても、ホームディレクトリに自動的にマウントされる特別なフォルダーです。この機能を使用することで、``.local``、``.linuxbrew``、``.pyenv`` などのストレージフォルダーを作成・使用し、異なる種類の計算セッションでも変更されない特定のユーザーパッケージや環境を設定できます。
th: หน้า Data & Storage มีแท็บ Automount Folders คลิกที่แท็บนี้เพื่อดูรายการของโฟลเดอร์ที่มีชื่อขึ้นต้นด้วยจุด (``.``) เมื่อคุณสร้างโฟลเดอร์ หากคุณระบุชื่อที่เริ่มต้นด้วยจุด (``.``) โฟลเดอร์นั้นจะถูกเพิ่มในแท็บ Automount Folders ไม่ใช่แท็บ Folders โฟลเดอร์ Automount เป็นโฟลเดอร์พิเศษที่ถูกติดตั้งอัตโนมัติในไดเรกทอรีชื่อบ้านของคุณ ถึงแม้ว่าคุณจะไม่ติดตั้งมันด้วยตนเองเมื่อสร้างเซสชันการคอมพิวเตอร์ โดยการใช้ฟีเจอร์นี้ การสร้างและใช้โฟลเดอร์ Storage เช่น ``.local``, ``.linuxbrew``, ``.pyenv`` เป็นต้น จะช่วยให้คุณสามารถกำหนดแพ็คเกจหรือสภาพแวดล้อมของผู้ใช้บางอย่างที่ไม่เปลี่ยนแปลงกับเซสชันการคอมพิวเตอร์ประเภทต่างๆ ได้

source: For more detailed information on the usage of Automount folders, refer to :ref:`examples of using automount folders<using-automount-folder>`.
ja: Automountフォルダの使用に関する詳細情報については、:ref:`automountフォルダの使用例<using-automount-folder>` を参照してください。
ko: Automount Folders 사용에 관한 보다 자세한 내용은 :ref:`자동 마운트 폴더 사용 예제<using-automount-folder>` 섹션을 참고하십시오.
th: สำหรับข้อมูลที่ละเอียดกว่านี้เกี่ยวกับการใช้งานโฟลเดอร์ Automount โปรดดูที่ :ref:`ตัวอย่างการใช้โฟลเดอร์ automount<using-automount-folder>`.

source: Models
ja: モデル一覧
th: โมเดลส์

source: 'Models' The Models tab facilitates straightforward model serving. You can store the necessary data, including input data for model serving and training data, in the model folder. To initiate the service, click on the 'Model serving' button located in the control column.
ja: 'モデル' モデルタブでは、簡単なモデル提供を可能にします。モデルフォルダにモデル提供用の入力データや学習データなどの必要なデータを保存できます。サービスを開始するには、コントロール列にある「モデル提供」ボタンをクリックしてください。
th: 'โมเดล' แท็บโมเดลช่วยให้การให้บริการโมเดลง่ายดาย คุณสามารถเก็บข้อมูลที่จำเป็นรวมถึงข้อมูลนำเข้าสำหรับการให้บริการโมเดลและข้อมูลการฝึกอบรมในโฟลเดอร์โมเดล เพื่อเริ่มบริการ ให้คลิกที่ปุ่ม 'การให้บริการโมเดล' ที่ตั้งอยู่ในคอลัมน์ควบคุม

source: Following method is to serve model by pressing the 'Model serving' button in the 'model_folder' directory.
ja: 次の方法は、'model_folder' ディレクトリ内の 'Model serving' ボタンを押してモデルを提供するものです。
th: วิธีการต่อไปนี้คือการให้บริการโมเดลโดยการกดปุ่ม 'Model serving' ในไดเรกทอรี 'model_folder'。

source: Hover model serving
ja: ホバーモデルサービング
th: การให้บริการโมเดล Hover

source: As shown in 'Model Storage To Mount', the 'model_folder' folder is automatically mounted to enable starting a new service.
ja: 「Model Storage To Mount」に示されているように、「model_folder」フォルダは、新しいサービスを開始できるように自動的にマウントされます。
th: ตามที่แสดงใน 'การจัดเก็บโมเดลเพื่อการติดตั้ง' โฟลเดอร์ 'model_folder' จะถูกติดตั้งโดยอัตโนมัติเพื่อเปิดใช้งานการเริ่มต้นบริการใหม่

source: Start new service with mounted folder
ja: マウントされたフォルダーで新しいサービスを開始
th: เริ่มบริการใหม่ด้วยโฟลเดอร์ที่ถูกติดตั้ง

source: If you want to learn more about model serving, please refer to :ref:`this link<model-serving>`.
ja: モデルサービングについて詳しく知りたい場合は、:ref:`this link<model-serving>` を参照してください。
th: หากคุณต้องการเรียนรู้เพิ่มเติมเกี่ยวกับการให้บริการโมเดล โปรดดูที่ :ref:`ลิงก์นี้<model-serving>`

source: Model store
ja: モデルストア
th: ร้านค้าโมเดล

source: From the 24.03, You can easily clone models from shared via project. The model store refers to a storage space and service that stores, manages, searches, and utilizes various machine learning and deep learning models.
ja: 24.03以降、プロジェクトを介して共有されたモデルを簡単にクローンできます。モデルストアは、さまざまな機械学習および深層学習モデルを保存、管理、検索、利用するストレージスペースおよびサービスを指します。
th: ตั้งแต่วันที่ 24.03 คุณสามารถทำการโคลนโมเดลจากที่แชร์ผ่านโครงการได้อย่างง่ายดาย โมเดลสโตร์หมายถึงพื้นที่เก็บข้อมูลและบริการที่จัดเก็บ จัดการ ค้นหา และใช้โมเดลการเรียนรู้ของเครื่องและโมเดลการเรียนรู้เชิงลึกต่างๆ

source: As you can see in the model store section, there are several model cards that you can access, which are maintained by project admin. Each model card may contain tags that represent the characteristics of the model itself. Following method is to clone one from the model cards to try pre-trained models.
ja: モデルストアセクションでご覧のとおり、プロジェクト管理者によって維持されている複数のモデルカードにアクセスできます。各モデルカードには、モデル自体の特性を表すタグが含まれている場合があります。以下の方法で、モデルカードの1つをクローンして、事前訓練済みモデルを試すことができます。
th: ดังที่คุณเห็นในส่วนของร้านค้าโมเดล จะมีบัตรโมเดลหลายใบที่คุณสามารถเข้าถึงได้ ซึ่งดูแลโดยผู้ดูแลโครงการ บัตรโมเดลแต่ละใบอาจมีแท็กที่แสดงถึงลักษณะของโมเดลนั้น ๆ วิธีการต่อไปคือการโคลนหนึ่งใบจากบัตรโมเดลเพื่อทดลองโมเดลที่ผ่านการฝึกอบรมมาแล้ว
