Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/appendix/appendix.po
Languages: ja, ko_kr, th

source: Appendix
ja: 付録
th: ภาคผนวก

source: GPU virtualization and fractional GPU allocation
ja: GPU仮想化および分数GPU割り当て
ko_kr: GPU 가상화를 통한 컨테이너 별 GPU 분할 할당
th: การใช้ GPU เสมือนและการจัดสรร GPU แบบเศษส่วน

source: Backend.AI supports GPU virtualization technology which allows single physical GPU can be divided and shared by multiple users simultaneously. Therefore, if you want to execute a task that does not require much GPU computation capability, you can create a compute session by allocating a portion of the GPU. The amount of GPU resources that 1 fGPU actually allocates may vary from system to system depending on administrator settings. For example, if the administrator has set one physical GPU to be divided into five pieces, 5 fGPU means 1 physical GPU, or 1 fGPU means 0.2 physical GPU. If you set 1 fGPU when creating a compute session, the session can utilize the streaming multiprocessor (SM) and GPU memory equivalent to 0.2 physical GPU.
ja: Backend.AIはGPU仮想化技術をサポートしており、単一の物理GPUを複数のユーザーで同時に分割して共有することができます。したがって、多くのGPU計算能力を必要としないタスクを実行したい場合、GPUの一部を割り当ててコンピュートセッションを作成できます。1 fGPUが実際にどれだけのGPUリソースを割り当てるかは、管理者の設定によってシステムごとに異なる場合があります。たとえば、管理者が1つの物理GPUを5つに分割するように設定している場合、5 fGPUは1つの物理GPUを、または1 fGPUは0.2物理GPUを意味します。コンピュートセッションを作成する際に1 fGPUを設定すると、そのセッションは0.2の物理GPUに相当するストリーミングマルチプロセッサ（SM）とGPUメモリを利用できます。
ko_kr: Backend.AI 는 하나의 물리 GPU 를 여러 개로 분할해서 여러 사용자가 나누어 사용할 수 있는 가상화 기술을 지원하고 있습니다. 따라서, GPU 연산 소요가 크지 않은 작업을 수행하고자 할 경우에는 GPU 의 일부만 할당하여 연산 세션을 생성할 수 있습니다. 1 fGPU 가 실제로 할당하는 GPU 자원의 양은 관리자 설정에 따라 시스템 별로 다양할 수 있습니다. 예를 들어, 관리자가 하나의 GPU 를 다섯 조각으로 분할 설정한 경우, 5 fGPU 가 1 물리 GPU, 또는 1 fGPU 가 0.2 물리 GPU 를 뜻합니다. 이 때 1 fGPU 를 설정하여 연산 세션을 생성하면, 그 세션에서는 0.2 물리 GPU 에 해당하는 SM(streaming multiprocessor) 과 GPU 메모리를 활용할 수 있습니다.
th: Backend.AI รองรับเทคโนโลยีการทำเวอร์ชัน GPU ซึ่งอนุญาตให้ GPU ทางกายภาพเพียงตัวเดียวสามารถถูกแบ่งและแชร์โดยผู้ใช้หลายคนในเวลาเดียวกัน ดังนั้น หากคุณต้องการเรียกใช้งานที่ไม่ต้องใช้ความสามารถในการคำนวณ GPU มากนัก คุณสามารถสร้างเซสชันการคำนวณโดยการจัดสรรส่วนหนึ่งของ GPU จำนวนทรัพยากร GPU ที่ 1 fGPU จริง ๆ จัดสรรอาจแตกต่างกันไปตามระบบ ขึ้นอยู่กับการตั้งค่าของผู้ดูแลระบบ ตัวอย่างเช่น หากผู้ดูแลระบบตั้งค่าให้ GPU ทางกายภาพหนึ่งตัวถูกแบ่งเป็นห้าชิ้น 5 fGPU จะหมายถึง 1 GPU ทางกายภาพ หรือ 1 fGPU จะหมายถึง 0.2 GPU ทางกายภาพ หากคุณตั้งค่า 1 fGPU เมื่อสร้างเซสชันการคำนวณ เซสชันนั้นสามารถใช้หน่วยประมวลผลแบบสตรีมมิ่ง (SM) และหน่วยความจำ GPU ที่เทียบเท่ากับ 0.2 GPU ทางกายภาพ

source: In this section, we will create a compute session by allocating a portion of the GPU and then check whether the GPU recognized inside the compute container really corresponds to the partial physics GPU.
ja: このセクションでは、GPUの一部を割り当てて計算セッションを作成し、その計算コンテナ内で認識されたGPUが本当に部分的な物理GPUに対応しているかどうかを確認します。
ko_kr: 이번에는 GPU 를 일부만 할당하여 연산 세션을 생성한 후 연산 컨테이너 내부에서 인식하는 GPU 가 정말 물리 GPU 의 일부분인지 확인 해보도록 하겠습니다.
th: ในส่วนนี้ เราจะสร้างเซสชันการคำนวณโดยการจัดสรรส่วนหนึ่งของ GPU แล้วตรวจสอบว่า GPU ที่ถูกตรวจพบภายในคอนเทนเนอร์การคำนวณนั้นตรงกับ GPU ฟิสิกส์บางส่วนจริงหรือไม่

source: First, let's check the type of physical GPU installed in the host node and the amount of memory. The GPU node used in this guide is equipped with a GPU with 8 GB of memory as in the following figure. And through the administrator settings, 1 fGPU is set to an amount equivalent to 0.5 physical GPU (or 1 physical GPU is 2 fGPU).
ja: まず、ホストノードにインストールされている物理GPUのタイプとメモリの量を確認しましょう。このガイドで使用しているGPUノードは、以下の図のように8 GBのメモリを持つGPUを搭載しています。そして、管理者設定を通じて、1 fGPUは0.5物理GPUに相当する量に設定されています（または1物理GPUは2 fGPUです）。
ko_kr: 먼저 호스트 노드에 장착되어 있는 물리 GPU 의 종류와 메모리 용량 등의 정보를 확인 해보겠습니다. 이 가이드를 작성하면서 사용한 GPU 노드에는 다음과 같이 8 GB 메모리의 GPU 가 장착되어 있습니다. 그리고 관리자 설정을 통해 1 fGPU 를 0.5 개의 물리 GPU(또는 1 개의 물리 GPU 가 2 fGPU) 에 해당하는 양으로 설정하였습니다.
th: ก่อนอื่นให้ตรวจสอบประเภทของ GPU ทางกายภาพที่ติดตั้งในโหนดโฮสต์และปริมาณหน่วยความจำ โหนด GPU ที่ใช้ในคู่มือนี้ติดตั้งด้วย GPU ขนาด 8 GB ตามภาพด้านล่าง และผ่านการตั้งค่าของผู้ดูแลระบบ 1 fGPU ถูกตั้งค่าให้มีปริมาณเทียบเท่ากับ 0.5 GPU ทางกายภาพ (หรือ 1 GPU ทางกายภาพเท่ากับ 2 fGPU)

source: Now let's go to the Sessions page and create a compute session by allocating 0.5 fGPU as follows:
ja: 次に、セッションページに移動して、次のように0.5 fGPUを割り当てて計算セッションを作成します。
ko_kr: 이제 Sessions 페이지로 이동하여 다음과 같이 0.5 개의 fGPU 를 할당하여 연산 세션을 생성 해봅시다:
th: ตอนนี้ให้เราไปที่หน้า Sessions และสร้างเซสชันการคอมพิวเตอร์โดยการจัดสรร 0.5 fGPU ตามที่ระบุไว้ดังนี้:

source: In the Configuration panel of the session list, you can see that 0.5 fGPU is allocated.
ja: セッションリストの設定パネルで、0.5 fGPUが割り当てられていることが確認できます。
ko_kr: 연산 세션 리스트의 Configuration 열에서 0.5 의 fGPU 가 할당된 것을 확인할 수 있습니다.
th: ในแผงการตั้งค่าของรายการเซสชัน คุณสามารถเห็นว่าได้มีการจัดสรร 0.5 fGPU

source: Now, let's connect directly to the container and check if the allocated GPU memory is really equivalent to 0.5 units (~2 GB). Let's bring up a web terminal. When the terminal comes up, run the ``nvidia-smi`` command. As you can see in the following figure, you can see that about 2 GB of GPU memory is allocated. This shows that the physical GPU is actually divided into quarters and allocated inside the container for this compute session, which is not possible by a way like PCI passthrough.
ja: それでは、コンテナに直接接続して、割り当てられたGPUメモリが実際に0.5ユニット（約2 GB）であるかどうかを確認しましょう。ウェブターミナルを立ち上げます。ターミナルが立ち上がったら、``nvidia-smi`` コマンドを実行します。以下の図のように、約2 GBのGPUメモリが割り当てられていることがわかります。これは、物理GPUが実際に4分割され、この計算セッションのためにコンテナ内に割り当てられていることを示しており、PCIパススルーのような方法では実現できません。
ko_kr: 이제 컨테이너에 직접 연결하여 할당 된 GPU 메모리가 실제로 0.5 단위 (~ 2GB)와 동일한지 확인하겠습니다. 웹 터미널을 띄웁니다. 터미널이 나타나면``nvidia-smi`` 명령을 실행합니다. 다음 그림에서 볼 수 있듯이 약 2GB의 GPU 메모리가 할당 되었음을 알 수 있습니다. 이는 물리적 GPU가 실제로 네 부분으로 나뉘어 이 연산 세션에 할당되었음을 보여줍니다. 이는 PCI 패스스루(passthrough0와 같은 방식으로는 불가능합니다.
th: ตอนนี้ มาทำการเชื่อมต่อกับคอนเทนเนอร์โดยตรงและตรวจสอบว่าหน่วยความจำ GPU ที่จัดสรรไปนั้นเท่ากับ 0.5 หน่วย (~2 GB) จริงหรือไม่ มาทำการเปิดเทอร์มินัลเว็บ เมื่อเทอร์มินัลเปิดขึ้น ให้รันคำสั่ง ``nvidia-smi`` ดังที่คุณเห็นในรูปด้านล่าง คุณจะเห็นว่ามีการจัดสรรหน่วยความจำ GPU ประมาณ 2 GB ซึ่งแสดงให้เห็นว่า GPU ทางกายภาพนั้นถูกแบ่งออกเป็นสี่ส่วนและจัดสรรภายในคอนเทนเนอร์สำหรับเซสชันการคำนวณนี้ ซึ่งเป็นสิ่งที่ไม่สามารถทำได้ด้วยวิธีอย่าง PCI passthrough

source: Let's open up a Jupyter Notebook and run a simple ML training code.
ja: Jupyter Notebookを開いて、シンプルなMLトレーニングコードを実行しましょう。
ko_kr: 이번에는 Jupyter Notebook 을 띄워서 간단한 ML 학습 코드를 실행해보겠습니다.
th: มาเปิด Jupyter Notebook และรันโค้ดการฝึก ML ง่ายๆ กันเถอะ

source: While training is in progress, connect to the shell of the GPU host node and execute the ``nvidia-smi`` command. You can see that there is one GPU attached to the process and this process is occupying about 25% of the resources of the physical GPU. (GPU occupancy can vary greatly depending on training code and GPU model.)
ja: 学習が進行中の間に、GPUホストノードのシェルに接続し、``nvidia-smi`` コマンドを実行します。プロセスに1つのGPUが接続されており、このプロセスが物理GPUのリソースの約25％を占有していることがわかります。（GPUの占有率は、トレーニングコードやGPUモデルによって大きく異なる場合があります。）
ko_kr: 학습이 진행되는 동안 GPU 호스트 노드의 쉘로 접속해서 ``nvidia-smi`` 명령을 실행합니다. 다음과 같이 하나의 GPU 사용 프로세스가 있고 이 프로세스는 물리 GPU의 약 25% 에 해당 하는 자원을 점유중임을 알 수 있습니다. (GPU 점유량은 학습 코드와 GPU 모델에 따라 크게 다를 수 있습니다.)
th: ในขณะที่การฝึกกำลังดำเนินอยู่ ให้เชื่อมต่อกับเชลล์ของโฮสต์โหนด GPU และดำเนินการคำสั่ง ``nvidia-smi`` คุณสามารถเห็นว่า มี GPU หนึ่งตัวที่เชื่อมต่อกับกระบวนการนี้และกระบวนการนี้กำลังใช้งานประมาณ 25% ของทรัพยากรของ GPU เชิงกายภาพ (การใช้ GPU อาจแตกต่างกันไปมากขึ้นอยู่กับรหัสการฝึกและโมเดล GPU)

source: Alternatively, you can run the ``nvidia-smi`` command from the web terminal to query the GPU usage history inside the container.
ja: あるいは、ウェブターミナルから ``nvidia-smi`` コマンドを実行して、コンテナ内のGPU使用履歴を確認することができます。
ko_kr: 또는, 아까 띄워둔 웹 터미널에서 ``nvidia-smi`` 명령을 내려 컨테이너 내부에서 인식하는 GPU 사용 내역을 조회해보는 것도 가능합니다.
th: อีกทางหนึ่ง คุณสามารถรันคำสั่ง ``nvidia-smi`` จากเว็บเทอร์มินัลเพื่อสอบถามประวัติกระบวนการใช้งาน GPU ภายในคอนเทนเนอร์ได้

source: Automated job scheduling
ja: 自動ジョブスケジューリング
ko_kr: GUI 를 통한 자원 모니터링 및 스케줄링 자동화
th: การกำหนดตารางงานอัตโนมัติ

source: Backend.AI server has a built-in self-developed task scheduler. It automatically checks the available resources of all worker nodes and delegates the request to create a compute session to the worker that meets the user's resource request. In addition, when resources are insufficient, the user's request to create a compute session is registered as a PENDING state in the job queue. Later, when the resources become available again, the pended request is resumed to create a compute session.
ja: Backend.AIサーバーには、独自開発されたタスクスケジューラーが組み込まれています。これにより、すべてのワーカーノードの利用可能なリソースを自動的にチェックし、ユーザーのリソース要求を満たすワーカーに対してコンピュートセッションの作成を委任します。さらに、リソースが不足している場合、ユーザーのコンピュートセッションの作成要求は、ジョブキューのPENDING状態として登録されます。その後、リソースが再び利用可能になると、保留された要求が再開されてコンピュートセッションの作成が行われます。
ko_kr: Backend.AI 서버는 자체 개발한 작업 스케줄러를 내장하고 있습니다. 자동으로 모든 워커 (worker) 노드의 자원 상태를 확인하여 사용자의 자원 요청에 맞는 워커로 연산 세션 생성 요청을 위임 합니다. 또한, 자원이 부족할 경우에는 일단 작업 큐에 사용자의 연산 세션 생성 요청을 대기 (pending) 시키고 나중에 자원이 다시 가용 상태가 되면 대기 요청을 활성화 해서 연산 세션 생성 작업을 수행하게 됩니다.
th: เซิร์ฟเวอร์ Backend.AI มีตัวจัดตารางงานที่พัฒนาขึ้นเองในตัว มันจะตรวจสอบทรัพยากรที่มีอยู่ของโหนดผู้ทำงานทั้งหมดโดยอัตโนมัติและมอบหมายคำขอในการสร้างเซสชันการคอมพิวเตอร์ไปยังผู้ทำงานที่ตรงตามคำขอทรัพยากรของผู้ใช้ นอกจากนี้ เมื่อทรัพยากรไม่เพียงพอ คำขอของผู้ใช้ในการสร้างเซสชันการคอมพิวเตอร์จะถูกลงทะเบียนในสถานะ PENDING ในคิวงาน ภายหลัง เมื่อทรัพยากรมีให้ใช้งานอีกครั้ง คำขอที่ถูกระงับจะถูกดำเนินการต่อเพื่อสร้างเซสชันการคอมพิวเตอร์

source: You can check the operation of the job scheduler in a simple way from the user Web-UI. When the GPU host can allocate up to 2 fGPUs, let's create 3 compute sessions at the same time requesting allocation of 1 fGPU, respectively. In the Custom allocation section of the session launch dialog, there are GPU and Sessions sliders. If you specify a value greater than 1 in Sessions and click the LAUNCH button, the number of sessions will be requested at the same time. Let's set the GPU and Sessions to 1 and 3, respectively. This is the situation that 3 sessions requesting a total of 3 fGPUs are created when only 2 fGPUs exist.
ja: ジョブスケジューラの動作は、ユーザーWeb-UIから簡単に確認することができます。GPUホストが最大2つのfGPUを割り当てることができる場合、それぞれ1つのfGPUの割り当てを要求する3つのコンピュートセッションを同時に作成してみましょう。セッション起動ダイアログのカスタム割り当てセクションには、GPUとセッションのスライダーがあります。セッションに1より大きい値を指定してLAUNCHボタンをクリックすると、セッションの数が同時に要求されます。GPUとセッションをそれぞれ1と3に設定してみましょう。これは、合計3つのfGPUを要求する3つのセッションが、2つのfGPUしか存在しないときに作成される状況です。
th: คุณสามารถตรวจสอบการทำงานของตัวจัดกำหนดงานได้ในลักษณะง่าย ๆ จากผู้ใช้ Web-UI เมื่อโฮสต์ GPU สามารถจัดสรร fGPU ได้สูงสุด 2 ตัว ให้เราสร้างเซสชันการคำนวณ 3 เซสชันพร้อมกันโดยขอจัดสรร fGPU 1 ตัวตามลำดับ ในส่วนการจัดสรรแบบกำหนดเองของกล่องโต้ตอบการเปิดเซสชัน จะมีตัวเลื่อนสำหรับ GPU และเซสชัน หากคุณระบุค่าที่มากกว่า 1 ในเซสชันและคลิกปุ่ม LAUNCH จำนวนเซสชันจะถูกขอพร้อมกัน ให้เราตั้งค่า GPU และเซสชันเป็น 1 และ 3 ตามลำดับ นี่คือสถานการณ์ที่มีเซสชัน 3 เซสชันที่ขอ fGPU ทั้งหมด 3 ตัว ในขณะที่มี fGPU เพียง 2 ตัวเท่านั้น

source: Wait for a while and you will see three compute sessions being listed. If you look closely at the Status panel, you can see that two of the three compute sessions are in RUNNING state, but the other compute session remains in PENDING state. This PENDING session is only registered in the job queue and has not actually been allocated a container due to insufficient GPU resources.
ja: しばらく待つと、3つのコンピュートセッションが一覧表示されるのが見えます。ステータスパネルをよく見ると、3つのコンピュートセッションのうち2つはRUNNING状態ですが、もう1つのコンピュートセッションはPENDING状態のままであることがわかります。このPENDINGセッションはジョブキューに登録されているだけで、不十分なGPUリソースのために実際にはコンテナが割り当てられていません。
ko_kr: 잠시 기다리면 세 개의 연산 세션이 나타납니다. 상태 패널을 자세히 살펴보면 세 개의 연산 세션 중 두 개는 RUNNING 상태에 있지만 다른 연산 세션은 PENDING 상태로 남아 있음을 알 수 있습니다. 이 PENDING 세션은 작업 대기열에만 등록되며 GPU 자원 부족으로 인해 실제로 컨테이너 할당을 받지 못했습니다.
th: รอครู่หนึ่งแล้วคุณจะเห็นการเซสชันการคอมพิวเตอร์สามรายการถูกแสดงอยู่ ถ้าคุณสังเกตอย่างใกล้ชิดที่แผงสถานะ คุณจะเห็นว่าการเซสชันการคอมพิวเตอร์สองจากสามรายการอยู่ในสถานะ RUNNING แต่การเซสชันการคอมพิวเตอร์อีกหนึ่งรายการยังคงอยู่ในสถานะ PENDING การเซสชัน PENDING นี้ถูกลงทะเบียนในคิวงานเท่านั้นและยังไม่ได้ถูกจัดสรรคอนเทนเนอร์จริงเนื่องจากทรัพยากร GPU ไม่เพียงพอ

source: Now let's destroy one of the two sessions in RUNNING state. Then you can see that the compute session in PENDING state is allocated resources by the job scheduler and converted to RUNNING state soon. In this way, the job scheduler utilizes the job queue to hold the user's compute session requests and automatically process the requests when resources become available.
ja: それでは、RUNNING状態にある2つのセッションのうち1つを削除しましょう。すると、PENDING状態にあるコンピュートセッションがジョブスケジューラによってリソースが割り当てられ、すぐにRUNNING状態に変わることが確認できます。このようにして、ジョブスケジューラはユーザーのコンピュートセッションリクエストを保持するためにジョブキューを利用し、リソースが利用可能になると自動的にリクエストを処理します。
ko_kr: 이제 RUNNING 상태의 세션 두 개 중 하나를 삭제 해보겠습니다. 그러면 PENDING 상태의 연산 세션은 곧 작업 스케줄러에 의해 자원을 할당 받고 RUNNING 상태로 변환되는 것을 볼 수 있습니다. 이처럼, 작업 스케줄러는 작업 큐를 활용해 사용자의 연산 세션 요청을 간직하고 있다가 자원이 가용해질 때 자동으로 요청을 처리하게 됩니다.
th: ตอนนี้เราจะทำลายหนึ่งในสองเซสชันที่อยู่ในสถานะ RUNNING จากนั้นคุณจะเห็นว่าเซสชันการคอมพิวเตอร์ในสถานะ PENDING จะถูกจัดสรรทรัพยากรโดยตัวจัดกำหนดงานและเปลี่ยนเป็นสถานะ RUNNING ในไม่ช้า ในลักษณะนี้ ตัวจัดกำหนดงานจะใช้คิวงานเพื่อเก็บคำขอเซสชันการคอมพิวเตอร์ของผู้ใช้และประมวลผลคำขอโดยอัตโนมัติเมื่อมีทรัพยากรพร้อมใช้งาน

source: Multi-version machine learning container support
ja: マルチバージョン機械学習コンテナサポート
ko_kr: Multi-version 머신러닝 컨테이너 지원
th: การสนับสนุนคอนเทนเนอร์การเรียนรู้ของเครื่องหลายเวอร์ชัน

source: Backend.AI provides variaous pre-built ML and HPC kernel images. Therefore, users can immediately utilize major libraries and packages without having to install packages by themselves. Here, we'll walk through an example that takes advantage of multiple versions of the multiple ML library immediately.
ja: Backend.AIは、さまざまなプリビルドのMLおよびHPCカーネルイメージを提供しています。したがって、ユーザーは主要なライブラリやパッケージを自分でインストールすることなく、すぐに利用することができます。ここでは、複数バージョンの複数のMLライブラリを即座に活用する例を説明します。
ko_kr: Backend.AI 는 다양한 ML 및 HPC 커널 이미지를 사전 빌드하여 제공 합니다. 따라서, 사용 자는 스스로 패키지 설치를 굳이 하지 않더라도 주요 라이브러리 및 패키지를 즉시 활용할 수 있습니다. 여기서는 다종 ML 라이브러리의 여러 버전을 즉시 활용하는 예제를 진행합니다.
th: Backend.AI มีภาพเคอร์เนล ML และ HPC ที่สร้างไว้ล่วงหน้าหลายแบบ ผู้ใช้จึงสามารถใช้ห้องสมุดและแพ็คเกจหลักได้ทันทีโดยไม่ต้องติดตั้งแพ็คเกจด้วยตนเอง ที่นี่เราจะแสดงตัวอย่างที่ใช้ประโยชน์จากหลายเวอร์ชันของห้องสมุด ML หลายตัวทันที

source: Go to the Sessions page and open the session launch dialog. There may be various kernel images depending on the installation settings.
ja: セッションページに移動し、セッション起動ダイアログを開きます。インストール設定によっては、さまざまなカーネルイメージがあるかもしれません。
ko_kr: Sessions 페이지로 이동하여 연산 세션 생성 다이얼로그를 엽니다. Backend.AI에서는 설치 환경에 따른 다양한 커널 이미지를 제공합니다.
th: ไปที่หน้า Sessions และเปิดกล่องสนทนาเริ่มต้นเซสชัน อาจมีภาพเคอร์เนลหลายประเภทขึ้นอยู่กับการตั้งค่าการติดตั้ง

source: Here, let's select the TensorFlow 2.3 environment and created a session.
ja: ここでは、TensorFlow 2.3 環境を選択し、セッションを作成します。
ko_kr: 여기서는 TensorFlow 2.3 환경을 선택하고 세션을 생성해보았습니다.
th: ที่นี่ให้เราเลือกสภาพแวดล้อม TensorFlow 2.3 และสร้างเซสชัน

source: Open the web terminal of the created session and run the following Python command. You can see that TensorFlow 2.3 version is installed.
ja: 作成されたセッションのウェブ端末を開き、次のPythonコマンドを実行します。TensorFlow 2.3 バージョンがインストールされていることが確認できます。
ko_kr: 생성된 세션의 웹 터미널을 열고 다음 Python 명령을 실행합니다. TensorFlow 2.3 버전이 실제 설치되어 있음을 확인할 수 있습니다.
th: เปิดเทอร์มินัลเว็บของเซสชันที่สร้างขึ้นและเรียกใช้คำสั่ง Python ต่อไปนี้ คุณจะเห็นว่า TensorFlow เวอร์ชัน 2.3 ถูกติดตั้งอยู่

source: This time, let's select the TensorFlow 1.15 environment to create a compute session. If resources are insufficient, delete the previous session.
ja: 今回は、TensorFlow 1.15 環境を選択して計算セッションを作成します。リソースが不足している場合は、以前のセッションを削除してください。
ko_kr: 이번에는 TensorFlow 1.15 환경을 선택해서 연산 세션을 생성합니다. (자원이 부족한 경우 이전 세션은 삭제합니다)
th: ครั้งนี้ให้เลือกสภาพแวดล้อม TensorFlow 1.15 เพื่อสร้างเซสชันการคำนวณ หากทรัพยากรไม่เพียงพอให้ลบเซสชันก่อนหน้านี้ออก

source: Open the web terminal of the created session and run the same Python command as before. You can see that TensorFlow 1.15(.4) version is installed.
ja: 作成されたセッションのウェブターミナルを開き、以前と同じPythonコマンドを実行します。TensorFlow 1.15(.4)バージョンがインストールされていることが確認できます。
ko_kr: 생성된 세션의 웹 터미널을 열고 이전과 동일한 Python 명령을 실행합니다. TensorFlow 1.15(.4) 버전이 실제 설치되어 있음을 확인할 수 있습니다.
th: เปิดเว็บเทอร์มินัลของเซสชันที่สร้างขึ้นและรันคำสั่ง Python เดิมอีกครั้ง คุณจะเห็นว่าเวอร์ชัน TensorFlow 1.15(.4) ถูกติดตั้งอยู่

source: Finally, create a compute session using PyTorch version 1.7.
ja: 最後に、PyTorchバージョン1.7を使用してコンピュートセッションを作成します。
th: สุดท้าย ให้สร้างเซสชันการคอมพิวเตอร์โดยใช้ PyTorch เวอร์ชัน 1.7

source: Open the web terminal of the created session and run the following Python command. You can see that PyTorch 1.8 version is installed.
ja: 作成されたセッションのウェブ端末を開き、次のPythonコマンドを実行します。PyTorch 1.8バージョンがインストールされていることが確認できます。
th: เปิดเทอร์มินัลเว็บของเซสชันที่สร้างขึ้นและรันคำสั่ง Python ต่อไปนี้ คุณจะเห็นว่า PyTorch เวอร์ชัน 1.8 ถูกติดตั้งอยู่

source: Like this, you can utilize various versions of major libraries such as TensorFlow and PyTorch through Backend.AI without unnecessary effort to install them.
ja: このように、TensorFlowやPyTorchなどの主要なライブラリのさまざまなバージョンを、Backend.AIを通じてインストールの手間をかけずに利用することができます。
ko_kr: 이처럼, Backend.AI 를 통해 TensorFlow, PyTorch 등 주요 라이브러리의 다양한 버전을 불필요한 설치 노력 없이 활용할 수 있습니다.
th: เช่นนี้ คุณสามารถใช้เวอร์ชันต่าง ๆ ของไลบรารีหลัก เช่น TensorFlow และ PyTorch ผ่าน Backend.AI โดยไม่ต้องพยายามติดตั้งโดยไม่จำเป็น

source: Convert a compute session to a new private Docker image
ja: コンピュートセッションを新しいプライベートDockerイメージに変換する
ko_kr: 실행 중인 연산 세션을 새로운 사용자 이미지로 변환하는 방법
th: แปลงเซสชันการคอมพิวเตอร์เป็นภาพ Docker ส่วนตัวใหม่

source: If you want to convert a running compute session (container) to a new Docker image that you can use later to create a new compute session, you need to prepare your compute session environment and ask administrators to convert it.
ja: 実行中のコンピュートセッション（コンテナ）を、新しいコンピュートセッションを作成するために後で利用できる新しいDockerイメージに変換したい場合は、コンピュートセッション環境を準備し、管理者に変換を依頼する必要があります。
ko_kr: 실행 중인 연산 세션(컨테이너) 환경을 새로운 이미지로 변환하고 추후 연산 세션 생성시 사용하고자 하는 경우, 연산 세션 내 환경을 구성한 후 관리자에게 변환 요청을 할 수 있습니다.
th: หากคุณต้องการแปลงเซสชันการประมวลผลที่กำลังทำงาน (คอนเทนเนอร์) เป็นภาพ Docker ใหม่ที่คุณสามารถใช้ในภายหลังเพื่อสร้างเซสชันการประมวลผลใหม่ คุณต้องเตรียมสภาพแวดล้อมของเซสชันการประมวลผลของคุณและขอให้ผู้ดูแลระบบทำการแปลงมัน

source: First, prepare your compute session by installing the packages that you need and adjust the configurations as you like.
ja: まず、必要なパッケージをインストールし、設定を好みに合わせて調整して、コンピュートセッションを準備します。
ko_kr: 먼저, 연산 세션을 준비합니다. 필요한 패키지를 설치하거나 환경을 구성합니다.
th: ก่อนอื่น ให้เตรียมเซสชันการคอมพิวเตอร์ของคุณโดยการติดตั้งแพ็คเกจที่คุณต้องการและปรับแต่งการตั้งค่าตามที่คุณต้องการ

source: If you want to install OS packages, for example via ``apt`` command, it usually requires the ``sudo`` privilege. Depending on the security policy of the institute, you may not be allowed to use ``sudo`` inside a container.
ja: OSパッケージをインストールしたい場合、たとえば``apt``コマンドを介して、通常は``sudo``特権が必要です。機関のセキュリティポリシーによっては、コンテナ内で``sudo``を使用することが許可されていない場合があります。
ko_kr: ``apt`` 등과 같은 명령을 통해 OS 패키지를 설치하려면 ``sudo`` 권한이 필요합니다. 플랫폼 제공사의 보안 정책에 따라 연산 세션 내에서 ``sudo`` 사용이 허용되지 않을 수 있습니다.
th: หากคุณต้องการติดตั้งแพ็คเกจ OS ตัวอย่างเช่นผ่านคำสั่ง ``apt`` มักจะต้องใช้สิทธิ ``sudo`` ขึ้นอยู่กับนโยบายความปลอดภัยของสถาบัน คุณอาจจะไม่ได้รับอนุญาตให้ใช้ ``sudo`` ภายในคอนเทนเนอร์

source: It is recommended to use :ref:`automount folder<using-automount-folder>` to install :ref:`Python packages via pip<install_pip_pkg>`. However, if you want to add Python packages in a new image, you should install them with ``sudo pip install <package-name>`` to save them not in your home but in the system directory. The contents in your home directory, usually ``/home/work``, are not saved in converting a compute session to a new Docker image.
ja: :ref:`pip を使用して Python パッケージをインストール<install_pip_pkg>`するには、:ref:`automount フォルダー<using-automount-folder>`を使用することをお勧めします。ただし、新しいイメージに Python パッケージを追加したい場合は、それらをホームディレクトリではなくシステムディレクトリに保存するために ``sudo pip install <package-name>`` を使用してインストールする必要があります。通常 ``/home/work`` にあるホームディレクトリの内容は、計算セッションを新しい Docker イメージに変換する際には保存されません。
ko_kr: :ref:`Python 패키지를 pip을 통해 설치하려는 경우<install_pip_pkg>`, :ref:`자동 마운트 폴더<using-automount-folder>` 사용을 권장 드립니다. 하지만, 새 이미지 자체에 Python 패키지를 추가하려면 ``sudo pip install <package-name>`` 과 같이 실행하여 패키지를 홈 디렉토리가 아닌 시스템 디렉토리에 설치하여야 합니다. 연산 세션 내 홈 디렉토리(일반적으로 ``/home/work``)는 호스트에서 마운트된 폴더이므로 신규 이미지로 변환할 때 내용이 포함되지 않습니다.
th: แนะนำให้ใช้ :ref:`automount folder<using-automount-folder>` เพื่อติดตั้ง :ref:`Python packages via pip<install_pip_pkg>` อย่างไรก็ตาม หากคุณต้องการเพิ่ม Python packages ในภาพใหม่ คุณควรติดตั้งด้วย ``sudo pip install <package-name>`` เพื่อบันทึกไม่ให้อยู่ในโฮมของคุณแต่ในไดเรกทอรีของระบบ เนื้อหาในไดเรกทอรีโฮมของคุณ ซึ่งปกติจะเป็น ``/home/work`` จะไม่ได้รับการบันทึกเมื่อแปลงเซสชันการคอมพิวเตอร์เป็นภาพ Docker ใหม่

source: When your compute session is prepared, please ask an administrator to convert it to a new Docker image. You need to inform them the session name or ID and your email address in the platform.
ja: コンピュートセッションが準備できたら、新しいDockerイメージに変換するよう管理者に依頼してください。プラットフォームでセッション名またはID、そしてあなたのメールアドレスを知らせる必要があります。
ko_kr: 연산 세션 환경이 준비되면 관리자에게 이미지로의 변환을 요청합니다. 관리자에게 플랫폼 내 사용자의 이메일과 변환하고자 하는 연산 세션의 이름 또는 ID를 전달해야 합니다.
th: เมื่อเซสชันการคอมพิวเตอร์ของคุณถูกเตรียมพร้อมแล้ว กรุณาขอให้ผู้ดูแลระบบแปลงมันเป็นภาพ Docker ใหม่ คุณต้องแจ้งให้พวกเขาทราบชื่อหรือ ID ของเซสชันและที่อยู่อีเมลของคุณในแพลตฟอร์ม

source: The administrator will convert your compute session to a new Docker image and send you the full image name and tag.
ja: 管理者はあなたのコンピュートセッションを新しいDockerイメージに変換し、完全なイメージ名とタグを送信します。
ko_kr: 관리자가 일정 주기로 연산 세션을 이미지로 변환한 후 이미지의 이름과 태그 정보를 전달할 것입니다.
th: ผู้ดูแลระบบจะเปลี่ยนเซสชันการคอมพิวเตอร์ของคุณเป็นภาพ Docker ใหม่และส่งชื่อภาพและแท็กทั้งหมดให้คุณ

source: You can manually enter the image name in the session launch dialog. The image is private and not be revealed to other users
ja: セッション起動ダイアログでイメージ名を手動で入力できます。このイメージはプライベートであり、他のユーザーには公開されません。
ko_kr: 연산 세션 생성 다이얼로그에서 수동으로 이미지 이름을 입력한 후 연산 세션을 생성합니다. 변환된 이미지는 다른 사용자에게 노출되지 않습니다.
th: คุณสามารถป้อนชื่อภาพด้วยมือในกล่องโต้ตอบเปิดเซสชัน ภาพนี้เป็นส่วนตัวและจะไม่เปิดเผยให้ผู้ใช้อื่นทราบ

source: A new compute session will be created using the new Docker image.
ja: 新しい Docker イメージを使用して、新しいコンピュートセッションが作成されます。
ko_kr: 새 이미지를 활용해 연산 세션이 정상적으로 실행되어야 합니다.
th: เซสชั่นการคอมพิวเตอร์ใหม่จะถูกสร้างขึ้นโดยใช้ภาพ Docker ใหม่

source: Backend.AI Server Installation Guide
ja: Backend.AI サーバーインストールガイド
ko_kr: Backend.AI 서버 설정 가이드
th: คู่มือการติดตั้งเซิร์ฟเวอร์ Backend.AI

source: For Backend.AI Server daemons/services, following hardware specification should be met. For optimal performance, just double the amount of each resources.
ja: Backend.AI サーバーのデーモン/サービスには、以下のハードウェア仕様を満たす必要があります。最適なパフォーマンスのために、各リソースの量を倍増させてください。
ko_kr: Backend.AI 데몬/서비스 구동을 위해서는 다음과 같은 하드웨어가 필요합니다. 최적 성능을 위해서는 아래 명기된 사양의 두 배 이상 필요합니다.
th: สำหรับบริการ/daemon ของ Backend.AI Server ควรมีข้อกำหนดฮาร์ดแวร์ดังต่อไปนี้ สำหรับประสิทธิภาพที่ดีที่สุด ให้เพิ่มปริมาณของทรัพยากรแต่ละอย่างเป็นสองเท่า

source: Manager: 2 cores, 4 GiB memory
ja: マネージャー: 2コア、4 GiBメモリ
th: ผู้จัดการ: 2 คอร์, 4 GiB หน่วยความจำ

source: Agent: 4 cores, 32 GiB memory, NVIDIA GPU (for GPU workload), > 512 GiB SSD
ja: エージェント: 4コア、32GiBメモリ、NVIDIA GPU（GPUワークロード用）、> 512GiB SSD
th: เอเจนต์: 4 คอร์, 32 GiB หน่วยความจำ, NVIDIA GPU (สำหรับงานที่ใช้ GPU), > 512 GiB SSD

source: Webserver: 2 cores, 4 GiB memory
ja: Webサーバー：2コア、4 GiBメモリ
th: เว็บเซิร์ฟเวอร์: 2 คอร์, หน่วยความจำ 4 GiB

source: WSProxy: 2 cores, 4 GiB memory
ja: WSProxy: 2コア、4GiBメモリ
th: WSProxy: 2 คอร์, 4 GiB แรม

source: PostgreSQL DB: 2 cores, 4 GiB memory
ja: PostgreSQL DB: 2コア、4 GiBメモリ
th: PostgreSQL DB: 2 คอร์, 4 GiB หน่วยความจำ

source: Redis: 1 core, 2 GiB memory
ja: Redis: 1コア、2GiBメモリ
th: Redis: 1 คอร์, หน่วยความจำ 2 GiB

source: Etcd: 1 core, 2 GiB memory
ja: Etcd: 1 コア, 2 GiB メモリ
th: Etcd: 1 คอร์, 2 GiB หน่วยความจำ

source: The essential host dependent packages that must be pre-installed before installing each service are:
ja: 各サービスをインストールする前に事前にインストールされている必要があるホスト依存の必須パッケージは次の通りです。
ko_kr: 각 서비스를 설치하기 전에 사전에 설치되어야 할 주요 의존 호스트 패키지는 다음과 같습니다:
th: แพ็คเกจที่จำเป็นต้องขึ้นอยู่กับโฮสต์ซึ่งต้องติดตั้งล่วงหน้าก่อนการติดตั้งแต่ละบริการคือ:
