Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/appendix/appendix.po
Languages: ja, ko_kr, th

source: Web-UI: Operating system that can run the latest browsers (Windows, Mac OS, Ubuntu, etc.)
ja: Web-UI: 最新のブラウザを実行できるオペレーティングシステム（Windows、Mac OS、Ubuntu など）
ko_kr: Web-UI: 최신 브라우저를 구동할 수 있는 운영체제 (Windows, Mac OS, Ubuntu 등)
th: Web-UI: ระบบปฏิบัติการที่สามารถรันเว็บเบราว์เซอร์ล่าสุด (Windows, Mac OS, Ubuntu, ฯลฯ)

source: Manager: Python (≥3.8), pyenv/pyenv-virtualenv (≥1.2)
ja: マネージャー: Python (>=3.8), pyenv/pyenv-virtualenv (>=1.2)
th: ผู้จัดการ: Python (≥3.8), pyenv/pyenv-virtualenv (≥1.2)

source: Agent: docker (≥19.03), CUDA/CUDA Toolkit (≥8, 11 recommend), nvidia-docker v2, Python (≥3.8), pyenv/pyenv-virtualenv (≥1.2)
ja: エージェント: docker (>=19.03), CUDA/CUDA Toolkit (>=8、11 推奨), nvidia-docker v2, Python (>=3.8), pyenv/pyenv-virtualenv (>=1.2)
th: เอเย่นต์: docker (≥19.03), CUDA/CUDA Toolkit (≥8, แนะนำ 11), nvidia-docker v2, Python (≥3.8), pyenv/pyenv-virtualenv (≥1.2)

source: Webserver: Python (≥3.8), pyenv/pyenv-virtualenv (≥1.2)
th: เว็บเซิร์ฟเวอร์: Python (≥3.8), pyenv/pyenv-virtualenv (≥1.2)

source: For Enterprise version, Backend.AI server daemons are installed by Lablup support team and following materials/services are provided after initial installation:
ja: エンタープライズバージョンでは、Backend.AI サーバーデーモンは Lablup サポートチームによってインストールされ、初期インストール後に以下の資料/サービスが提供されます。
ko_kr: 엔터프라이즈 버전의 Backend.AI 서버 데몬은 래블업의 지원팀에서 설치합니다. 초기 설치 후 기본적으로 다음과 같은 자료 및 서비스가 제공됩니다:
th: สำหรับเวอร์ชัน Enterprise, daemon เซิร์ฟเวอร์ Backend.AI จะถูกติดตั้งโดยทีมสนับสนุนของ Lablup และเอกสาร/บริการต่อไปนี้จะถูกจัดเตรียมหลังจากการติดตั้งเริ่มต้น:

source: DVD 1 (includes Backend.AI packages)
ja: DVD 1（Backend.AIパッケージを含む）
ko_kr: DVD 1 장 (Backend.AI 패키지 포함)
th: DVD 1 (รวมแพ็คเกจ Backend.AI)

source: User GUI Guide manual
ja: ユーザーGUIガイドマニュアル
ko_kr: 사용자 GUI 가이드 매뉴얼
th: คู่มือการใช้งาน GUI ของผู้ใช้

source: Admin GUI Guide manual
ja: 管理者GUIガイドマニュアル
ko_kr: 관리자 GUI 가이드 매뉴얼 (엔터프라이즈 고객 전용)
th: คู่มือ Admin GUI Guide

source: Installation report
ja: インストールレポート
ko_kr: 설치 리포트
th: รายงานการติดตั้ง

source: First-time user/admin on-site tutorial (3-5 hours)
ja: 初めてのユーザー/管理者向け現地チュートリアル（3〜5時間）
ko_kr: 사용자/관리자 초기 방문 교육 (3-5 시간)
th: การฝึกอบรมสำหรับผู้ใช้/ผู้ดูแลระบบมือใหม่ (3-5 ชั่วโมง)

source: Product maintenance and support information: the commercial contract includes a monthly/annual subscription fee for the Enterprise version by default. Initial user/administrator training (1-2 times) and wired/wireless customer support services are provided for about 2 weeks after initial installation, minor release updater support and customer support services through online channels are provided for 3-6 months. Maintenance and support services provided afterwards may have different details depending on the terms of the contract.
ja: 製品の保守およびサポート情報: 商用契約には、デフォルトでEnterpriseバージョンの月額/年額サブスクリプション料金が含まれています。 初期ユーザー/管理者トレーニング（1～2回）および有線/無線の顧客サポートサービスは、初回インストール後約2週間提供され、マイナーリリースのアップデートサポートとオンラインチャネルを通じた顧客サポートサービスは3～6か月提供されます。 その後に提供される保守およびサポートサービスは、契約の条件によって詳細が異なる場合があります。
ko_kr: 제품의 유지보수 및 지원 정보: 상용 계약에는 기본적으로 엔터프라이즈 버전의 월간/연간 구독 사용료가 포함됩니다. 최초 설치 후 약 2주 간 초기 사용자/관리자 교육 (1-2 회) 및 유무선 상의 고객 지원 서비스가 제공되며, 3-6 개월 간 마이너 릴리즈 업데이터 지원 및 온라인 채널을 통한 고객 지원 서비스가 제공됩니다. 이후 제공되는 유지보수 및 지원 서비스는 계약 조건에 따라 세부 내용이 다를 수 있습니다.
th: ข้อมูลการบำรุงรักษาและการสนับสนุนผลิตภัณฑ์: สัญญาทางการค้าจะรวมค่าธรรมเนียมการสมัครสมาชิกแบบรายเดือน/รายปีสำหรับเวอร์ชัน Enterprise โดยอัตโนมัติ การฝึกอบรมผู้ใช้/ผู้ดูแลระบบเริ่มต้น (1-2 ครั้ง) และบริการสนับสนุนลูกค้าแบบมีสาย/ไร้สายจะมีให้บริการประมาณ 2 สัปดาห์หลังจากการติดตั้งเริ่มต้น การสนับสนุนการอัปเดตเวอร์ชันขนาดเล็กและบริการสนับสนุนลูกค้าผ่านช่องทางออนไลน์จะมีให้บริการเป็นเวลา 3-6 เดือน บริการบำรุงรักษาและสนับสนุนที่ให้บริการหลังจากนั้นอาจมีรายละเอียดที่แตกต่างกันไปขึ้นอยู่กับข้อกำหนดในสัญญา

source: Integration examples
ja: 統合例
th: ตัวอย่างการรวมระบบ

source: In this section, we would like to introduce several common examples of applications, toolkits, and machine learning tools that can be utilized on the Backend.AI platform. Here, we will provide explanations of the basic usage of each tool and how to set them up in the Backend.AI environment, along with simple examples. We hope this will help you choose and utilize the tools you need for your projects.
ja: このセクションでは、Backend.AIプラットフォームで利用できる一般的なアプリケーション、ツールキット、機械学習ツールのいくつかの例を紹介します。ここでは、各ツールの基本的な使用法やBackend.AI環境での設定方法を説明し、簡単な例を挙げます。これがプロジェクトに必要なツールを選択し、活用する際の助けになればと思います。
th: ในส่วนนี้เราต้องการแนะนำตัวอย่างทั่วไปหลาย ๆ ตัวอย่างของแอปพลิเคชัน ชุดเครื่องมือ และเครื่องมือการเรียนรู้ของเครื่องที่สามารถใช้งานได้บนแพลตฟอร์ม Backend.AI ที่นี่เราจะให้คำอธิบายเกี่ยวกับการใช้งานพื้นฐานของแต่ละเครื่องมือและวิธีการตั้งค่าในสภาพแวดล้อมของ Backend.AI พร้อมกับตัวอย่างง่าย ๆ หวังว่าสิ่งนี้จะช่วยให้คุณเลือกและใช้เครื่องมือที่คุณต้องการสำหรับโครงการของคุณ

source: Please note that the content covered in this guide is based on specific versions of the programs, so the usage may vary in future updates. Therefore, please use this document for reference and also check the latest official documentation for any changes. Now, let's take a look at the powerful tools available for use on Backend.AI one by one. We hope this section will serve as a useful guide for your research and development.
ja: このガイドで扱われている内容は特定のバージョンのプログラムに基づいているため、今後のアップデートで使用方法が異なる場合があります。したがって、このドキュメントを参考にするとともに、最新の公式ドキュメントでの変更点も確認してください。では、Backend.AIで使用可能な強力なツールを一つずつ見ていきましょう。このセクションがあなたの研究開発に役立つガイドとなることを願っています。
th: โปรดทราบว่าเนื้อหาที่ครอบคลุมในคู่มือนี้อิงตามเวอร์ชันเฉพาะของโปรแกรม ดังนั้นการใช้งานอาจแตกต่างกันในอัปเดตในอนาคต ดังนั้นโปรดใช้เอกสารนี้เป็นข้อมูลอ้างอิงและตรวจสอบเอกสารอย่างเป็นทางการล่าสุดสำหรับการเปลี่ยนแปลง ตอนนี้เรามาดูเครื่องมือที่มีพลังที่สามารถใช้ได้ใน Backend.AI ทีละอย่าง เราหวังว่าหมวดหมู่นี้จะเป็นคู่มือที่มีประโยชน์สำหรับการวิจัยและพัฒนาของคุณ

source: Using MLFlow
ja: MLFlowの使用方法
th: การใช้ MLFlow

source: There are many executable images in Backend.AI supports MLFlow and MLFlow UI as built-in app. But in order to execute it, you may need extra procedures. By following instructions below, you will be able to track parameters and result at Backend.AI as if you are using it on your local environment.
ja: Backend.AI には多くの実行可能なイメージがあり、MLFlow と MLFlow UI をビルトインアプリとしてサポートしています。しかし、それを実行するためには追加の手順が必要な場合があります。以下の指示に従うことで、ローカル環境で使用しているかのように、Backend.AI でパラメータと結果を追跡できるようになります。
th: มีภาพที่สามารถทำงานได้มากมายใน Backend.AI รองรับ MLFlow และ MLFlow UI เป็นแอปที่ถูกสร้างขึ้นมา แต่เพื่อที่จะทำการใช้งานมัน คุณอาจจำเป็นต้องทำตามขั้นตอนเพิ่มเติม โดยการทำตามคำแนะนำด้านล่าง คุณจะสามารถติดตามพารามิเตอร์และผลลัพธ์ที่ Backend.AI เหมือนกับว่าคุณกำลังใช้งานอยู่ในสภาพแวดล้อมในเครื่องของคุณ

source: In this section, we will regard you already created session and about to execute an app in the session. If you don't have any experience in creating session and executing app inside, please have a look through :ref:`How to create a session<create_session>` section.
ja: このセクションでは、セッションを既に作成し、そのセッション内でアプリを実行しようとしているとみなします。もし、セッションの作成やその内部でアプリを実行する経験がない場合は、:ref:`セッションの作成方法<create_session>` セクションを参照してください。
th: ในส่วนนี้ เราจะถือว่าคุณได้สร้างเซสชันแล้วและกำลังจะเรียกใช้แอปในเซสชันนั้น หากคุณไม่มีประสบการณ์ในการสร้างเซสชันและเรียกใช้แอปภายในเซสชัน โปรดดูที่ :ref:`วิธีการสร้างเซสชัน<create_session>`

source: First, launch terminal app "console". and execute the command below, It will start mlflow tracking UI server.
ja: まず、ターミナルアプリ「console」を起動し、以下のコマンドを実行してください。これにより、mlflow トラッキング UI サーバーが開始されます。
th: ก่อนอื่นให้เปิดแอปพลิเคชันเทอร์มินัล "console" และรันคำสั่งด้านล่าง มันจะเริ่มเซิร์ฟเวอร์ UI การติดตาม mlflow

source: Then, Click "MLFlow UI" app in app launcher dialog.
ja: その後、アプリランチャーダイアログで「MLFlow UI」アプリをクリックします。
th: จากนั้น คลิกที่แอป "MLFlow UI" ในกล่องสนทนาแอปเลนเชอร์

source: After few moment, you will see a new page for MLFlow UI.
ja: しばらくすると、MLFlow UIの新しいページが表示されます。
th: หลังจากนั้นสักครู่ คุณจะเห็นหน้าจอใหม่สำหรับ MLFlow UI

source: By using MLFlow, you can track experiments, such as metrics and parameters every time you run. Let's start tracking experiments from simple example.
ja: MLFlowを使用することで、実行するたびにメトリクスやパラメータなどの実験を追跡できます。シンプルな例から実験の追跡を始めましょう。
th: ด้วยการใช้ MLFlow คุณสามารถติดตามการทดลอง เช่น เมตริกและพารามิเตอร์ทุกครั้งที่คุณรัน มาลองเริ่มติดตามการทดลองจากตัวอย่างง่ายๆ กันเถอะ

source: After executing python code, you may see the experiments result in MLFlow.
ja: Pythonコードを実行した後、MLFlowで実験結果を見ることができます。
th: หลังจากที่คุณเรียกใช้โค้ด python คุณอาจเห็นผลลัพธ์ของการทดลองใน MLFlow

source: You can also set hyperparameter by giving arguments with code execution.
ja: コード実行時に引数を指定することでハイパーパラメータを設定することもできます。
th: คุณยังสามารถตั้งค่า hyperparameter ได้โดยการให้พารามิเตอร์พร้อมกับการรันโค้ด

source: After a few training, you can compare trained models with results.
ja: いくつかのトレーニングを行った後で、結果とともに訓練されたモデルを比較することができます。
th: หลังจากการฝึกอบรมไม่กี่ครั้ง คุณสามารถเปรียบเทียบโมเดลที่ฝึกอบรมแล้วกับผลลัพธ์ได้

source: You can check the operation of the job scheduler in a simple way from the user Web-UI. When the GPU host can allocate up to 2 fGPUs, let's create 3 compute sessions at the same time requesting allocation of 1 fGPU, respectivley. In the Custom allocation section of the session launch dialog, there are GPU and Sessions sliders. If you specify a value greater than 1 in Sessions and click the LAUNCH button, the number of sessions will be requested at the same time. Let's set the GPU and Sessions to 1 and 3, respectively. This is the situation that 3 sessions requesting a total of 3 fGPUs are created when only 2 fGPUs exist.
ko_kr: 사용자 Web-UI에서 간단한 방법으로 작업 스케줄러의 작동을 확인할 수 있습니다. GPU 호스트가 최대 2 단위의 fGPU를 할당 할 수있는 경우 1 단위의 fGPU 할당을 요청하는 3 개의 연산 세션을 동시에 생성해 보겠습니다. 세션 시작 대화 상자의 사용자 지정 할당 패널에는 GPU 및 세션 슬라이더가 있습니다. Sessions에서 1보다 큰 값을 지정하고 LAUNCH 버튼을 클릭하면 여러 개의 세션이 동시에 생성됩니다. GPU와 Sessions을 각각 1과 3으로 설정하겠습니다. 이는 fGPU가 2 단위밖에 없는 상황에서 총 3 단위의 fGPU를 요청하는 상황입니다.

source: Finally, create a compute session using PyTorch version 1.9.
ko_kr: 마지막으로 PyTorch 1.9 버전을 이용해서 연산 세션을 생성합니다.

source: Open the web terminal of the created session and run the following Python command. You can see that PyTorch 1.5 version is installed.
ko_kr: 생성된 세션의 웹 터미널을 열고 다음 Python 명령을 실행합니다. PyTorch 1.5 버전이 실제 설치되어 있음을 확인할 수 있습니다.

source: Backend.AI Server Management Guide
ko_kr: 간단한 Backend.AI 서버 관리 가이드

source: Backend.AI is composed of many modules and daemons. Here, we briefly describe each services and provide basic maintenance guide in case of specific service failure. Note that the maintenance operations provided here are generally applicable, but may differ depending on the host-specific installation details.
ko_kr: Backend.AI 는 여러 개의 모듈과 데몬으로 구성되어 있습니다. 여기서는 각 서비스에 관한 짧은 설명과 서비스 별로 문제가 발생하였을 때 사용할 수 있는 간단한 관리 가이드를 제공합니다. 관리 명령은 일반적으로 사용 가능하지만, 호스트 별 설치 상황에 따라 구체적인 사항은 달라질 수 있습니다.

source: Gateway server that accepts and handles every user request. If the request is related with the compute session (container), Manager will delegate the request to Agent and/or containers in each Agent.
ko_kr: 사용자로부터 오는 모든 요청을 받아 처리하는 게이트웨이 서버입니다. 사용자의 요청이 연산 세션(컨테이너)과 관련 있다면, 해당 세션을 관리하는 Agent 또는 해당 컨테이너로 작업을 위임합니다.

source: Worker node which manages the lifecycle of compute sessions (containers).
ko_kr: 연산 워커 노드입니다. 연산 세션 (컨테이너) 의 수명주기를 관리합니다.

source: Serves user Web-UI and provides authentication by email and password.
ko_kr: 사용자 웹 GUI 환경을 제공하고, 이메일/비밀번호 기반의 사용자 인증 또한 지원합니다.

source: Proxies the connection between user-created web apps (such as web Terminal and Jupyter Notebook) and Manager, which is then relayed to a specific compute session (container).
ko_kr: 사용자가 띄운 웹기반 앱 (터미널, Jupyter Notebook 등) 과 매니저 사이의 통신을 중계하는 서비스입니다.

source: Database for Manager.
ko_kr: Manager 가 사용하는 데이터베이스입니다.

source: To back up the DB data, you can use the following commands from the DB host. The specific commands may vary depending on the configuration.
ko_kr: DB 를 백업하기 위해서는 다음과 같은 명령을 사용할 수 있습니다. 구체적인 명령은 설치 환경에 따라 다양할 수 있습니다.

source: To restore the DB from the backup data, you can execute the following commands. Specific options may vary depending on the configuration.
ko_kr: 백업 데이터를 통해 DB 를 복원하려면 다음과 같은 명령을 실행할 수 있습니다. 구체적인 옵션은 설치 환경에 따라 다양할 수 있습니다.

source: Cache server which is used to collect per-session and per-agent usage statistics and relays heartbeat signal from Agent to Manager. It also keeps user's authentication information.
ko_kr: 캐시 서비스로, Agent 와 연산 세션의 사용량 정보를 수집하고, Agent 에서 Manager 로 가는 heartbeat 신호를 중계합니다. 사용자의 로그인 인증 정보를 보관하기도 합니다.

source: Usually, Redis data do not need backup since it contains temporary cached data only, such user's login session information, per-container live stat, and etc.
ko_kr: 일반적으로, Redis 데이터를 백업할 필요가 없습니다. 사용자 로그인 세션 쿠키 정보, 컨테이너 별 실시간 사용량 등과 같은 일시적으로만 존재하면 되는 정보를 저장하고 있기 때문입니다.

source: Config server, which contains Backend.AI system-wide configuration.
ko_kr: 설정 서버로, Backend.AI 의 전역 설정값을 보관하고 있습니다.

source: To back up the Etcd config data used by the Manager, go to the folder where the Manager is installed and use the following command.
ko_kr: Manager 에서 사용하는 Etcd 설정 데이터를 백업하려면 Manager 가 설치된 폴더로 이동한 후 다음과 같은 명령을 사용하면 됩니다.

source: To restore Etcd settings from the backup data, you can run a command like this.
ko_kr: 백업 데이터를 통해 Etcd 설정을 복원하려면 다음과 같은 명령을 실행할 수 있습니다.
