Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/license_agreement/license_agreement.po
Languages: ja, ko, th

source: Terms of License Agreement
ja: ライセンス契約の条件
ko: 사용권 계약 조건
th: ข้อตกลงการอนุญาตใช้งาน

source: Backend.AI License (Software)
ja: Backend.AI ライセンス (ソフトウェア)
ko: Backend.AI 라이선스 (소프트웨어)
th: ใบอนุญาต Backend.AI (ซอฟต์แวร์)

source: This document defines the terms of the license agreement for the Backend.AI software. The usage fee and support plan of Backend.AI Cloud service provided by Lablup is independent of this policy.
ja: このドキュメントは、Backend.AI ソフトウェアのライセンス契約の条件を定義しています。Lablup によって提供される Backend.AI クラウドサービスの使用料およびサポートプランは、このポリシーとは無関係です。
ko: 이 문서는 Backend.AI 소프트웨어에 관한 사용권 계약 조건을 정의합니다. 래블업에서 제공하는 Backend.AI Cloud 서비스의 사용료 및 지원 플랜은 이 정책과 별도입니다.
th: เอกสารนี้กำหนดเงื่อนไขของข้อตกลงใบอนุญาตสำหรับซอฟต์แวร์ Backend.AI ค่าธรรมเนียมการใช้งานและแผนสนับสนุนบริการ Backend.AI Cloud ที่จัดทำโดย Lablup เป็นอิสระจากนโยบายนี้

source: Backend.AI server components (hereinafter referred to as "Backend.AI Server") are distributed under the GNU Lesser General Public License v3.0 ("LGPL"), and API Client libraries and auxiliary components for accessing Backend.AI server (hereinafter "Backend.AI Client") are distributed under the MIT License. Even if LGPL complies, commercial contracts with Lablup Co., Ltd. ("Lablup") are required depending on the conditions when performing profit activities using the Backend.AI server. Several additional plug-ins and admin's GUI Control-Panel that apply to Backend.AI enterprise solutions are not open source, but commercial software.
ja: Backend.AIサーバーコンポーネント（以下「Backend.AIサーバー」）はGNU Lesser General Public License v3.0（「LGPL」）のもとで配布されており、Backend.AIサーバーにアクセスするためのAPIクライアントライブラリおよび補助コンポーネント（以下「Backend.AIクライアント」）はMITライセンスで配布されています。たとえLGPLに準拠していても、Backend.AIサーバーを使用して利益活動を行う際の条件により、Lablup Co., Ltd.（「Lablup」）との商業契約が必要です。Backend.AIエンタープライズソリューションに適用されるいくつかの追加プラグインおよび管理者用GUIコントロールパネルはオープンソースではなく、商用ソフトウェアです。
ko: Backend.AI의 서버 컴포넌트들(이하 “Backend.AI 서버”)은 GNU Lesser General Public License v3.0(이하 “LGPL”)으로 배포되며, Backend.AI 서버에 접속하기 위한 API Client 라이브러리들 및 보조 컴포넌트들(이하 “Backend.AI 클라이언트”)은 MIT 라이선스로 배포됩니다. LGPL을 준수하는 경우에도 Backend.AI 서버를 이용한 수익 활동을 하는 경우 조건에 따라 래블업 주식회사(“래블업”)와의 상용 계약이 필요합니다. Backend.AI 엔터프라이즈 솔루션을 대상으로 하는 추가적인 몇몇 플러그인 및 관리 허브는 오픈소스가 아니며, 상용 소프트웨어입니다.
th: ส่วนประกอบเซิร์ฟเวอร์ของ Backend.AI (ต่อไปนี้จะเรียกว่า "Backend.AI Server") กระจายภายใต้ GNU Lesser General Public License v3.0 ("LGPL") และไลบรารี API Client และส่วนประกอบเสริมสำหรับการเข้าถึงเซิร์ฟเวอร์ Backend.AI (ต่อไปนี้เรียกว่า "Backend.AI Client") กระจายภายใต้ MIT License แม้ว่าจะเป็นไปตาม LGPL แต่ต้องมีสัญญาการค้า กับ Lablup Co., Ltd. ("Lablup") ขึ้นอยู่กับเงื่อนไขในการดำเนินกิจกรรมที่มุ่งหวังผลกำไรโดยใช้เซิร์ฟเวอร์ Backend.AI มีปลั๊กอินเพิ่มเติมหลายตัวและแผงควบคุม GUI ของผู้ดูแลระบบที่ใช้กับโซลูชัน Backend.AI สำหรับองค์กร ซึ่งไม่ใช่ไม่เปิดเผยซอร์สโค้ด แต่เป็นซอฟต์แวร์เชิงพาณิชย์

source: **Term Definition**
ja: **用語の定義**
ko: **용어 정의**
th: **คำจำกัดความ**

source: Hardware: Includes physical computers, virtual machine and container environments that users own or lease and have rights to run software.
ja: ハードウェア: 所有またはリースし、ソフトウェアを実行する権利がある物理コンピュータ、仮想マシン、およびコンテナ環境を含みます。
ko: 하드웨어 : 사용자가 자기 소유 또는 임대한 물리적 컴퓨터와 소프트웨어 실행 권한을 가지는 가상머신 및 컨테이너 환경을 포함합니다.
th: ฮาร์ดแวร์: รวมถึงคอมพิวเตอร์ทางกายภาพ, เครื่องเสมือน และสภาพแวดล้อมของคอนเทนเนอร์ที่ผู้ใช้เป็นเจ้าของหรือเช่าและมีสิทธิในการเรียกใช้ซอฟต์แวร์

source: Organization: Individuals, corporations, organizations, institutions (including non-profit and commerical organizations; however, subsidiaries that are separate corporations are not included)
ja: 組織: 個人、法人、団体、機関（非営利および商業組織を含む。ただし、独立した法人である子会社は含まれない）
ko: 조직 : 개인, 법인, 단체, 기관 (비영리·영리 모두 포함; 단, 별도 법인인 자회사는 포함하지 않습니다)
th: องค์กร: บุคคล, บริษัท, องค์กร, สถาบัน (รวมถึงองค์กรไม่แสวงหาผลกำไรและองค์กรพาณิชย์; อย่างไรก็ตาม บริษัทลูกที่เป็นร่างกายแยกต่างหากไม่รวมอยู่ด้วย)

source: LGPL must be followed when users use and change Backend.AI Server (Manager / Agent / Common) or develop and distribute software that uses it. However, in the case of distributing software which import Backend.AI server as a module without changing it (e.g. Python import), it is regarded as a dynamic link and code disclosure under the LGPL is exempted. When Backend.AI server is installed on the hardware and used by the general public through the network, there is no obligation under the LGPL.
ja: LGPL は、ユーザーが Backend.AI Server（Manager / Agent / Common）を使用および変更する場合、またはそれを使用するソフトウェアを開発および配布する場合に従わなければなりません。ただし、Backend.AI サーバーをモジュールとしてインポートし、変更せずにソフトウェアを配布する場合（例：Python のインポート）、それは動的リンクと見なされ、LGPL に基づくコードの公開は免除されます。Backend.AI サーバーがハードウェアにインストールされ、ネットワークを通じて一般に使用される場合、LGPL に基づく義務はありません。
ko: 사용자가 Backend.AI Server(Manager / Agent / Common)를 사용 및 변경하거나 이를 이용하는 소프트웨어를 개발 및 배포하는 경우 LGPL 을 따라야 합니다. 하지만, 배포하는 소프트웨어가 Backend.AI 서버를 변경하지 않고 모듈 형태(Python import 등)로 불러서 사용하는 경우에는, 동적 링크를 사용하는 것으로 보아 LGPL에 따른 코드 공개 의무가 없다고 간주합니다. Backend.AI 서버를 하드웨어에 설치하여 일반 공중이 네트워크를 통해 사용하는 경우에는 LGPL 에 따른 의무가 없습니다.
th: LGPL ต้องได้รับการปฏิบัติตามเมื่อผู้ใช้ใช้งานและเปลี่ยนแปลง Backend.AI Server (Manager / Agent / Common) หรือพัฒนาและจัดจำหน่ายซอฟต์แวร์ที่ใช้มัน อย่างไรก็ตาม ในกรณีที่จัดจำหน่ายซอฟต์แวร์ที่นำเข้า Backend.AI server เป็นโมดูลโดยไม่เปลี่ยนแปลง (เช่น Python import) จะถือว่าเป็นการเชื่อมโยงแบบไดนามิก และการเปิดเผยโค้ตตาม LGPL จะไม่บังคับ เมื่อ Backend.AI server ถูกติดตั้งบนฮาร์ดแวร์และใช้งานโดยประชาชนทั่วไปผ่านเครือข่าย จะไม่มีข้อผูกพันตาม LGPL

source: The correct interpretation of all other cases is subject to the LGPL original text and court judgment.
ja: 他のすべてのケースの正しい解釈は、LGPLの原文と裁判所の判断に従います。
ko: 이 외의 모든 경우에 대한 정확한 해석은 LGPL 원문과 법원의 판단을 따릅니다.
th: การตีความที่ถูกต้องของกรณีอื่น ๆ ทั้งหมดอยู่ภายใต้ข้อความต้นฉบับของ LGPL และคำพิพากษาของศาล

source: Apart from LGPL compliance, commercial contracts must be made with Lablup in the following cases:
ja: LGPLコンプライアンスとは別に、以下の場合はLablupとの商業契約を結ぶ必要があります。
ko: LGPL 준수와 별개로, 다음과 같은 경우에는 래블업과 상용 계약을 맺어야 합니다:
th: นอกเหนือจากการปฏิบัติตาม LGPL การทำสัญญาทางการค้าจะต้องทำกับ Lablup ในกรณีต่อไปนี้:

source: When software that works only after installing the Backend.AI server is sold to customers outside the organization.
ja: Backend.AIサーバーをインストールした後にのみ動作するソフトウェアが、組織外の顧客に販売される場合。
ko: Backend.AI 서버를 설치해야만 동작하는 소프트웨어를 조직 외부 고객에게 판매하는 경우.
th: เมื่อซอฟต์แวร์ที่ทำงานได้เฉพาะหลังจากการติดตั้งเซิร์ฟเวอร์ Backend.AI ถูกขายให้กับลูกค้านอกองค์กร

source: When hardware including Backend.AI server is sold to customers outside the organization.
ja: 組織外の顧客にBackend.AIサーバーを含むハードウェアが販売される場合。
ko: Backend.AI 서버를 포함한 하드웨어를 조직 외부 고객에게 판매하는 경우.
th: เมื่อฮาร์ดแวร์รวมถึงเซิร์ฟเวอร์ Backend.AI ถูกขายให้กับลูกค้านอกองค์กร

source: When the Backend.AI server is installed on the hardware and the usage fee is received from a customer outside the organization that uses it.
ja: Backend.AIサーバーがハードウェアにインストールされ、それを使用する組織外の顧客から使用料金が受け取られる場合。
ko: Backend.AI 서버를 하드웨어에 설치하고 이를 사용하는 조직 외부 고객으로부터 사용료를 받는 경우.
th: เมื่อเซิร์ฟเวอร์ Backend.AI ถูกติดตั้งในฮาร์ดแวร์และได้รับค่าธรรมเนียมการใช้งานจากลูกค้านอกองค์กรที่ใช้งานมัน

source: In other cases, you can use the Backend.AI server for free.
ja: その他のケースでは、無料でBackend.AIサーバーを利用できます。
ko: 그 외의 경우에는 Backend.AI 서버를 무료로 사용할 수 있습니다.
th: ในกรณีอื่น ๆ คุณสามารถใช้เซิร์ฟเวอร์ Backend.AI ได้ฟรี

source: **Interpretation Example**
ja: **解釈例**
ko: **해석 예시**
th: **ตัวอย่างการตีความ**

source: If you distribute Backend.AI server with modifications to outside the organization, you must disclose the code and apply LGPL the same way. There is no obligation to disclose the code if it is olny used internally.
ja: Backend.AIサーバーを組織外に修正して配布する場合、コードを公開し、同じ方法でLGPLを適用する必要があります。内部でのみ使用する場合、コードを公開する義務はありません。
ko: Backend.AI 서버를 변경하여 조직 외부로 배포한다면 코드를 공개하고 반드시 LGPL을 똑같이 적용해야 합니다. 조직 내부적으로만 사용한다면 코드를 공개할 의무가 없습니다.
th: หากคุณกระจายเซิร์ฟเวอร์ Backend.AI ที่มีการปรับเปลี่ยนไปยังภายนอกองค์กร คุณต้องเปิดเผยโค้ดและใช้ LGPL ในลักษณะเดียวกัน ไม่มีข้อผูกพันในการเปิดเผยโค้ดหากใช้ภายในองค์กรเท่านั้น

source: When distributing software that uses Backend.AI server as an essential library,
ja: Backend.AIサーバーを主要なライブラリとして使用するソフトウェアを配布する際には、
ko: Backend.AI 서버를 필수 라이브러리로 사용한 소프트웨어를
th: เมื่อมีการจัดจำหน่ายซอฟต์แวร์ที่ใช้เซิร์ฟเวอร์ Backend.AI เป็นห้องสมุดที่จำเป็น

source: Free distribution: The software does not have to be (L)GPL, and a separate contract with Lablup is not required.
ja: 無償配布: ソフトウェアは (L)GPL である必要はなく、Lablup との別途契約も必要ありません。
ko: 무료 배포하는 경우: 해당 소프트웨어는 (L)GPL이 아니어도 되고, 래블업과의 별도 계약도 필요하지 않습니다.
th: การแจกจ่ายฟรี: ซอฟต์แวร์ไม่จำเป็นต้องเป็น (L)GPL และไม่ต้องมีสัญญาแยกต่างหากกับ Lablup

source: Paid distribution: The software does not need to be (L)GPL, but a commercial contract with Lablup is required.
ja: 有料配布: ソフトウェアは (L)GPL である必要はありませんが、Lablup と商業契約が必要です。
ko: 유료 배포하는 경우: 해당 소프트웨어는 (L)GPL이 아니어도 되지만, 래블업과의 상용 계약이 필요합니다.
th: การแจกจ่ายแบบชำระเงิน: ซอฟต์แวร์ไม่จำเป็นต้องเป็น (L)GPL แต่จำเป็นต้องมีสัญญาการค้าที่ระหว่าง Lablup

source: When Backend.AI server is installed on the hardware and it is used by the public through network,
ja: Backend.AIサーバーがハードウェアにインストールされ、ネットワークを通じて一般に使用される場合、
ko: Backend.AI 서버를 하드웨어에 설치하여 일반 공중이 네트워크를 통해 사용하는 경우.
th: เมื่อเซิร์ฟเวอร์ Backend.AI ถูกติดตั้งบนฮาร์ดแวร์และมีการใช้งานโดยสาธารณะผ่านเครือข่าย

source: Free distribution: No separate contract with Lablup is required.
ja: 無料配布: Lablupとの別途契約は必要ありません。
ko: 무료로 사용하게 하는 경우: 래블업과의 별도 계약이 필요하지 않습니다.
th: การแจกจ่ายฟรี: ไม่จำเป็นต้องมีสัญญาแยกต่างหากกับ Lablup

source: Paid distribution: A commercial contract with Lablup is required.
ja: 有料配布: Lablupとの商業契約が必要です。
ko: 유료로 사용하게 하는 경우: 래블업과의 상용 계약이 필요합니다.
th: การจัดจำหน่ายที่ต้องชำระเงิน: จำเป็นต้องมีสัญญาพาณิชย์กับ Lablup

source: When distributing hardware in which Backend.AI server is installed,
ja: Backend.AIサーバーがインストールされているハードウェアを配布する際に、
ko: Backend.AI 서버가 설치된 하드웨어를 배포하는 경우,
th: เมื่อกระจายฮาร์ดแวร์ที่ติดตั้ง Backend.AI เซิร์ฟเวอร์อยู่

source: Commercial contracts include monthly / annual subscription fees for the enterprise version by default, but details may vary depending on individual contracts.
ja: 商業契約には、デフォルトでエンタープライズ版の月額／年額サブスクリプション料金が含まれていますが、詳細は個々の契約によって異なる場合があります。
th: สัญญาการค้าที่รวมถึงค่าธรรมเนียมการสมัครสมาชิกรายเดือน / รายปีสำหรับเวอร์ชันองค์กรโดยค่าเริ่มต้น แต่รายละเอียดอาจแตกต่างกันไปขึ้นอยู่กับสัญญาเฉพาะบุคคล

source: Commercial contracts include monthly / annual subscription fees for the enterprise version by default, but details may vary depending on individual contracts. Users of the open-source version can also purchase maintenance and support plans separately.
ko: 상용 계약에는 기본적으로 엔터프라이즈 버전의 월간/연간 구독 사용료가 포함되지만, 개별 계약에 따라 세부 내용은 다를 수 있습니다. 오픈소스 무료 버전 사용자들도 유지보수 및 지원 플랜을 별도로 구입할 수 있습니다.
