Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/login/login.po
Languages: ja, ko, th

source: Signup and Login
ja: サインアップとログイン
ko: 가입 및 로그인
th: การลงทะเบียนและการเข้าสู่ระบบ

source: Signup
ja: サインアップ
ko: 가입
th: สมัครสมาชิก

source: When you launch the WebUI, login dialog appears. If you haven't signed up yet, press the SIGN UP button.
ja: WebUIを起動すると、ログインダイアログが表示されます。まだサインアップしていない場合は、[SIGN UP]ボタンを押してください。

source: Login dialog
ja: ログインダイアログ
th: กล่องโต้ตอบการเข้าสู่ระบบ

source: Enter the required information, read and agree to the Terms of Service / Privacy Policy, and click the SIGNUP button. Depending on your system settings, you may need to enter an invitation token to sign up. A verification email may be sent to verify that the email is yours. If the verification email is sent, you will need to read the email and click the link inside to pass verification before you can log in with your account.
ja: 必要な情報を入力し、利用規約/プライバシーポリシーを読み同意した上で、SIGNUPボタンをクリックしてください。システム設定によっては、サインアップに招待トークンを入力する必要がある場合があります。あなたのメールアドレスであることを確認するための確認メールが送信されることがあります。確認メールが送信された場合は、メールを読んで内部のリンクをクリックし、検証を通過した後にアカウントでログインする必要があります。
ko: 이메일과 사용자 이름, 비밀번호 등의 정보를 입력하고 약관과 개인정보보호정책을 읽고 동의한 뒤 SIGNUP 버튼을 클릭합니다. 시스템 설정에 따라 가입하기 위해 별도의 초대 토큰을 입력 해야할 수도 있습니다. 또한, 이메일이 본인의 것이 맞는지 검증하는 이메일이 전송될 수도 있 습니다. 검증 이메일이 전송되는 경우, 이메일을 읽고 확인 링크를 클릭해서 검증을 통과해야만 가입한 계정으로 로그인 할 수 있습니다.
th: กรอกข้อมูลที่จำเป็น อ่านและยอมรับข้อกำหนดในการให้บริการ / นโยบายความเป็นส่วนตัว และคลิกปุ่ม SIGNUP ขึ้นอยู่กับการตั้งค่าของระบบของคุณ อาจต้องกรอกโทเค็นการเชิญเพื่อสมัครสมาชิก อีเมลยืนยันอาจถูกส่งเพื่อยืนยันว่าอีเมลนั้นเป็นของคุณ หากมีการส่งอีเมลยืนยัน คุณจะต้องอ่านอีเมลและคลิกลิงก์ภายในเพื่อผ่านการตรวจสอบก่อนที่คุณจะสามารถเข้าสู่ระบบด้วยบัญชีของคุณได้

source: Signup dialog
ja: サインアップダイアログ
th: กล่องโต้ตอบลงทะเบียน

source: Depending on the server configuration and plugin settings, signing up by anonymous user may not be allowed. In that case, please contact administrator of your system.
ja: サーバーの構成およびプラグインの設定によっては、匿名ユーザーによるサインアップが許可されていない場合があります。その場合は、システムの管理者に連絡してください。
ko: 서버 설정이나 플러그인 설정에 따라 사용자에 의한 가입이 막혀있을 수 있습니다. 이 경우에는 시스템 관리자에게 문의 하십시오.
th: ขึ้นอยู่กับการตั้งค่าเซิร์ฟเวอร์และการตั้งค่าปลั๊กอิน อาจไม่อนุญาตให้ผู้ใช้ที่ไม่ระบุตัวตนลงทะเบียน ในกรณีนี้โปรดติดต่อผู้ดูแลระบบของระบบของคุณ

source: To prevent malicious users from guessing user's password, password should be longer than 8 characters with at least one alphabet(s), number(s), and special character(s).
ja: 悪意のあるユーザーがユーザーのパスワードを推測するのを防ぐために、パスワードは8文字以上で、少なくとも1つのアルファベット、数字、特殊文字を含むべきです。
ko: 악성 사용자가 다른 사용자의 비밀번호를 추측하기 어렵게 만들기 위해, 비밀번호는 8 자 이상, 알파벳/특수문자/숫자를 1 개 이상 포함해야 합니다.
th: เพื่อป้องกันไม่ให้ผู้ใช้ที่ไม่หวังดีเดารหัสผ่านของผู้ใช้ รหัสผ่านควรมีความยาวมากกว่า 8 ตัวอักษร และมีอักขระหนึ่งตัวขึ้นไปที่เป็นตัวอักษร, ตัวเลข, และอักขระพิเศษ

source: Login
ja: ログイン
ko: 로그인
th: เข้าสู่ระบบ

source: Enter your ID and password and press the LOGIN button. In API ENDPOINT, the URL of Backend.AI Webserver, which relays the request to the Manager, should be entered.
ja: IDとパスワードを入力し、LOGINボタンを押してください。API ENDPOINTには、リクエストをマネージャーに中継するBackend.AI WebserverのURLを入力する必要があります。
ko: ID와 암호를 입력하고 LOGIN 버튼을 눌러주세요. ENDPOINT에는 Manager로의 연결을 중계하는 Backend.AI Webserver가 작동하고 있는 URL을 넣어주시면 됩니다.

source: Depending on the installation and setup environment of the Webserver, the endpoint might be pinned and not configurable.
ja: Webサーバーのインストールおよびセットアップ環境によっては、エンドポイントが固定されており、構成ができない場合があります。
ko: Webserver의 설치 및 설정 환경에 따라, Endpoint가 고정되어 있을 수 있습니다.
th: ขึ้นอยู่กับการติดตั้งและสภาพแวดล้อมการตั้งค่าของ Webserver อาจมีการกำหนดสถานะของ endpoint และไม่สามารถปรับแต่งได้

source: Backend.AI keeps the user's password securely through a one-way hash. BCrypt, the default password hash of BSD, is used, so even the server admins cannot know the user's password.
ja: Backend.AI は、ユーザーのパスワードを一方向ハッシュを通じて安全に保持します。BSDのデフォルトパスワードハッシュであるBCryptが使用されるため、サーバーの管理者でもユーザーのパスワードを知ることはできません。
ko: Backend.AI 는 사용자의 비밀번호를 단방향 해시를 통해 안전하게 보관하고 있습니다. BSD 의 기본 암호 해시인 BCrypt 를 사용하고 있어, 서버 관리자도 사용자의 비밀번호를 알 수 없습니다.

source: After login, you can check the information of the current resource usage in the Summary tab.
ja: ログイン後、[概要]タブで現在のリソース使用状況を確認できます。
ko: 로그인이 완료되면 Summary 탭에서 현재 사용하고 있는 자원량 등의 정보를 확인할 수 있습니다.
th: หลังจากล็อกอิน คุณสามารถตรวจสอบข้อมูลการใช้งานทรัพยากรในป้ายย่อสรุป

source: By clicking the icon in the upper-right corner, you will see sub menus. You can logout by selecting the Log Out menu.
ja: 右上のアイコンをクリックすると、サブメニューが表示されます。ログアウトメニューを選択するとログアウトできます。
ko: 우측 상단의 아이콘을 클릭하면 하위 메뉴가 나옵니다. Log Out 버튼을 클릭해서 로그아웃 할 수 있습니다. 또한 LogOut 이 쓰여진 곳의 아이콘을 클릭해서 로그아웃 할 수도 있습니다.
th: โดยการคลิกที่ไอคอนในมุมขวาบน คุณจะเห็นเมนูย่อย คุณสามารถออกจากระบบได้โดยการเลือกเมนูออกจากระบบ

source: Signout button
ja: サインアウトボタン
th: ปุ่มออกจากระบบ

source: When you forgot your password
ja: パスワードを忘れた場合
ko: 비밀번호를 잊어버렸을 경우
th: เมื่อคุณลืมรหัสผ่านของคุณ

source: If you have forgotten your password, you can click the CHANGE PASSWORD button on the login panel to email a link to change password. You can change your password by reading and following the instruction. Depending on the server settings, the password change feature may be disabled. In this case, contact the administrator.
ja: パスワードを忘れた場合は、ログインパネルで「パスワードを変更する」ボタンをクリックして、パスワードを変更するためのリンクをメールで送信できます。指示を読んで従うことで、パスワードを変更できます。サーバー設定によっては、パスワード変更機能が無効になっている場合があります。その場合は、管理者に連絡してください。
ko: 비밀번호를 잊어버렸을 경우, 로그인 패널의 CHANGE PASSWORD 버튼을 클릭하여 비밀번호 변경 링크를 이메일로 전송할 수 있습니다. 이메일을 읽고 지시대로 따라하면 비밀번호를 변경할 수 있습니다. 서버 설정에 따라 비밀번호 변경 기능이 비활성화 되어있을 수 있습니다. 이 경우에는 관리자에게 문의 하십시오.
th: หากคุณลืมรหัสผ่าน คุณสามารถคลิกที่ปุ่มเปลี่ยนรหัสผ่านในแผงเข้าสู่ระบบเพื่อส่งอีเมลลิงก์สำหรับเปลี่ยนรหัสผ่าน คุณสามารถเปลี่ยนรหัสผ่านของคุณโดยการอ่านและปฏิบัติตามคำแนะนำ ขึ้นอยู่กับการตั้งค่าของเซิร์ฟเวอร์ ฟังก์ชันการเปลี่ยนรหัสผ่านอาจถูกปิด ในกรณีนี้ให้ติดต่อผู้ดูแลระบบ

source: This is also a modular feature, so changing password may not be possible in some systems.
ja: これはモジュール式の機能でもあるため、システムによってはパスワード変更ができない場合があります。
ko: 이 기능도 모듈화되어 있어 어떤 환경에서는 지원되지 않을 수 있습니다.
th: นี่เป็นฟีเจอร์แบบโมดูลาร์ ดังนั้นการเปลี่ยนรหัสผ่านอาจไม่เป็นไปได้ในบางระบบ

source: If login failure occures more than 10 times consecutively, access to the endpoint is temporarily restricted for 20 minutes for security reasons. If the access restriction continues on more than 20 minutes, please contact your system administrator.
ja: ログイン失敗が10回以上連続して発生した場合、セキュリティ上の理由から、エンドポイントへのアクセスが一時的に20分間制限されます。アクセス制限が20分以上続く場合は、システム管理者に連絡してください。
ko: 로그인 실패가 10 회 이상 발생하면 보안상의 이유로 로그인 시도가 20 분 간 제 한됩니다. 만약 20 분 후에도 로그인 제한이 계속 유지되는 경우에는 시스템 관리자에게 문의 하십시오.
th: หากเกิดความล้มเหลวในการเข้าสู่ระบบมากกว่า 10 ครั้งติดต่อกัน การเข้าถึงจุดสิ้นสุดจะถูกจำกัดชั่วคราวเป็นเวลา 20 นาทีเพื่อเหตุผลด้านความปลอดภัย หากการจำกัดการเข้าถึงยังคงมีอยู่เกิน 20 นาที โปรดติดต่อผู้ดูแลระบบของคุณ

source: Sidebar Menus
ja: サイドバーメニュー
ko: 사이드바의 메뉴
th: เมนูแถบด้านข้าง

source: Change the size of the sidebar via the buttons on the right side of the sidebar. Click it to significantly reduce the width of the sidebar, giving you a wider view of its contents. Clicking it again will return the sidebar to its original width.
ja: サイドバーの右側にあるボタンを使って、サイドバーのサイズを変更します。これをクリックすると、サイドバーの幅が大幅に減少し、内容をより広範囲に表示できます。もう一度クリックすると、サイドバーは元の幅に戻ります。
th: เปลี่ยนขนาดของแถบด้านข้างผ่านปุ่มที่ด้านขวาของแถบด้านข้าง คลิกที่มันเพื่อทำให้ความกว้างของแถบด้านข้างลดลงอย่างมาก ทำให้คุณมองเห็นเนื้อหาของมันได้กว้างขึ้น การคลิกอีกครั้งจะทำให้แถบด้านข้างกลับไปที่ความกว้างเดิม

source: Header Events
ja: ヘッダーイベント
th: หัวข้อเหตุการณ์

source: The bell shape button is the event notification button. Events that need to be recorded during WebUI operation are displayed here. When background tasks are running, such as creating a compute session, you can check the jobs here. When the background task is finished.
ja: ベル型のボタンは、イベント通知ボタンです。WebUIの操作中に記録する必要があるイベントがここに表示されます。コンピュートセッションの作成など、バックグラウンドタスクが実行されている場合、ここでジョブを確認できます。バックグラウンドタスクが終了したとき。

source: You can change the theme mode of the WebUI via the dark mode icon on the right side of the header.
ja: ヘッダーの右側にあるダークモードアイコンを使って、WebUIのテーマモードを変更できます。

source: There is a question mark icon at the lower right side of the header. Click this icon to access the web version of this guide document.
ja: ヘッダーの右下には、クエスチョンマークのアイコンがあります。このアイコンをクリックすると、このガイドドキュメントのウェブ版にアクセスできます。
th: มีไอคอนเครื่องหมายคำถามที่มุมขวาล่างของส่วนหัว คลิกที่ไอคอนนี้เพื่อเข้าถึงเอกสารคู่มือนี้ในเวอร์ชันเว็บ

source: When you launch the Web-UI, login dialog appears. If you haven't signed up yet, press the SIGN UP button.
ko: Web-UI를 실행하면 다음과 같은 로그인 대화창이 뜹니다. 아직 가입을 하지 않은 경우에는 SIGN UP 버튼을 눌러주세요.
th: เมื่อคุณเปิด Web-UI จะมีหน้าต่างเข้าสู่ระบบปรากฏขึ้น หากคุณยังไม่ได้สมัครสมาชิก ให้กดปุ่ม SIGN UP

source: Enter your ID and password and press the LOGIN button. In API ENDPOINT, the URL of GPU Platform Webserver, which relays the request to the Manager, should be entered.
th: ป้อนID และรหัสผ่านของคุณแล้วกดปุ่ม LOGIN ใน API ENDPOINT ควรป้อน URL ของ GPU Platform Webserver ซึ่งจะทำการส่งต่อคำขอไปยังผู้จัดการ

source: GPU Platform keeps the user's password securely through a one-way hash. BCrypt, the default password hash of BSD, is used, so even the server admins cannot know the user's password.
th: GPU Platform เก็บรหัสผ่านของผู้ใช้ไว้เป็นอย่างดีผ่านการแฮชแบบทางเดียว โดยใช้ BCrypt ซึ่งเป็นแฮชรหัสผ่านเริ่มต้นของ BSD ดังนั้นแม้แต่ผู้ดูแลเซิร์ฟเวอร์ก็ไม่สามารถทราบรหัสผ่านของผู้ใช้ได้

source: The bell shape button is the event notification button. Events that need to be recorded during Web-UI operation are displayed here. When background tasks are running, such as creating a compute session, you can check the jobs here. When the background task is finished.
th: ปุ่มรูปทรงกระดิ่งคือปุ่มการแจ้งเตือนเหตุการณ์ เหตุการณ์ที่ต้องบันทึกในระหว่างการทำงานของ Web-UI จะแสดงที่นี่ เมื่อมีการทำงานในพื้นหลัง เช่น การสร้างเซสชันการคำนวณ คุณสามารถตรวจสอบงานที่นี่ได้ เมื่อการทำงานในพื้นหลังเสร็จสิ้น

source: You can change the theme mode of the Web-UI via the dark mode icon on the right side of the header.
th: คุณสามารถเปลี่ยนโหมดธีมของ Web-UI ผ่านไอคอนโหมดมืดที่ด้านขวาของส่วนหัว

source: There are three buttons at the top of the left sidebar.
ko: 좌측 사이드바의 위쪽에는 세 가지 버튼이 위치하고 있습니다.

source: The leftmost button changes the size of the sidebar. Click to make the sidebar narrower. Click again to bring the sidebar back to its original width.
ko: 가장 왼쪽의 버튼은 사이드바의 크기를 변경합니다. 클릭하면 사이드바의 폭이 크게 줄어들면서 내용을 보다 넓게 볼 수 있습니다. 다시 한 번 클릭하면 사이드바의 폭이 다시 원래대로 돌아옵 니다.

source: The middle button is the event notification button. Events that need to be recorded during Web-UI operation are displayed here.
ko: 중간의 버튼은 이벤트 알림 버튼입니다. Web-UI 동작 중 기록해둘 필요가 있는 이벤트 내역이 여기에 표시 됩니다.

source: The rightmost button is the background task button. When background tasks are running, such as creating a compute session, you can check the jobs here. When the background task is finished, it usually disappears as well.
ko: 가장 우측의 버튼은 백그라운드 작업 버튼입니다. 연산 세션을 생성 중에 있는 등 백그라운드 작업이 돌아가고 있을 때 여기에서 그 내역을 확인할 수 있습니다. 백그라운드 작업이 끝나면 보통 그 내역도 함께 사라집니다.

source: There is a question mark icon at the lower left corner of the sidebar. Click this icon to access the web version of this guide document.
ko: 사이드바 좌측 하단부를 보면 물음표 아이콘이 있습니다. 이 아이콘을 클릭하면 본 가이드 문서의 웹 버전에 접속할 수 있습니다.
