Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/overview/overview.po
Languages: ja, th

source: Overview
ja: 概要
th: ภาพรวม

source: Backend.AI is an open source cloud resource management platform, which makes it easy to utilize virtualized compute resource clusters in a cloud or on-premises environment. The container-based GPU virtualization technology of Backend.AI supports the efficient use of GPUs by flexibly dividing one physical GPU, so that multiple users can use it at the same time.
ja: Backend.AIは、オープンソースのクラウドリソース管理プラットフォームであり、クラウドやオンプレミス環境で仮想化されたコンピュートリソースクラスターを簡単に利用できるようにします。Backend.AIのコンテナベースのGPU仮想化技術は、1つの物理GPUを柔軟に分割し、複数のユーザーが同時に使用できるようにすることで、GPUの効率的な利用をサポートします。
th: Backend.AI เป็นแพลตฟอร์มจัดการทรัพยากรคลาวด์ที่เป็นโอเพ่นซอร์ส ซึ่งทำให้การใช้คลัสเตอร์ทรัพยากรการคำนวณที่เสมือนจริงในสภาพแวดล้อมคลาวด์หรือในสถานที่ทำได้ง่าย เทคโนโลยีการสร้างเสมือน GPU ที่ใช้คอนเทนเนอร์ของ Backend.AI สนับสนุนการใช้ GPU อย่างมีประสิทธิภาพโดยการแบ่ง GPU ทางกายภาพหนึ่งตัวอย่างยืดหยุ่น เพื่อให้ผู้ใช้หลายคนสามารถใช้ร่วมกันได้ในเวลาเดียวกัน

source: Backend.AI offers a variety of performance-driven optimizations for machine learning and high-performance computing clusters, along with management and research features to support a diverse users, including researchers, administrators, and DevOps. The Enterprise Edition adds support for multi-domain management, a dedicated Control-Panel for superadmins, and the GPU virtualization plug-in.
ja: Backend.AIは、研究者、管理者、DevOpsを含む多様なユーザーをサポートするために、機械学習および高性能コンピューティングクラスターのためのさまざまなパフォーマンス駆動の最適化と、管理および研究機能を提供します。Enterprise Editionでは、マルチドメイン管理のサポート、スーパ管理者専用のコントロールパネル、GPU仮想化プラグインが追加されます。
th: Backend.AI มีการปรับแต่งที่มุ่งเน้นประสิทธิภาพหลายประเภทสำหรับการเรียนรู้ของเครื่องและคลัสเตอร์การประมวลผลที่มีประสิทธิภาพสูง พร้อมด้วยฟีเจอร์การจัดการและการวิจัยเพื่อตอบสนองผู้ใช้ที่หลากหลาย รวมถึงนักวิจัย ผู้ดูแลระบบ และ DevOps รุ่น Enterprise Edition เพิ่มการสนับสนุนการจัดการหลายโดเมน แผงควบคุมที่เฉพาะสำหรับซูเปอร์แอดมิน และปลั๊กอินการจำลองเสมือน GPU

source: A GUI client package is provided to easily take advantage of the features supported by the Backend.AI server. Backend.AI Web-UI is a GUI client in the form of a web service or stand-alone app. It provides a convenient graphical interface for accessing the Backend.AI server to utilize computing resources and manage its environment. Backend.AI provides pre-made images which enable immediate creation of compute sessions without any need of installing separate programs. Most tasks can be done with mouse clicks and brief typing, which achieves more intuitive use.
ja: GUIクライアントパッケージは、Backend.AIサーバーがサポートする機能を簡単に利用するために提供されています。Backend.AI Web-UIは、ウェブサービスまたはスタンドアローンアプリの形をしたGUIクライアントです。計算リソースを利用し、その環境を管理するために、Backend.AIサーバーにアクセスする便利なグラフィカルインターフェースを提供します。Backend.AIはあらかじめ作成されたイメージを提供し、別々のプログラムをインストールすることなく、即座にコンピュートセッションを作成できます。ほとんどのタスクはマウスクリックと簡単な入力で行うことができ、より直感的な使用を実現します。
th: แพ็คเกจไคลเอนต์ GUI ถูกจัดเตรียมไว้เพื่อให้สามารถใช้ประโยชน์จากฟีเจอร์ที่สนับสนุนโดยเซิร์ฟเวอร์ Backend.AI ได้อย่างง่ายดาย Backend.AI Web-UI เป็นไคลเอนต์ GUI ในรูปแบบของบริการเว็บหรือแอปพลิเคชันที่ยืนอยู่คนเดียว มันให้ส่วนติดต่อกราฟิกที่สะดวกสำหรับการเข้าถึงเซิร์ฟเวอร์ Backend.AI เพื่อใช้ทรัพยากรการคอมพิวเตอร์และจัดการกับสภาพแวดล้อมของมัน Backend.AI มีภาพที่ทำไว้ล่วงหน้าซึ่งช่วยให้สามารถสร้างเซสชันการคอมพิวเตอร์ได้ทันทีโดยไม่ต้องติดตั้งโปรแกรมแยกต่างหาก งานส่วนใหญ่สามารถทำได้ด้วยการคลิกเมาส์และการพิมพ์สั้น ๆ ซึ่งช่วยให้การใช้งานเป็นไปอย่างชาญฉลาดมากขึ้น

source: Key Concepts
ja: キーコンセプト
th: แนวคิดหลัก

source: Diagram explaining key concepts
ja: キーコンセプトを説明する図
th: แผนภาพที่อธิบายแนวคิดสำคัญ

source: User: The user is a person who connects to Backend.AI and performs work. Users are divided into normal users, domain admins, and superadmins according to their privileges. While ordinary users can only perform tasks related to their computing sessions, domain admins have the authority to perform tasks within a domain, and superadmins perform almost all tasks throughout the system. A user belongs to one domain and can belong to multiple projects within a domain.
ja: ユーザー: ユーザーはBackend.AIに接続して作業を行う人物です。ユーザーは権限に応じて、通常のユーザー、ドメイン管理者、およびスーパー管理者に分かれます。通常のユーザーはコンピューティングセッションに関連するタスクのみを実行できますが、ドメイン管理者はドメイン内でタスクを実行する権限があります。スーパー管理者はシステム全体にわたってほぼすべてのタスクを実行します。ユーザーは1つのドメインに所属し、ドメイン内の複数のプロジェクトに所属することができます。
th: ผู้ใช้: ผู้ใช้คือบุคคลที่เชื่อมต่อกับ Backend.AI และทำงาน ผู้ใช้จะถูกแบ่งออกเป็นผู้ใช้ทั่วไป, ผู้ดูแลโดเมน และผู้ดูแลระบบซุปเปอร์ตามสิทธิ์ของพวกเขา ในขณะที่ผู้ใช้ทั่วไปสามารถทำงานที่เกี่ยวข้องกับเซสชันการคอมพิวเตอร์ของตนได้เท่านั้น ผู้ดูแลโดเมนมีอำนาจในการทำงานภายในโดเมน และผู้ดูแลระบบซุปเปอร์สามารถทำงานเกือบทั้งหมดทั่วทั้งระบบ ผู้ใช้จะต้องเป็นสมาชิกของโดเมนหนึ่งและสามารถเป็นสมาชิกของโครงการหลายโครงการภายในโดเมนได้

source: Compute session, container: An isolated virtual environment in which your code runs. It looks like a real Linux server with full user rights, and you can't see other user's session even if it's running on the same server as your session. Backend.AI implements this virtual environment through a technology called containers. You can only create compute sessions within the domain and projects to which you belong.
ja: 計算セッション、コンテナ: あなたのコードが実行される、隔離された仮想環境です。これは、完全なユーザー権限を持つ実際のLinuxサーバーのように見え、たとえあなたのセッションと同じサーバー上で実行されていても、他のユーザーのセッションを見ることはできません。Backend.AIはこの仮想環境をコンテナと呼ばれる技術を通じて実装しています。あなたが作成できる計算セッションは、所属するドメインおよびプロジェクト内に限られます。
th: เซสชันการประมวลผล, คอนเทนเนอร์: สภาพแวดล้อมเสมือนที่แยกออก ซึ่งโค้ดของคุณทำงานอยู่ มันมีลักษณะเหมือนเซิร์ฟเวอร์ Linux จริงที่มีสิทธิ์ผู้ใช้ทั้งหมด และคุณไม่สามารถเห็นเซสชันของผู้ใช้อื่น แม้ว่ามันจะทำงานอยู่บนเซิร์ฟเวอร์เดียวกันกับเซสชันของคุณ Backend.AI ใช้เทคโนโลยีที่เรียกว่าคอนเทนเนอร์เพื่อดำเนินการสร้างสภาพแวดล้อมเสมือนนี้ คุณสามารถสร้างเซสชันการประมวลผลได้เฉพาะในโดเมนและโครงการที่คุณเป็นสมาชิกเท่านั้น

source: Domain: This is the top layer for authority and resource control supported by Backend.AI. For companies or organizations, you can view domains as an affiliate and set up per-domain (or per-affiliate) permissions and resource policies. Users should belong to only one domain, and can create sessions or do some other jobs only in their own domain. A domain can have one domain admin or more, who can set policies within the domain or manage sessions. For example, if you set the total amount of resources available in a domain, the resources of all containers created by users in the domain cannot be greater than the amount set.
ja: ドメイン: これはBackend.AIがサポートする権限とリソース管理の最上位レイヤーです。企業や組織において、ドメインを系列会社として見なし、各ドメイン（または系列会社）ごとに権限とリソースポリシーを設定することができます。ユーザーは一つのドメインにのみ所属するべきであり、自分のドメイン内でのみセッションを作成したり、他の作業を行ったりすることができます。ドメインには1人以上のドメイン管理者が存在し、ドメイン内でポリシーを設定したり、セッションを管理したりすることができます。たとえば、ドメインで利用可能なリソースの総量を設定した場合、ドメイン内のユーザーによって作成されるすべてのコンテナのリソースは設定された量を超えることはできません。
th: โดเมน: นี่คือชั้นบนสุดสำหรับการควบคุมอำนาจและทรัพยากรที่มีการสนับสนุนโดย Backend.AI สำหรับบริษัทหรือองค์กร คุณสามารถมองว่าโดเมนเป็นพันธมิตรและตั้งค่าการอนุญาตและนโยบายทรัพยากรต่อโดเมน (หรือแต่ละพันธมิตร) ผู้ใช้ควรอยู่ในโดเมนเพียงหนึ่งเดียว และสามารถสร้างเซสชันหรือทำงานอื่น ๆ ได้เฉพาะในโดเมนของตนเอง โดเมนสามารถมีผู้ดูแลระบบโดเมนหนึ่งคนหรือมากกว่า ซึ่งสามารถตั้งค้านโยบายภายในโดเมนหรือจัดการเซสชันได้ ตัวอย่างเช่น หากคุณตั้งจำนวนทรัพยากรทั้งหมดที่พร้อมใช้งานในโดเมน ทรัพยากรของทุกคอนเทนเนอร์ที่สร้างโดยผู้ใช้ในโดเมนจะต้องไม่มากกว่าจำนวนที่ตั้งไว้

source: Projects: A hierarchy belonging to a domain. Multiple projects can exist in one domain. You can think of a project as a project working unit. A user can belong to multiple projects at the same time within a domain. Compute sessions must belong to one project, and users can only create sessions within their own projects. Domain admins can set policies or manage sessions for projects within the domain. For example, if you set the total amount of resources available within a project, the resources in all containers created by users in the project cannot be greater than the amount set.
ja: プロジェクト: ドメインに属する階層構造。一つのドメインには複数のプロジェクトが存在できます。プロジェクトを作業単位として考えることができます。ユーザーは一つのドメイン内で複数のプロジェクトに同時に所属することができます。コンピュートセッションは一つのプロジェクトに属し、ユーザーは自分の所属するプロジェクト内でのみセッションを作成できます。ドメイン管理者はドメイン内のプロジェクトに対してポリシーを設定したり、セッションを管理したりすることができます。例えば、プロジェクト内で利用可能なリソースの総量を設定した場合、プロジェクト内のユーザーによって作成されたすべてのコンテナのリソースは、設定された量を超えることはできません。
th: โครงการ: ลำดับชั้นที่เป็นของโดเมน ซึ่งมีโครงการหลายโครงการในโดเมนเดียว คุณสามารถคิดว่าโครงการเป็นหน่วยการทำงานของโครงการ ผู้ใช้สามารถเป็นสมาชิกของโครงการหลายโครงการในเวลาเดียวกันภายในโดเมน เซสชันการคอมพิวเตอร์ต้องเป็นของโครงการหนึ่งโครงการ และผู้ใช้สามารถสร้างเซสชันได้ภายในโครงการของตนเองเท่านั้น ผู้ดูแลระบบโดเมนสามารถตั้งนโยบายหรือจัดการเซสชันสำหรับโครงการภายในโดเมนได้ ตัวอย่างเช่น หากคุณตั้งจำนวนทรัพยากรทั้งหมดที่มีอยู่ภายในโครงการ ทรัพยากรในทุกคอนเทนเนอร์ที่สร้างโดยผู้ใช้ในโครงการจะต้องไม่เกินจำนวนที่ตั้งไว้

source: Image: Each container has a pre-installed language-specific runtime and various computational frameworks. The state of such snapshots before they are executed is called an image. You can choose to run an image provided by the cluster admin or create your own image with the software you want to use and ask the admin to register it.
ja: イメージ: 各コンテナには、言語専用のランタイムとさまざまな計算フレームワークが事前にインストールされています。それらのスナップショットが実行される前の状態をイメージと呼びます。クラスタ管理者が提供するイメージを実行するか、自分が使用したいソフトウェアを搭載したイメージを作成して、管理者に登録を依頼することができます。
th: ภาพ: ทุกคอนเทนเนอร์มีการติดตั้งรันไทม์เฉพาะภาษาที่ติดตั้งล่วงหน้าและกรอบการคำนวณต่างๆ สถานะของภาพถ่ายดังกล่าวก่อนที่พวกเขาจะถูกเรียกใช้งานเรียกว่าภาพ คุณสามารถเลือกที่จะเรียกใช้ภาพที่ให้โดยผู้ดูแลคลัสเตอร์หรือสร้างภาพของคุณเองด้วยซอฟต์แวร์ที่คุณต้องการใช้และขอให้ผู้ดูแลลงทะเบียนมัน

source: Virtual Folder (vfolder): A "cloud" folder that is always accessible and mountable in a container on a per-user basis, regardless of which node the container runs on. After creating your own virtual folder, you can upload your own program code, data, etc. in advance and mount the folder when you run the compute session to read from and write to it as if it is on your local disk.
ja: バーチャルフォルダ（vfolder）：コンテナがどのノードで実行されているかに関わらず、常にアクセス可能でコンテナ内にマウント可能な「クラウド」フォルダ（ユーザごとに個別）。自分のバーチャルフォルダを作成した後、自分のプログラムコードやデータなどを事前にアップロードし、計算セッションを実行する際にフォルダをマウントして、あたかもローカルディスクであるかのように読み書きすることができます。
th: โฟลเดอร์เสมือน (vfolder): โฟลเดอร์ “คลาวด์” ที่สามารถเข้าถึงได้ตลอดเวลาและสามารถเชื่อมโยงในคอนเทนเนอร์ตามผู้ใช้รายบุคคล โดยไม่คำนึงถึงว่าโหนดใดที่คอนเทนเนอร์ทำงานอยู่ หลังจากสร้างโฟลเดอร์เสมือนของคุณเองแล้ว คุณสามารถอัปโหลดโค้ดโปรแกรม ข้อมูล ฯลฯ ของคุณล่วงหน้า และเชื่อมโยงโฟลเดอร์เมื่อคุณเรียกใช้เซสชันการคำนวณเพื่ออ่านเขียนได้เหมือนกับที่อยู่ในดิสก์ท้องถิ่นของคุณ

source: Application service, service port: A feature that allows you to access various user applications (eg DIGITS, Jupyter Notebook, shell terminal, TensorBoard, etc.) running within the compute session. You do not need to know the container's address and port number directly, but you can use the provided CLI client or GUI Web-UI to directly access the desired daemon of the session.
ja: アプリケーションサービス、サービスポート: コンピュートセッション内で実行されているさまざまなユーザーアプリケーション（例: DIGITS、Jupyter Notebook、シェルターミナル、TensorBoardなど）にアクセスする機能です。コンテナのアドレスやポート番号を直接知る必要はなく、提供されたCLIクライアントまたはGUI Web-UIを使用して、セッションの目的のデーモンに直接アクセスできます。
th: บริการแอพพลิเคชั่น, พอร์ตบริการ: ฟีเจอร์ที่ช่วยให้คุณเข้าถึงแอพพลิเคชั่นของผู้ใช้ที่หลากหลาย (เช่น DIGITS, Jupyter Notebook, shell terminal, TensorBoard, ฯลฯ) ที่ทำงานภายในเซสชันการคำนวณ คุณไม่จำเป็นต้องรู้ที่อยู่ของคอนเทนเนอร์และหมายเลขพอร์ตโดยตรง แต่คุณสามารถใช้ CLI client หรือ GUI Web-UI ที่ให้มาเพื่อเข้าถึงเดมอนที่ต้องการของเซสชันโดยตรง

source: Web-UI: A GUI client that is served as a web or stand-alone app. You can use the service after logging in by specifying the address of the Backend.AI server and entering the user account information.
ja: Web-UI: Webまたはスタンドアロンアプリとして提供されるGUIクライアントです。Backend.AIサーバーのアドレスを指定し、ユーザーアカウント情報を入力してログインすることでサービスを利用できます。
th: Web-UI: โปรแกรมคล้าย GUI ที่ให้บริการเป็นเว็บหรือแอปพลิเคชันแบบสแตนด์อโลน คุณสามารถใช้บริการได้หลังจากเข้าสู่ระบบโดยระบุที่อยู่ของเซิร์ฟเวอร์ Backend.AI และกรอกข้อมูลบัญชีผู้ใช้

source: Local wsproxy: Proxy server built into the Web-UI app. Local wsproxy converts general HTTP requests between the server and Web-UI app to websocket and delivers the messages. If the Web-UI app loses its connection to wsproxy or the wsproxy server is dead, it will not be possible to access services such as Jupyter Notebook and Terminal.
ja: ローカル wsproxy: Web-UI アプリに組み込まれたプロキシサーバー。ローカル wsproxy は、サーバーと Web-UI アプリ間の一般的な HTTP リクエストを WebSocket に変換し、メッセージを送信します。Web-UI アプリが wsproxy への接続を失うか、wsproxy サーバーが停止すると、Jupyter Notebook やターミナルなどのサービスにアクセスすることはできません。
th: wsproxy ท้องถิ่น: เซิร์ฟเวอร์พร็อกซีที่สร้างขึ้นในแอป Web-UI. wsproxy ท้องถิ่นจะแปลงคำขอ HTTP ทั่วไประหว่างเซิร์ฟเวอร์กับแอป Web-UI เป็น websocket และส่งข้อความไปยังกันและกัน หากแอป Web-UI สูญเสียการเชื่อมต่อกับ wsproxy หรือเซิร์ฟเวอร์ wsproxy หยุดทำงาน จะไม่สามารถเข้าถึงบริการต่างๆ เช่น Jupyter Notebook และ Terminal ได้.

source: Web wsproxy: In the case of the Web-UI provided in a web, the built-in server cannot be used due to the nature of the browser. In this case, you can use services such as Jupyter Notebook, Terminal, etc. in the web environment by making the wsproxy server as a separate web server so that the Web-UI app can see the web wsproxy.
ja: Web wsproxy: Web上で提供されるWeb-UIの場合、ブラウザの特性上、組み込みサーバーを使用することはできません。この場合、wsproxyサーバーを別のWebサーバーとして設定し、Web-UIアプリがWeb wsproxyを参照できるようにすることで、Jupyter NotebookやターミナルなどのサービスをWeb環境で使用できます。
th: Web wsproxy: ในกรณีของ Web-UI ที่จัดเตรียมไว้ในเว็บ เซิร์ฟเวอร์ที่ติดตั้งมายังไม่สามารถใช้งานได้เนื่องจากธรรมชาติของเบราว์เซอร์ ในกรณีนี้ คุณสามารถใช้บริการต่าง ๆ เช่น Jupyter Notebook, Terminal, ฯลฯ ในสภาพแวดล้อมเว็บโดยการทำให้เซิร์ฟเวอร์ wsproxy เป็นเซิร์ฟเวอร์เว็บแยกที่สามารถทำให้แอป Web-UI มองเห็นเว็บ wsproxy ได้

source: Backend.AI feature details
ja: Backend.AI 機能の詳細
th: รายละเอียดฟีเจอร์ของ Backend.AI

source: Category
ja: カテゴリー
th: หมวดหมู่

source: Feature
ja: 機能
th: คุณสมบัติ

source: NVIDIA support
ja: NVIDIAサポート
th: การสนับสนุน NVIDIA

source: Container-level multi GPU
ja: コンテナー・レベルのマルチGPU
th: มัลติ GPU ระดับคอนเทนเนอร์

source: (Enterprise) Fractional GPU sharing & scaling
ja: (エンタープライズ) フラクショナルGPUの共有とスケーリング
th: (องค์กร) การแชร์และขยาย GPU แบบห fractional

source: Multiple CUDA library version support (8.0 to 12.2)
ja: 複数のCUDAライブラリバージョンのサポート（8.0から12.2）
th: การสนับสนุนหลายเวอร์ชันของไลบรารี CUDA (8.0 ถึง 12.2)

source: GPUDirect storage support
ja: GPUDirectストレージサポート
th: การสนับสนุน GPUDirect Storage

source: NGC (NVIDIA GPU Cloud) image integration
ja: NGC (NVIDIA GPU Cloud) イメージ統合
th: การรวมภาพ NGC (NVIDIA GPU Cloud)

source: GPU-GPU Network autoconfiguration
ja: GPU-GPUネットワーク自動構成
th: การตั้งค่าอัตโนมัติของเครือข่าย GPU-GPU

source: NPU Support
ja: NPUサポート
th: การสนับสนุน NPU

source: * Rebellions ATOM
th: * การกบฏ ATOM

source: Scaling
ja: スケーリング
th: การขยายขนาด

source: On-premise installation on both bare-metal / VM
ja: ベアメタル / VM のオンプレミスインストール
th: การติดตั้งในสถานที่บนเซิร์ฟเวอร์เปล่าหรือ VM

source: Hybrid cloud (on-premise + cloud)
ja: ハイブリッドクラウド（オンプレミス + クラウド）
th: ไฮบริดคลาวด์ (ภายในองค์กร + คลาวด์)

source: Polycloud (multi-cloud federation)
ja: ポリクラウド（マルチクラウドフェデレーション）
th: โพลีคลาวด์ (การรวมกลุ่มคลาวด์หลายแห่ง)

source: Scheduling
ja: スケジューリング
th: การตั้งเวลา

source: Unified scheduling & monitoring with GUI admin
ja: GUI管理を用いた統合スケジューリングとモニタリング
th: การจัดตารางเวลาและการติดตามที่รวมกันด้วย GUI admin

source: Per-user (keypair) resource policy
ja: ユーザーごと（キーペア）のリソースポリシー
th: นโยบายทรัพยากรแบบผู้ใช้งาน (คู่กุญแจ)

source: (Enterprise) Per-project resource policy
ja: (エンタープライズ) プロジェクトごとのリソースポリシー
th: นโยบายทรัพยากรต่อโครงการ (Enterprise)

source: Availability-slot based scheduling
ja: 利用可能スロットベースのスケジューリング
th: การจัดตารางเวลาตามช่องว่างในการให้บริการ

source: (Enterprise) Utilization based resource management
ja: (エンタープライズ) 利用率に基づくリソース管理
th: (องค์กร) การจัดการทรัพยากรตามการใช้งาน

source: Cluster partitioning
ja: クラスターのパーティショニング
th: การแบ่งกลุ่มคลัสเตอร์

source: Resource groups by H/W spec and usage
ja: H/W仕様と使用状況によるリソースグループ
th: กลุ่มทรัพยากรตามสเปค H/W และการใช้งาน

source: (Enterprise) Access control of users to
th: (องค์กร) การควบคุมการเข้าถึงของผู้ใช้ไปยัง

source: resource group
th: กลุ่มทรัพยากร

source: (Enterprise) Access control of project to
th: (Enterprise) การควบคุมการเข้าถึงโครงการไปยัง

source: Security
ja: セキュリティ
th: ความปลอดภัย

source: Sandboxing via hypervisor/container
ja: ハイパーバイザー/コンテナによるサンドボックス化
th: การสร้าง Sandbox ผ่าน hypervisor/container

source: Access logs for each user
ja: 各ユーザーのアクセスログ
th: บันทึกการเข้าถึงสำหรับแต่ละผู้ใช้

source: Per session (container) logs
ja: セッション（コンテナ）ごとのログ
th: บันทึกการใช้งานต่อเซสชัน (คอนเทนเนอร์)

source: GUI web interface
ja: GUIウェブインターフェース
th: อินเทอร์เฟซเว็บ GUI

source: (Enterprise) Admin GUI web interface
ja: (エンタープライズ) 管理者GUIウェブインターフェース
th: (Enterprise) อินเทอร์เฟซเว็บ GUI ของผู้ดูแลระบบ

source: (Enterprise) MLOps pipeline web interface
ja: (エンタープライズ) MLOps パイプライン Web インターフェース
th: (Enterprise) อินเตอร์เฟซเว็บ MLOps pipeline

source: Data management
ja: データ管理
th: การจัดการข้อมูล

source: EFS, NFS, SMB and distributed file system
th: EFS, NFS, SMB และระบบไฟล์ที่กระจาย

source: (CephFS, GlusterFS, HDFS, etc)
th: (CephFS, GlusterFS, HDFS, ฯลฯ)

source: (Enterprise) Storage solution integration:
ja: (エンタープライズ) ストレージソリューションの統合:
th: การรวมโซลูชันการจัดเก็บ (Enterprise):

source: * Weka.io
th: * วีกา.io

source: * Vast Data
th: * ข้อมูลขนาดใหญ่

source: Fine-grained Access control to data by user/project
ja: ユーザー/プロジェクトによるデータへの細かいアクセス制御
th: การควบคุมการเข้าถึงข้อมูลอย่างละเอียดตามผู้ใช้/โครงการ

source: Per user/project based storage quota managment*
ja: ユーザー/プロジェクト単位のストレージクォータ管理*
th: การจัดการโควต้าพื้นที่จัดเก็บข้อมูลตามผู้ใช้/โครงการ*

source: Developer support
ja: 開発者サポート
th: การสนับสนุนนักพัฒนา

source: Universal programming languages (Python, C/C++, etc)
ja: ユニバーサルプログラミング言語（Python、C/C++、など）
th: ภาษาการเขียนโปรแกรมทั่วไป (Python, C/C++, ฯลฯ)

source: Interactive web apps (Terminal, Jupyter, VSCode,
th: แอปเว็บแบบโต้ตอบ (เทอร์มินัล, จูปีเตอร์, VSCode,

source: MLFlow, Microsoft NNI, R Studio, etc)
th: MLFlow, Microsoft NNI, R Studio, ฯลฯ

source: Offering various type of computing sessions tailored
th: การให้บริการเซสชันการคอมพิวเตอร์ประเภทต่างๆ ที่ปรับแต่งตามความต้องการ

source: to specific purposes
th: เพื่อวัตถุประสงค์เฉพาะ

source: * Interactive
th: * โต้ตอบ

source: * Batch
th: * กลุ่ม

source: * Inference
th: * การอนุมาน

source: For data scientists
ja: データサイエンティスト向け
th: สำหรับนักวิทยาศาสตร์ข้อมูล

source: Concurrent user of multiple versions of libraries:
th: ผู้ใช้ที่ใช้หลายเวอร์ชันของไลบรารีพร้อมกัน:

source: Tensorflow, PyTorch, etc
th: เทนเซอร์ฟโลว์, ไพธอร์ช, ฯลฯ

source: Concurrent user of multiple versions of libraries
ja: 複数バージョンのライブラリの同時使用者
th: ผู้ใช้พร้อมกันของหลายเวอร์ชันของไลบรารี

source: Periodic update of ML libraries
ja: MLライブラリの定期的な更新
th: การอัปเดตห้องสมุด ML เป็นระยะ ๆ

source: Customer support
th: การสนับสนุนลูกค้า

source: (Enterprise)
th: (องค์กร)

source: On-site installation (bare-metal / VM)
ja: オンサイトインストール（ベアメタル / VM）
th: การติดตั้งในสถานที่ (bare-metal / VM)

source: Configuration support (on-premise + cloud)
ja: 設定サポート（オンプレミス + クラウド）
th: การสนับสนุนการกำหนดค่า (บน-premise + คลาวด์)

source: Admin/user training
ja: 管理者/ユーザー トレーニング
th: การฝึกอบรมผู้ดูแลระบบ/ผู้ใช้

source: Support for updating to latest version
ja: 最新バージョンへの更新サポート
th: การสนับสนุนสำหรับการอัปเดตเป็นเวอร์ชันล่าสุด

source: Priority development and escalation
ja: 優先開発とエスカレーション
th: การพัฒนาลำดับความสำคัญและการแก้ไขปัญหา

source: Customized container image / kernel or kernel
th: ภาพ контейเนอร์ที่ปรับแต่งหรือเคอร์เนลหรือเคอร์เนล

source: repository
th: ที่เก็บข้อมูล

source: ONLY Available on storage supports directory quota management
ja: ディレクトリクォータ管理をサポートするストレージでのみ利用可能
th: สามารถใช้ได้เฉพาะกับพื้นที่เก็บข้อมูลที่รองรับการจัดการโควตาไดเรกทอรีเท่านั้น

source: Accessible menu by user role
ja: ユーザーロールによるアクセス可能なメニュー
th: เมนูที่สามารถเข้าถึงได้ตามบทบาทผู้ใช้

source: Pages with ``*`` mark are in Administration menu.
ja: 「*」マークのあるページは管理メニューにあります。
th: หน้าที่มีเครื่องหมาย ``*`` อยู่ในเมนูการจัดการ

source: Features only for admin are listed in :ref:`admin menu <admin-menu>`.
ja: 管理者専用の機能は、:ref:`admin menu <admin-menu>` にリストされています。
th: ฟีเจอร์ที่มีเฉพาะสำหรับผู้ดูแลระบบจะถูกระบุไว้ใน :ref:`เมนูผู้ดูแลระบบ <admin-menu>`

source: page \\ role
ja: ページ \\ ロール
th: หน้า \\ บทบาท

source: user
ja: ユーザー
th: ผู้ใช้

source: admin
ja: 管理者
th: ผู้ดูแลระบบ

source: Summary
ja: サマリー
th: สรุป

source: Sessions
ja: セッション
th: เซสชัน

source: Serving
ja: サービス提供
th: การให้บริการ

source: Import & run
ja: インポート＆実行
th: นำเข้าและทำงาน

source: Data & Storage
ja: データとストレージ
th: ข้อมูลและการจัดเก็บ

source: Agent Summary
ja: エージェントサマリー
th: สรุปตัวแทน

source: Statistics
ja: 統計
th: สถิติ

source: Users*
ja: ユーザー*
th: ผู้ใช้*

source: Environments*
ja: *エンvironments
th: สภาพแวดล้อม*

source: Resources*
ja: リソース*
th: ทรัพยากร*

source: Configurations*
ja: 構成*
th: การกำหนดค่า*

source: Maintenance*
ja: メンテナンス*
th: การบำรุงรักษา*

source: Information*
ja: 情報*
th: ข้อมูล*

source: UserSettings
ja: ユーザー設定
th: การตั้งค่าผู้ใช้

source: Rebellions ATOM
ja: 反乱 ATOM

source: Hyperaccel LPU
ja: ハイパーアクセル LPU

source: (Enterprise) Access control of users to resource group
ja: (エンタープライズ) リソースグループへのユーザーアクセス制御

source: (Enterprise) Access control of project to resource group
ja: (エンタープライズ) リソースグループへのプロジェクトのアクセス制御

source: EFS, NFS, SMB and distributed file system (CephFS, GlusterFS, HDFS, etc)
ja: EFS、NFS、SMB、および分散ファイルシステム（CephFS、GlusterFS、HDFS など）

source: Dell EMC
ja: デルEMC

source: Vast Data
ja: 広大なデータ

source: Interactive web apps (Terminal, Jupyter, VSCode, MLFlow, Microsoft NNI, R Studio, etc)
ja: インタラクティブなウェブアプリ（Terminal、Jupyter、VSCode、MLFlow、Microsoft NNI、R Studio など）

source: Offering various type of computing sessions tailored to specific purposes
ja: 特定の目的に合わせて調整されたさまざまなタイプのコンピューティングセッションを提供

source: Interactive
ja: インタラクティブ

source: Batch
ja: バッチ

source: Inference
ja: 推論

source: Concurrent user of multiple versions of libraries: Tensorflow, PyTorch, etc
ja: ライブラリの複数バージョンを同時に使用するユーザー: Tensorflow、PyTorch など

source: Customer support (Enterprise)
ja: カスタマーサポート（エンタープライズ）

source: Customized container image / kernel or kernel repository
ja: カスタマイズされたコンテナイメージ / カーネルまたはカーネルリポジトリ
