Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/trouble_shooting/trouble_shooting.po
Languages: ja, ko, th

source: FAQs & Troubleshooting
ja: FAQとトラブルシューティング
ko: FAQ 및 문제 해결
th: คำถามที่พบบ่อย & การแก้ปัญหา

source: User troubleshooting guide
ja: ユーザートラブルシューティングガイド
ko: 사용자 문제 해결 가이드
th: คู่มือการแก้ปัญหาสำหรับผู้ใช้

source: Session list is not displayed correctly
ja: セッションリストが正しく表示されない
ko: 연산 세션 리스트가 나타나지 않습니다
th: รายการเซสชันแสดงไม่ถูกต้อง

source: Due to intermittent network problems and/or other various reasons, session list may not be displayed correctly. Most of the time, this problem will disappear just by refreshing the browser.
ja: 断続的なネットワークの問題やその他の様々な理由により、セッションリストが正しく表示されない場合があります。ほとんどの場合、この問題はブラウザをリフレッシュするだけで解消されます。
ko: 간헐적인 네트워크 문제나 기타 다양한 원인으로 인해 연산 세션 리스트가 정상적으로 표시되지 않을 수 있습니다. 대부분의 경우, 브라우저를 갱신하면 연산 세션이 정상적으로 보입니다.
th: เนื่องจากปัญหาเครือข่ายที่เกิดขึ้นเป็นระยะเวลาและ/หรือเหตุผลต่างๆ รายชื่อเซสชันอาจไม่แสดงอย่างถูกต้อง ในส่วนใหญ่ของเวลา ปัญหานี้จะหายไปเพียงแค่การรีเฟรชเบราว์เซอร์

source: Web-based Web-UI: Refresh the browser page (use the shortcut provided by browsers such as Ctrl-R). Since the browser's cache may cause troubles sometimes, it is recommended to refresh the page bypassing the cache (such as Shift-Ctrl-R, but the keys may differ in each browser).
ja: WebベースのWeb-UI: ブラウザのページをリフレッシュします (Ctrl-Rなど、ブラウザで提供されるショートカットを使用します)。ブラウザのキャッシュが問題を引き起こすことがあるため、キャッシュをバイパスしてページをリフレッシュすることをお勧めします (Shift-Ctrl-Rなど、ただしキーは各ブラウザによって異なる可能性があります)。
ko: 웹 기반 Web-UI: 브라우저 페이지를 갱신합니다(Ctrl-R 등 브라우저 별 제공하는 페이지 갱신 단축키 사용). 브라우저의 캐시가 쌓여 오동작 하는 경우도 있으므로 캐시를 사용하지 않고 페이지 갱신을 해보는 것도 좋습니다(Shift-Ctrl-R 등 브라우저 별 상이).
th: Web-based Web-UI: รีเฟรชหน้าเบราว์เซอร์ (ใช้ทางลัดที่เบราว์เซอร์จัดให้ เช่น Ctrl-R) เนื่องจากแคชของเบราว์เซอร์อาจทำให้เกิดปัญหาในบางครั้ง แนะนำให้รีเฟรชหน้าด้วยการข้ามแคช (เช่น Shift-Ctrl-R แต่คีย์อาจแตกต่างกันในแต่ละเบราว์เซอร์)

source: Web-UI App: Press Ctrl-R shortcut to refresh the app.
ja: Web-UIアプリ: アプリを更新するにはCtrl-Rショートカットを押してください。
ko: 앱 기반 설치형 Web-UI: Ctrl-R 단축키를 클릭하여 앱 페이지를 갱신할 수 있습니다.
th: Web-UI แอป: กดแป้น Ctrl-R เพื่อรีเฟรชแอป

source: Suddenly, I cannot login with my account
ja: 突然、自分のアカウントでログインできなくなりました
ko: 갑자기 로그인이 안 됩니다
th: ทันใดนั้น ฉันไม่สามารถเข้าสู่ระบบด้วยบัญชีของฉันได้

source: If there are problems in recognizing authentication cookies, users may not be able to login temporarily. Try to login with private browser window. If it succeeds, please clear your browser's cache and/or application data.
ja: 認証クッキーの認識に問題がある場合、ユーザーは一時的にログインできないことがあります。プライベートブラウザウィンドウを使用してログインしてみてください。もし成功した場合は、ブラウザのキャッシュおよび/またはアプリケーションデータをクリアしてください。
ko: 간혹 브라우저의 쿠키 문제 및 캐시된 데이터로 인해 로그인이 되지 않는 경우가 있습니다. 브라우저의 시크릿 모드에서 로그인을 시도 해보십시오. 만약 로그인이 된다면, 브라우저의 쿠키 및 애플리케이션 데이터를 삭제한 후 다시 로그인 해보시기 바랍니다.
th: หากมีปัญหาในการรับรู้คุกกี้การพิสูจน์ตัวตน ผู้ใช้อาจไม่สามารถเข้าสู่ระบบได้ชั่วคราว ลองเข้าสู่ระบบด้วยหน้าต่างเบราว์เซอร์ส่วนตัว หากเข้าสู่ระบบได้ กรุณาล้างแคชของเบราว์เซอร์และ/หรือข้อมูลแอปพลิเคชัน

source: How to install apt packages?
ja: aptパッケージのインストール方法?
ko: apt 패키지는 어떻게 설치하나요?
th: วิธีการติดตั้งแพ็กเกจ apt?

source: Inside a compute session, users cannot access root account and perform operations that require sudo privilege for security reasons. Therefore, it is not allowed to install packages with apt or yum since they require sudo. If it is really required, you can request to admins to allow sudo permission.
ko: 보안 문제로 연산 세션 내부에서 사용자는 root 계정으로 전환하거나 sudo 를 필요로 하는 명령 을 실행할 수 없습니다. 따라서, apt, yum 과 같이 sudo 권한을 요구하는 패키지 매니저를 통 해서는 일반적으로 설치가 어렵습니다. 반드시 필요한 경우라면, 관리자에에 sudo 권한을 허용해줄 것을 요청할 수 있습니다.

source: Alternatively, users may install packages by `brew <https://docs.brew.sh/Homebrew-on-Linux>`_. To install and use ``brew`` from the compute session, follow the commands below:
ko: 대신, `brew <https://docs.brew.sh/Homebrewon-Linux>`_ 등과 같은 패키지 매니저를 활용할 수 있습니다. ``brew`` 를 설치하고 사용하려면 다음 명령을 실행하십시오:

source: Now, you can install packages by ``brew``:
ko: 이제 ``brew`` 명령으로 패키지를 설치할 수 있습니다:

source: ``brew`` installs packages under ``~/.linuxbrew``. So, if you create a storage folder named ``.linuxbrew``, which will be automatically mounted when creating a compute session, those installed packages can be kept after compute session is destroyed and then reused for the next compute session.
ko: ``brew`` 는 패키지를 ``~/.linuxbrew`` 디렉토리 하위에 설치합니다. 따라서, ``.linuxbrew`` 이라는 스토리지 폴더를 생성해두면 연산 세션을 삭제하고 새로운 연산 세션을 생성하더라도 기존에 설치했던 패키지를 다시 사용할 수 있습니다. ``.`` 으로 시작하는 스토리지 폴더는 별도로 마운트 하지 않아도 자동으로 마운트 됩니다.

source: How to install packages with pip?
ja: pipでパッケージをインストールする方法
ko: pip 패키지를 설치하고 싶어요
th: วิธีติดตั้งแพ็คเกจด้วย pip คืออะไร?

source: By default, when you install a pip package, it will be installed under ``~/.local``. So, if you create a automount data folder named ``.local``, you can keep the installed packages after a compute session is destroyed, and then reus them for the next compute session. Just install the packages with pip like:
ja: デフォルトでは、pip パッケージをインストールすると ``~/.local`` にインストールされます。したがって、``.local`` という名前のオートマウントデータフォルダを作成すれば、計算セッションが破棄された後でもインストールされたパッケージを保持し、次の計算セッションで再利用できます。次のように pip でパッケージをインストールします。
ko: Pip 패키지를 설치하면 기본적으로 사용자의 ``~/.local`` 디렉토리에 저장됩니다. 따라서, ``.local`` 자동마운트 폴더를 생성해두면, 연산 세션이 종료되더라도 계속 패키지를 보관해두고 다음 세션에서 재사용 할 수 있습니다. 다음과 같이 패키지를 설치하면 됩니다.
th: โดยค่าเริ่มต้น เมื่อคุณติดตั้งแพ็คเกจ pip แพ็คเกจนั้นจะถูกติดตั้งภายใต้ ``~/.local`` ดังนั้น ถ้าคุณสร้างโฟลเดอร์ข้อมูลอัตโนมัติชื่อว่า ``.local`` คุณสามารถเก็บแพ็คเกจที่ติดตั้งแล้วหลังจากที่เซสชันการคำนวณถูกทำลาย และจากนั้นใช้มันอีกครั้งในเซสชันการคำนวณถัดไป แค่ติดตั้งแพ็คเกจด้วย pip เช่น:

source: I have created a compute session, but cannot launch Jupyter Notebook
ja: コンピュートセッションを作成しましたが、Jupyter Notebookを起動できません。
ko: 연산 세션을 생성했는데 Jupyter Notebook 을 열 수가 없습니다
th: ฉันได้สร้างเซสชันการคอมพิวเตอร์ แต่ไม่สามารถเปิด Jupyter Notebook ได้

source: If you installed a jupyter package with pip by yourself, it may be conflict with the jupyter package that a compute session provides by default. Especially, if you have created ``~/.local`` directory, the manually installed jupyter packages persists for every compute session. In this case, try to remove the ``.local`` automount folder and then try to launch Jupyter Notebook again.
ja: 自分で pip を使用して jupyter パッケージをインストールした場合、コンピュートセッションがデフォルトで提供する jupyter パッケージと競合する可能性があります。特に、``~/.local`` ディレクトリを作成した場合、手動でインストールした jupyter パッケージはすべてのコンピュートセッションで持続します。この場合、``.local`` 自動マウントフォルダーを削除し、再度 Jupyter Notebook を起動してみてください。
ko: Jupyter 패키지를 직접 설치한 경우, 연산 세션이 기본으로 제공하는 jupyter 패키지와 충돌할 가능성이 있습니다. 특히, ``~/.local`` 자동 마운트 폴더를 생성해서 사용하고 계시다면, 수동 설치한 jupyter 패키지가 모든 연산 세션에서 호환 문제를 일으킬 수 있습니다. 이 경우, ``.local`` 데이터 폴더를 삭제한 후 다시 Jupyter Notebook을 시작해보십시오.
th: หากคุณติดตั้งแพ็คเกจ jupyter ด้วย pip ด้วยตนเอง อาจเกิดความขัดแย้งกับแพ็คเกจ jupyter ที่เซสชันการคอมพิวเตอร์ให้มาโดยค่าเริ่มต้น โดยเฉพาะอย่างยิ่ง หากคุณได้สร้างไดเรกทอรี ``~/.local`` แพ็คเกจ jupyter ที่ติดตั้งด้วยตนเองจะคงอยู่สำหรับทุกเซสชันการคอมพิวเตอร์ ในกรณีนี้ ให้ลองลบโฟลเดอร์ automount ``.local`` และจากนั้นลองเปิด Jupyter Notebook อีกครั้ง

source: Page layout is broken
ja: ページのレイアウトが崩れている
ko: 페이지가 이상하게 표시됩니다
th: เลย์เอาต์ของหน้าเสียหาย

source: Backend.AI Web-UI utilizes the latest modern JavaScript and/or browser features. Please use the LATEST versions of moder browsers (such as Chrome).
ja: Backend.AI Web-UIは、最新のモダンJavaScriptおよび/またはブラウザ機能を利用しています。最新のモダンブラウザ（Chromeなど）を使用してください。
ko: Backend.AI Web-UI는 최신 JavaScript 와 브라우저의 기능을 적극 활용하고 있습니다. 가급적 최신 브라우저를 사용하십시오. 특히 Chrome 에서 가장 안정적인 레이아웃을 보입니다.

source: SFTP disconnection
ja: SFTP 切断
ko: SFTP 연결이 끊기는 경우
th: การตัดการเชื่อมต่อ SFTP

source: When Web-UI App launches SFTP connection, it uses a local proxy server which is embeded in the App. If you exit the Web-UI App during the file transfer with SFTP protocol, the transfer will immediately fail because the connection established through the local proxy server is disconnected. Therefore, even if you are not using a compute session, you should not quit the Web-UI App while using SFTP. If you need to refresh the page, we recommend using the Ctrl-R shortcut.
ja: Web-UIアプリがSFTP接続を起動するとき、それはアプリに埋め込まれたローカルプロキシサーバーを使用します。SFTPプロトコルによるファイル転送中にWeb-UIアプリを終了すると、ローカルプロキシサーバーを介して確立された接続が切断されるため、転送は即座に失敗します。このため、計算セッションを使用していない場合でも、SFTPを使用している間はWeb-UIアプリを終了しないでください。ページをリフレッシュする必要がある場合は、Ctrl-Rショートカットを使用することをお勧めします。
ko: Web-UI 앱을 통한 SFTP 연결은 Web-UI 앱이 내장하고 있는 로컬 proxy 서버를 사용합니다. SFTP 연결 후 파일 전송하는 과정에서 콘솔 앱을 종료하면 로컬 proxy 서버로 같이 종료되므로 파일 전송이 중간에 실패하게 됩니다. 따라서, 세션을 사용하지 않는다고 해도 SFTP 사용 중에는 콘솔 앱을 종료하면 안 됩니다. 만약 페이지 갱신이 필요한 상황이면 Ctrl-R 단축키를 이용하는 것을 권합니다.
th: เมื่อแอป Web-UI เริ่มเชื่อมต่อ SFTP จะใช้เซิร์ฟเวอร์พร็อกซี่ท้องถิ่นที่ฝังอยู่ในแอป หากคุณออกจากแอป Web-UI ในระหว่างการถ่ายโอนไฟล์ด้วยโปรโตคอล SFTP การถ่ายโอนจะล้มเหลวทันทีเนื่องจากการเชื่อมต่อที่สร้างขึ้นผ่านเซิร์ฟเวอร์พร็อกซี่ท้องถิ่นถูกตัดการเชื่อมต่อ ดังนั้น แม้ว่าคุณจะไม่ได้ใช้เซสชันการคอมพิวเตอร์ คุณไม่ควรออกจากแอป Web-UI ขณะใช้ SFTP หากคุณต้องการรีเฟรชหน้า เราขอแนะนำให้ใช้คีย์ลัด Ctrl-R

source: If the Web-UI App is closed and restarted, the SFTP service is not automatically initiated for the existing compute session. You must explicitly start the SSH/SFTP service in the desired container to establish the SFTP connection.
ja: Web-UIアプリが閉じられ再起動されても、既存のコンピュートセッションに対してSFTPサービスは自動的に開始されません。希望するコンテナでSSH/SFTPサービスを明示的に開始して、SFTP接続を確立する必要があります。
ko: 또한, Web-UI 앱을 종료한 후 다시 시작한 경우 기존에 존재하던 컨테이너에서 SFTP 서비스를 자동으로 시작하지 않습니다. 명시적으로 원하는 컨테이너에서 SSH / SFTP 서비스를 시작해줘야 SFTP 연결을 맺을 수 있습니다.
th: หากแอป Web-UI ถูกปิดและเริ่มต้นใหม่ บริการ SFTP จะไม่ได้ถูกเริ่มต้นอัตโนมัติสำหรับเซสชันการประมวลผลที่มีอยู่ คุณต้องเริ่มบริการ SSH/SFTP ในคอนเทนเนอร์ที่ต้องการโดยชัดเจนเพื่อสร้างการเชื่อมต่อ SFTP

source: Admin troubleshooting guide
ja: 管理者向けトラブルシューティングガイド
ko: 관리자 문제 해결 가이드
th: คู่มือการแก้ไขปัญหาสำหรับผู้ดูแลระบบ

source: Users cannot launch apps like Jupyter Notebook
ja: ユーザーは Jupyter Notebook のようなアプリを起動できません。
ko: 사용자가 Jupyter Notebook 등의 앱을 띄울 수 없는 경우
th: ผู้ใช้ไม่สามารถเริ่มใช้งานแอปพลิเคชันเช่น Jupyter Notebook ได้

source: There may be a problem on connecting WSProxy service. Try to stop and restart the service by referencing the guide on start/stop/restart WSProxy service.
ja: WSProxyサービスへの接続に問題があるかもしれません。WSProxyサービスの開始/停止/再起動に関するガイドを参照しながら、サービスを停止して再起動してみてください。
ko: WSProxy 서비스 접근에 문제가 있을 수 있습니다. WSProxy 서비스를 시작/중단/재시작 하는 항목을 참고하여 서비스를 중단하고 다시 시작해 봅시다.
th: อาจมีปัญหาในการเชื่อมต่อบริการ WSProxy ให้ลองหยุดและเริ่มต้นบริการใหม่โดยอ้างอิงจากคำแนะนำในการเริ่ม/หยุด/เริ่มบริการ WSProxy

source: Indicated resources do not match with actual allocation
ja: 指定されたリソースが実際の割り当てと一致しません。
ko: 표시되는 자원 양이 실제 할당된 양과 다릅니다
th: ทรัพยากรที่ระบุไม่ตรงกับการจัดสรรจริง

source: Occasionally, due to unstable network connections or container management problem of Docker daemon, there may be a case where the resource occupied by Backend.AI does not match with the resource actually used by the container. In this case, follow the steps below.
ja: 時々、不安定なネットワーク接続やDockerデーモンのコンテナ管理問題により、Backend.AIによって占有されているリソースとコンテナが実際に使用しているリソースが一致しない場合があります。この場合は、以下の手順に従ってください。
ko: 가끔 네트워크 연결이 튀거나 Docker 데몬의 컨테이너 관리 지연 등의 사유로 Backend.AI 가 인식하는 자원의 할당양과 실제 컨테이너가 점유하고 있는 자원의 양이 달라질 수 있습니다. 이런 경우에는 다음 과정을 따라 하십시오.

source: Login as admin account.
ja: 管理者アカウントとしてログインします。
ko: 어드민 계정으로 로그인
th: เข้าสู่ระบบด้วยบัญชีผู้ดูแลระบบ

source: Visit Maintenance page.
ja: メンテナンスページを訪問してください。
ko: Maintenance 페이지 방문.
th: ไปที่หน้า Maintenance

source: Click the RECALCULATE USAGE button to manually correct the resource occupancy.
ja: RECALCULATE USAGEボタンをクリックしてリソースの占有状況を手動で修正します。
ko: RECALCULATE USAGE 버튼을 클릭하여 수동으로 자원 할당량 조정.
th: คลิกปุ่ม RECALCULATE USAGE เพื่อปรับแก้การเข้าถึงทรัพยากรด้วยตนเอง

source: Image is not displayed after it is pushed to a docker registry
ja: Dockerレジストリにプッシュされた後、イメージが表示されません
ko: 도커 레지스트리에 이미지 등록 후 세션 생성 환경에 이미지가 보이지 않을 때
th: ภาพไม่แสดงหลังจากที่ถูกนำขึ้นไปยัง docker registry

source: This feature is only available for superadmins.
ja: この機能はスーパ管理者にのみ利用可能です。
ko: 이 기능은 super admin만 사용할 수 있습니다.
th: ฟีเจอร์นี้มีให้ใช้เฉพาะสำหรับซูเปอร์แอดมินเท่านั้น

source: If a new image is pushed to one of the Backend.AI docker registries, the image metadata must be updated in Backend.AI to be used in creating a compute session. Metadata update can be performed by clicking the RESCAN IMAGES button on the Maintenance page. This will update metadata for every docker registry, if there are multiple registries.
ja: 新しいイメージがBackend.AIのdockerレジストリの1つにプッシュされた場合、そのイメージのメタデータを更新して計算セッションの作成に使用できるようにする必要があります。メタデータの更新は、メンテナンスページで「イメージの再スキャン」ボタンをクリックすることで実行できます。複数のレジストリがある場合、それに属するすべてのdockerレジストリのメタデータが更新されます。
ko: 사설 도커 레지스트리에 이미지가 새로 등록된 경우 Backend.AI에서 레지스트리 별 이미지 메타 데이터를 업데이트 해야 세션 생성할 때 이용할 수 있습니다. 메타 데이터 업데이트는 Maintenance 페이지의 RESCAN IMAGES 버튼을 클릭하여 수행할 수 있습니다. 만약 연결된 도커 레지스트리가 여러 개일 경우, RESCAN IMAGES 버튼을 클릭하면 모든 레지스트리에서 메타 정보를 받아 옵니다.

source: If you want to update the metadata for a specific docker registry, you can go to the Registries tab in Environments page. Just click the refresh button in the Controls panel of the desired registry. Be careful not to delete the registry by clicking the trash icon.
ja: 特定のDockerレジストリのメタデータを更新したい場合は、環境ページのレジストリタブに移動できます。目的のレジストリのコントロールパネルにある更新ボタンをクリックするだけです。ゴミ箱アイコンをクリックしてレジストリを削除しないように注意してください。
ko: 특정한 도커 레지스트리의 메타 정보만 업데이트 하고자 할 경우 Environments 페이지의 Registries 탭에서 원하는 레지스트리의 정보만 갱신할 수 있습니다. 원하는 레지스트리의 Controls 열에서 리프레시 버튼을 클릭하면 됩니다. 휴지통 아이콘을 클릭하여 레지스트리를 삭제하지 않도록 주의해야 합니다.
th: หากคุณต้องการอัปเดตข้อมูลเมตาสำหรับ docker registry ที่เฉพาะเจาะจง คุณสามารถไปที่แท็บ Registries ในหน้าสภาพแวดล้อม เพียงคลิกปุ่มรีเฟรชในแผงควบคุมของ registry ที่ต้องการ ระมัดระวังไม่ให้ลบ registry โดยการคลิกที่ไอคอนถังขยะ

source: Inside a compute session, users cannot access ``root`` account and perform operations that require ``sudo`` privilege for security reasons. Therefore, it is not allowed to install packages with ``apt`` or ``yum`` since they require ``sudo``. If it is really required, you can request to admins to allow ``sudo`` permission.
ja: コンピュートセッション内では、セキュリティ上の理由からユーザーは ``root`` アカウントにアクセスしたり、``sudo`` 特権を必要とする操作を行うことはできません。したがって、``apt`` や ``yum`` でパッケージをインストールすることは許可されていません。本当に必要な場合は、``sudo`` 権限の許可を管理者に依頼することができます。
th: ภายในเซสชันการคอมพิวเตอร์ ผู้ใช้ไม่สามารถเข้าถึงบัญชี ``root`` และดำเนินการที่ต้องการสิทธิ์ ``sudo`` aus คำเหตุผลด้านความปลอดภัย ดังนั้นจึงไม่อนุญาตให้ติดตั้งแพ็คเกจด้วย ``apt`` หรือ ``yum`` เนื่องจากต้องการ ``sudo`` หากเป็นสิ่งที่จำเป็นจริงๆ คุณสามารถขออนุญาตจากผู้ดูแลเพื่อให้มีสิทธิ์ ``sudo``

source: Alternatively, users may use Homebrew to install OS packages. Please refer to the :ref:`guide on using Homebrew with automount folder<using-linuxbrew-with-automountfolder>`.
ja: また、ユーザーは Homebrew を使用して OS パッケージをインストールすることもできます。自動マウントフォルダで Homebrew を使用する方法については、:ref:`using-linuxbrew-with-automountfolder` を参照してください。
th: ในทางเลือกอื่น ผู้ใช้สามารถใช้ Homebrew เพื่อติดตั้งแพ็กเกจ OS ได้ กรุณาอ้างอิงไปที่ :ref:`คู่มือการใช้ Homebrew กับโฟลเดอร์ automount<using-linuxbrew-with-automountfolder>`

source: For more information, please refer to the :ref:`guide on installing Python packages with automount folder<using-pip-with-automountfolder>`.
ja: 詳細については、:ref:`automountフォルダを使用したPythonパッケージのインストールガイド<using-pip-with-automountfolder>` をご参照ください。
th: สำหรับข้อมูลเพิ่มเติม โปรดดูที่ :ref:`คู่มือการติดตั้งแพ็กเกจ Python ด้วยโฟลเดอร์อัตโนมัติ<using-pip-with-automountfolder>`

source: GPU Platform Web-UI utilizes the latest modern JavaScript and/or browser features. Please use the LATEST versions of moder browsers (such as Chrome).
th: GPU Platform Web-UI ใช้ฟีเจอร์ JavaScript และ/หรือเบราว์เซอร์สมัยใหม่ล่าสุด กรุณาใช้เวอร์ชันล่าสุดของเบราว์เซอร์สมัยใหม่ (เช่น Chrome)

source: Occasionally, due to unstable network connections or container management problem of Docker daemon, there may be a case where the resource occupied by GPU Platform does not match with the resource actually used by the container. In this case, follow the steps below.
th: บางครั้งเนื่องจากการเชื่อมต่อเครือข่ายที่ไม่เสถียรหรือปัญหาการจัดการคอนเทนเนอร์ของ Docker daemon อาจมีกรณีที่ทรัพยากรที่ถูกใช้งานโดย GPU Platform ไม่ตรงกับทรัพยากรที่ใช้โดยคอนเทนเนอร์จริง ในกรณีนี้ให้ทำตามขั้นตอนด้านล่าง

source: If a new image is pushed to one of the GPU Platform docker registries, the image metadata must be updated in GPU Platform to be used in creating a compute session. Metadata update can be performed by clicking the RESCAN IMAGES button on the Maintenance page. This will update metadata for every docker registry, if there are multiple registries.
th: หากมีการดันภาพใหม่ไปยังหนึ่งในรีจิสทรี docker ของ GPU Platform เมตาดาทาต้องได้รับการอัปเดตใน GPU Platform เพื่อที่จะใช้ในการสร้างเซสชันคอมพิวเตอร์ การอัปเดตเมตาดาทาสามารถทำได้โดยการคลิกที่ปุ่ม RESCAN IMAGES บนหน้า Maintenance ซึ่งจะปรับปรุงเมตาดาทาสำหรับรีจิสทรี docker ทุกตัว หากมีรีจิสทรีหลายตัว
