Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/user_settings/user_settings.po
Languages: ja, ko_kr, th

source: User Settings
ja: ユーザー設定
ko_kr: 사용자 설정 페이지
th: การตั้งค่าผู้ใช้

source: The user settings page is accessed by selecting the Preferences menu that appears after clicking the person icon at the top right. Users can change the preferred Environment from the language setting, SSH keypair management, editing user config script, and even to using Beta features.
ja: ユーザー設定ページには、右上の人アイコンをクリックした後に表示される「環境設定」メニューを選択することでアクセスできます。ユーザーは、言語設定からの利用環境の変更、SSHキーペア管理、ユーザー設定スクリプトの編集、さらにはベータ機能の使用までを行うことができます。
ko_kr: 사용자 설정 페이지는 우측 상단 사람 아이콘을 클릭하면 나오는 Preferences 메뉴를 선택하여 접근할 수 있습니다. 여기서는, 사용자 설정 페이지의 각 항목 및 메뉴에 관해 간단히 설명합니다.
th: ผู้ใช้สามารถเข้าถึงหน้าการตั้งค่าผ่านการเลือกเมนู Preferences ที่ปรากฏหลังจากคลิกที่ไอคอนคนที่มุมขวาบน ผู้ใช้สามารถเปลี่ยนสภาพแวดล้อมที่ต้องการจากการตั้งค่าภาษา, การจัดการ SSH keypair, การแก้ไขสคริปต์กำหนดค่าผู้ใช้ และแม้กระทั่งการใช้ฟีเจอร์ Beta.

source: GENERAL tab
ja: 一般タブ
ko_kr: GENERAL 탭
th: แท็บทั่วไป

source: There are lots of preference menu in GENERAL tab. you can search it by search field on top of the section, or you may just filter that you changed by clicking `Display Only Changes`. If you want to rollback the changes to before, click Reset button on the right top of the section.
ja: GENERALタブには多くの設定メニューがあります。セクションの上部にある検索フィールドを使用して検索することができますし、`Display Only Changes` をクリックすることで変更した内容だけをフィルタリングすることもできます。以前の状態に戻したい場合は、セクションの右上にあるリセットボタンをクリックしてください。
ko_kr: GENERAL 탭에는 많은 사용자 설정이 있습니다. 섹션 맨 위에 있는 검색 필드에서 검색하거나, 'Display Only Changes' 를 클릭해서 변경된 항목만 걸러낼 수 있습니다. 이전 설정으로 되돌리고 싶다면, 섹션 오른쪽 위에 있는 Reset 버튼을 클릭합니다.
th: มีเมนูการตั้งค่ามากมายในแท็บทั่วไป คุณสามารถค้นหามันได้โดยใช้ฟิลด์ค้นหาที่ด้านบนของส่วน หรือคุณอาจเพียงแค่กรองการเปลี่ยนแปลงที่คุณทำโดยการคลิกที่ `แสดงเฉพาะการเปลี่ยนแปลง` ถ้าคุณต้องการคืนค่าการเปลี่ยนแปลงกลับไปก่อนหน้านี้ ให้คลิกปุ่มรีเซ็ตที่มุมขวาบนของส่วน

source: Desktop Notification
ja: デスクトップ通知
ko_kr: 데스크톱 알림
th: การแจ้งเตือนบนเดสก์ท็อป

source: Enables or disables the desktop notification feature. If the browser and operating system support it, various messages that appear in the Web-UI will also appear in the desktop notification panel. If disabled from the operating system during the first run, the desktop message may not be displayed even if the option is turned on here. Regardless of the value of this option, the notification inside the Web-UI still works.
ja: デスクトップ通知機能を有効または無効にします。ブラウザとオペレーティングシステムがサポートしている場合、Web UIに表示されるさまざまなメッセージがデスクトップ通知パネルにも表示されます。初回実行時にオペレーティングシステムから無効にした場合、ここでオプションをオンにしてもデスクトップメッセージは表示されないことがあります。このオプションの値に関係なく、Web UI 内の通知は引き続き機能します。
ko_kr: 데스크톱 알림 기능을 사용 여부를 설정합니다. 브라우저 및 운영체제가 지원하는 경우, Web-UI에서 뜨는 각종 하단 메시지가 데스크톱 알림 패널에도 같이 뜨게 됩니다. 첫 실행 시 운영체제 단에서 비활성화한 경우, 여기서 옵션을 켜더라도 데스크톱 메시지가 출력되지 않을 수 있습니다. 이 옵션 설정과 관계없이, Web-UI 내부의 알림 기능은 그대로 동작합니다.
th: เปิดหรือปิดฟีเจอร์การแจ้งเตือนบนเดสก์ท็อป หากเบราว์เซอร์และระบบปฏิบัติการสนับสนุน จะมีข้อความต่างๆ ที่ปรากฏใน Web-UI แสดงในแผงการแจ้งเตือนบนเดสก์ท็อปด้วย หากปิดจากระบบปฏิบัติการในครั้งแรกที่ใช้งาน ข้อความเดสก์ท็อปอาจไม่แสดงแม้ว่าตัวเลือกนี้จะถูกเปิดที่นี่ก็ตาม ไม่ว่าจะเป็นค่าของตัวเลือกนี้หรือไม่ การแจ้งเตือนภายใน Web-UI จะยังคงทำงานอยู่

source: Use Compact Sidebar by default
ja: デフォルトでコンパクトサイドバーを使用
ko_kr: 간결한 사이드바 기본 사용
th: ใช้แถบด้านข้างแบบกะทัดรัดเป็นค่าเริ่มต้น

source: When this option is on, the left sidebar will be shown in a compact form (narrower width). Change of the option is applied when the browser is refreshed. If you want to immediately change the type of the sidebar without refreshing the page, click the leftmost icon at the top of the header.
ja: このオプションがオンの場合、左のサイドバーはコンパクトな形式（幅が狭く）で表示されます。オプションの変更は、ブラウザを更新すると適用されます。ページを更新せずにサイドバーのタイプを直ちに変更したい場合は、ヘッダー上部の最も左のアイコンをクリックしてください。
ko_kr: 이 옵션이 켜져 있으면 좌측 사이드바가 콤팩트 형태 (너비가 줄어든 형태) 로 보이게 됩니다. 다만, 옵션을 적용한다고 해서 즉시 그 효과가 보이지는 않으며, 브라우저를 갱신할 때 적용됩니다. 페이지 갱신 없이 사이드바 형태를 즉시 변경하고 싶다면, 헤더 상단부의 가장 좌측 아이콘을 클릭하십시오.
th: เมื่อเปิดใช้งานตัวเลือกนี้แถบด้านซ้ายจะถูกแสดงในรูปแบบกะทัดรัด (ความกว้างที่แคบกว่า) การเปลี่ยนแปลงของตัวเลือกจะมีผลเมื่อมีการรีเฟรชเบราว์เซอร์ หากคุณต้องการเปลี่ยนประเภทของแถบด้านข้างทันทีโดยไม่ต้องรีเฟรชหน้า ให้คลิกที่ไอคอนทางซ้ายสุดที่ด้านบนของหัวเรื่อง

source: Language
ja: 言語
ko_kr: 언어 설정
th: ภาษา

source: Set the language displayed on the UI. Currently, Backend.AI supports more than five languages including English and Korean. However, there may be some UI items that do not update their language before the page is refreshed.
ja: UIに表示される言語を設定します。現在、Backend.AIは英語と韓国語を含む5つ以上の言語をサポートしています。ただし、ページを更新する前に言語が更新されないUIアイテムがある場合があります。
ko_kr: UI 에 출력되는 언어를 설정합니다. 현재 Backend.AI에서는 한국어, 영어를 포함해 다섯 개 이상의 언어를 지원하고 있습니다. 다만, 페이지 갱신 전에는 언어가 바뀌지 않는 사용자 인터페이스 항목이 있을 수 있습니다.
th: ตั้งค่าภาษาที่แสดงบน UI ขณะนี้ Backend.AI รองรับมากกว่าห้าภาษารวมถึงภาษาอังกฤษและภาษาเกาหลี อย่างไรก็ตาม อาจมีบางรายการใน UI ที่ไม่ได้อัปเดตภาษาให้ก่อนที่หน้าจะถูกรีเฟรช

source: OS Default: Use the operating system's default language.
ja: OS デフォルト: オペレーティングシステムのデフォルト言語を使用します。
ko_kr: OS Default: 운영체제 기본 설정된 언어를 사용합니다.
th: ค่าเริ่มต้นของระบบปฏิบัติการ: ใช้ภาษาที่ตั้งค่าเริ่มต้นของระบบปฏิบัติการ

source: English: Set English as the default language.
ja: English: デフォルト言語として英語を設定します。
ko_kr: English: 영어를 기본 언어로 설정합니다.
th: ตั้งค่าอังกฤษเป็นภาษาหลัก

source: Korean: Set Korean as the default language.
ja: 韓国語: 基本言語を韓国語に設定します
ko_kr: Korean: 한국어를 기본 언어로 설정합니다.
th: ตั้งภาษาเกาหลีเป็นภาษาที่ตั้งค่าเริ่มต้น

source: Brazilian Portuguese: Set Brazilian Portuguese as the default language.
ja: ブラジルポルトガル語: デフォルト言語としてブラジルポルトガル語を設定します。
ko_kr: Brazilian Portuguese: 브라질 포르투갈어를 기본 언어로 설정합니다.
th: ตั้งค่าภาษาโปรตุเกสบราซิลเป็นภาษาพื้นฐาน

source: Chinese (Simplified): Set Chinese (Simplified) as the default language.
ja: 中国語（簡体字）：中国語（簡体字）をデフォルトの言語に設定します。
ko_kr: Chinese (Simplified): 중국어(간체)를 기본 언어로 설정합니다.
th: ตั้งค่าเป็นภาษา จีน (แบบย่อ) เป็นภาษาที่ต้องการเริ่มต้น

source: Chinese (Traditional): Set Chinese (Traditional) as the default language.
ja: 中国語（繁体字）：デフォルト言語として中国語（繁体字）を設定します。
ko_kr: Chinese (Traditional): 중국어(번체)를 기본 언어로 설정합니다.
th: ตั้งค่าเป็นภาษาจีน (ดั้งเดิม) เป็นภาษาพื้นฐาน

source: French: Set French as the default language.
ja: French: デフォルトの言語をフランス語に設定します。
ko_kr: French: 프랑스어를 기본 언어로 설정합니다.
th: ตั้งค่าเป็นภาษาฝรั่งเศสเป็นภาษาหลัก

source: Finnish: Set Finnish as the default language.
ja: フィンランド語: デフォルト言語としてフィンランド語を設定します。
ko_kr: Finnish: 핀란드어를 기본 언어로 설정합니다.
th: ฟินแลนด์: ตั้งค่าให้ฟินแลนด์เป็นภาษาพื้นฐาน

source: German: Set German as the default language.
ja: ドイツ語: ドイツ語をデフォルトの言語に設定します。
ko_kr: German: 독일어를 기본 언어로 설정합니다.
th: เยอรมัน: ตั้งค่าเยอรมันเป็นภาษาหลัก

source: Greek: Set Greek as the default language.
ja: ギリシャ語: デフォルト言語としてギリシャ語を設定します。
ko_kr: Greek: 그리스어를 기본 언어로 설정합니다.
th: กรีก: ตั้งค่ากรีกเป็นภาษาที่ตั้งไว้เริ่มต้น

source: Indonesian: Set Indonesian as the default language.
ja: インドネシア語: インドネシア語をデフォルトの言語として設定します。
ko_kr: Indonesian: 인도네시아어를 기본 언어로 설정합니다.
th: อินโดนีเซีย: ตั้งค่าอินโดนีเซียเป็นภาษาพื้นฐาน。

source: Italian: Set Italian as the default language.
ja: イタリア語: デフォルト言語をイタリア語に設定します。
ko_kr: Italian: 이탈리아어를 기본 언어로 설정합니다.
th: อิตาลี: ตั้งค่าอิตาลีเป็นภาษาหลัก

source: Japanese: Set Japanese as the default language.
ja: 日本語: デフォルト言語として日本語を設定します。
ko_kr: Japanese: 일본어를 기본 언어로 설정합니다.
th: ญี่ปุ่น: ตั้งค่าให้ภาษาญี่ปุ่นเป็นภาษาพื้นฐาน

source: Mongolian: Set Mongolian as the default language.
ja: モンゴル語: デフォルトの言語としてモンゴル語を設定します。
ko_kr: Mongolian: 몽골어를 기본 언어로 설정합니다.
th: มองโกเลีย: ตั้งค่าภาษามองโกเลียเป็นภาษาหลัก

source: Polish: Set Polish as the default language.
ja: ポーランド語: デフォルト言語としてポーランド語を設定します。
ko_kr: Polish: 폴란드어를 기본 언어로 설정합니다.
th: โปแลนด์: ตั้งโปแลนด์เป็นภาษาพื้นฐาน

source: Portuguese: Set Portuguese as the default language.
ja: ポルトガル語: ポルトガル語をデフォルト言語に設定します。
ko_kr: Portuguese: 포르투갈어를 기본 언어로 설정합니다.
th: ตั้งภาษาโปรตุเกสเป็นภาษาหลัก

source: Russian: Set Russian as the default language.
ja: ロシア語: ロシア語をデフォルト言語に設定します。
ko_kr: Russian: 러시아어를 기본 언어로 설정합니다.
th: รัสเซีย: ตั้งค่ารัสเซียเป็นภาษาหลัก

source: Spanish: Set Spanish as the default language.
ja: Spanish: スペイン語をデフォルトの言語に設定します。
ko_kr: Spanish: 스페인어를 기본 언어로 설정합니다.
th: ตั้งภาษาสเปนเป็นภาษาที่ตั้งค่าเริ่มต้น

source: Thai: Set Thai as the default language.
ja: Thai: デフォルトの言語としてタイ語を設定します。
th: ตั้งภาษาไทยเป็นภาษาหลัก

source: Turkish: Set Turkish as the default language.
ja: トルコ語: トルコ語をデフォルト言語に設定します。
ko_kr: Turkish: 터키어를 기본 언어로 설정합니다.
th: ตุรกี: ตั้งค่าตุรกีเป็นภาษาที่ตั้งค่าเริ่มต้น

source: Vietnamese: Set Vietnamese as the default language.
ja: ベトナム語: デフォルトの言語としてベトナム語を設定します。
ko_kr: Vietnamese: 베트남어를 기본 언어로 설정합니다.
th: ภาษาเวียดนาม: ตั้งค่าให้ภาษาเวียดนามเป็นภาษามาตรฐาน

source: Some of translated items may be marked as ``__NOT_TRANSLATED__``, which indicates the item is not yet translated for that language. Since Backend.AI WebUI is open sourced, anyone who willing to make the translation better can contribute: https://github.com/lablup/backend.ai-webui.
ja: 翻訳された項目の中には「``__NOT_TRANSLATED__``」とマークされているものがあり、これはその言語への翻訳がまだ行われていないことを示しています。Backend.AI WebUIはオープンソースであるため、翻訳をより良くしようとする意欲のある人なら誰でも貢献できます: https://github.com/lablup/backend.ai-webui。
ko_kr: 몇몇 언어에서는 ``__NOT_TRANSLATED__`` 로 남아있는 항목이 있을 수 있습니다. Backend.AI는 오픈소스이므로 모국어 번역에 직접 참여하고 싶으신 경우에는 다음 저장소를 방문해주세요: https://github.com/lablup/backend.ai-webui.
th: บางรายการที่แปลแล้วอาจถูกทำเครื่องหมายว่า ``__NOT_TRANSLATED__`` ซึ่งบ่งบอกว่ารายการนั้นยังไม่ได้รับการแปลเป็นภาษานั้น เนื่องจาก Backend.AI WebUI เป็นซอฟต์แวร์โอเพ่นซอร์ส ผู้ที่ต้องการทำให้การแปลดีขึ้นสามารถมีส่วนร่วมได้ที่: https://github.com/lablup/backend.ai-webui.

source: SSH Keypair Management
ja: SSH キーペア管理
ko_kr: SSH 키페어 관리
th: การจัดการคู่กุญแจ SSH

source: When using the Web-UI app, you can create SSH/SFTP connection directly to the compute session. Once you signed up for Backend.AI, a public keypair is provided. If you click the button on the right to the SSH Keypair Management section, the following dialog appears. Click the copy button on the right to copy the existing SSH public key. You can update SSH keypair by clicking GENERATE button at the bottom of the dialog. SSH public/private keys are randomly generated and stored as user information. Please note that the secret key cannot be checked again unless it is saved manually immediately after creation.
ja: Web-UIアプリを使用すると、コンピュートセッションに直接SSH/SFTP接続を作成できます。Backend.AIにサインアップすると、公開鍵ペアが提供されます。SSHキーペア管理セクションの右側にあるボタンをクリックすると、次のダイアログが表示されます。右側のコピー按鈕をクリックして、既存のSSH公開鍵をコピーしてください。ダイアログの一番下にあるGENERATEボタンをクリックすると、SSHキーペアを更新できます。SSHの公開/秘密鍵はランダムに生成され、ユーザー情報として保存されます。秘密鍵は作成直後に手動で保存しない限り再度確認できないことに注意してください。
ko_kr: 연산 세션에 직접 SSH 로 접속할 때 필요한 SSH 키페어를 조회하고 생성하는 기능입니다. 우측 버튼을 클릭하면 다음과 같은 다이얼로그가 뜹니다. 우측의 복사 버튼을 클릭하면 현재 존재하는 SSH 공개 키를 복사할 수 있습니다. 처음 Backend.AI 에 계정을 등록하게 되면, 자동으로 한 쌍의 키페어가 발급되게 됩니다. 갱신하고자 한다면 GENERATE 버튼을 클릭합니다. SSH 공개/비밀 키 는 랜덤으로 생성되어 사용자 정보로 저장되게 됩니다. 비밀키는 생성 직후 따로 저장해두지 않으면 다시 확인할 수 없음에 주의하십시오.
th: เมื่อใช้แอป Web-UI คุณสามารถสร้างการเชื่อมต่อ SSH/SFTP โดยตรงกับเซสชันการประมวลผล เมื่อคุณลงทะเบียนใน Backend.AI จะมีการให้คีย์คู่สาธารณะ หากคุณคลิกที่ปุ่มด้านขวาของส่วนการจัดการ SSH Keypair จะมีการแสดงกล่องโต้ตอบดังต่อไปนี้ คลิกปุ่มคัดลอกด้านขวาเพื่อคัดลอก SSH public key ที่มีอยู่ คุณสามารถอัปเดต SSH keypair โดยคลิกที่ปุ่ม GENERATE ที่ด้านล่างของกล่องโต้ตอบ คีย์ SSH สาธารณะ/ส่วนตัวจะถูกสร้างขึ้นแบบสุ่มและจัดเก็บเป็นข้อมูลผู้ใช้ โปรดทราบว่าคีย์ลับไม่สามารถตรวจสอบอีกครั้งได้ เว้นแต่จะถูกบันทึกด้วยตนเองทันทีหลังจากการสร้าง

source: SSH/SFTP connection is available only with the Backend.AI GUI desktop app and is not supported on a web browser.
ja: SSH/SFTP接続は、Backend.AI GUIデスクトップアプリでのみ利用可能であり、ウェブブラウザではサポートされていません。
ko_kr: SSH/SFTP 접속은 Backend.AI GUI 데스크톱 앱에서만 사용이 가능하며, 웹브라우저에서는 기본적으로 로컬 파일 시스템 접근이 어려우므로 지원하지 않습니다.
th: การเชื่อมต่อ SSH/SFTP มีให้เฉพาะกับแอพพลิเคชันเดสก์ท็อป Backend.AI GUI เท่านั้น และไม่รองรับบนเว็บเบราว์เซอร์

source: Backend.AI uses SSH keypair based on OpenSSH. On Windows, you may convert this into PPK key.
ja: Backend.AIはOpenSSHに基づいたSSHキーペアを使用します。Windowsでは、これをPPKキーに変換することができます。
ko_kr: Backend.AI 는 OpenSSH 에 기반한 SSH keypair 를 사용합니다. 윈도우즈에서는 PPK 기반 키로 변환해야 할 수 있습니다.
th: Backend.AI ใช้คู่กุญแจ SSH ที่อิงตาม OpenSSH บน Windows คุณสามารถแปลงสิ่งนี้เป็นกุญแจ PPK ได้

source: From 22.09, Backend.AI WebUI supports adding your own ssh keypair in order to provide flexibility such as accessing to a private repository. In order to add your own ssh keypair, click ``ENTER MANUALLY`` button. Then, you will see two text area which corresponds to "public" and "private" key.
ja: 22.09から、Backend.AI WebUIはプライベートリポジトリへのアクセスなどの柔軟性を提供するために、独自のSSHキーペアを追加することをサポートしています。独自のSSHキーペアを追加するには、``ENTER MANUALLY`` ボタンをクリックしてください。すると、「公開」と「非公開」の鍵に対応する2つのテキストエリアが表示されます。
ko_kr: 22.09 버전부터 Backend.AI WebUI는 사설 저장소에 접근하는 작업과 같은 유연성을 제공하기 위해 사용자가 직접 SSH 키페어를 추가할 수 있도록 지원하고 있습니다. 직접 SSH 키페어를 추가하려면, ``ENTER MANUALLY`` 버튼을 클릭하세요. 그다음, public, private 이라고 적혀있는 텍스트 입력 칸을확인하실 수 있습니다.
th: ตั้งแต่วันที่ 22.09, Backend.AI WebUI สนับสนุนการเพิ่ม ssh keypair ของคุณเองเพื่อให้มีความยืดหยุ่น เช่น การเข้าถึงที่เก็บข้อมูลส่วนตัว ในการเพิ่ม ssh keypair ของคุณเอง ให้คลิกปุ่ม ``ENTER MANUALLY`` จากนั้นคุณจะเห็นพื้นที่ข้อความสองช่องซึ่งสอดคล้องกับ "public" และ "private" key.

source: please enter the keys inside, and click ``SAVE`` button. Now you can access to backend.ai session using your own key.
ja: キーを入力し、「保存」ボタンをクリックしてください。これで、自分のキーを使用してBackend.AIセッションにアクセスすることができます。
ko_kr: 대응하는 키를 입력하고, ``SAVE`` 버튼을 클릭해주세요. 이제 Backend.AI 세션에 여러분이 등록한 키를 바탕으로 손쉽게 접근할 수 있게 됩니다.
th: กรุณาใส่คีย์ด้านในและคลิกปุ่ม ``SAVE`` ตอนนี้คุณสามารถเข้าถึงเซสชัน backend.ai โดยใช้คีย์ของคุณเองได้แล้ว

source: Automatic Update Check
ja: 自動更新チェック
ko_kr: 자동 업데이트 체크
th: การตรวจสอบการอัปเดตอัตโนมัติ

source: A notification window pops up when a new version of the Web-UI is detected. It works only in an environment where Internet access is available.
ja: 新しいバージョンのWeb-UIが検出されると、通知ウィンドウが表示されます。インターネットアクセスが利用可能な環境でのみ動作します。
ko_kr: Web-UI의 새 버전이 검색될 경우 알림 창을 띄웁니다. 인터넷 접속이 가능한 환경에서만 동작합니다.
th: หน้าต่างแจ้งเตือนจะปรากฏขึ้นเมื่อมีการตรวจพบเวอร์ชันใหม่ของ Web-UI จะทำงานเฉพาะในสภาพแวดล้อมที่มีการเข้าถึงอินเทอร์เน็ตเท่านั้น

source: Auto logout
ja: 自動ログアウト
ko_kr: 자동 로그아웃
th: ออกจากระบบอัตโนมัติ

source: Log out automatically when all Backend.AI Web-UI pages are closed except for pages created to run apps in session (e.g. jupyter notebook, web terminal, etc.).
ja: すべてのBackend.AI Web-UIページが閉じられたとき、自動的にログアウトします。ただし、セッション内でアプリを実行するために作成されたページ（例: jupyter notebook、ウェブ端末など）は除きます。
ko_kr: 세션 내 앱을 실행하기 위해 생성된 페이지를 제외한 모든 Backend.AI Web-UI 페이지가 닫힐 경우 자동으로 로그아웃 됩니다. (Jupyter Notebook, Web Terminal 등의 앱 접속은 제외)
th: ออกจากระบบโดยอัตโนมัติเมื่อปิดหน้าของ Backend.AI Web-UI ทั้งหมด ยกเว้นหน้าที่สร้างขึ้นเพื่อรันแอปในเซสชัน (เช่น jupyter notebook, web terminal, เป็นต้น)

source: My Keypair information
ja: 私のキーペア情報
th: ข้อมูล Keypair ของฉัน

source: Every user has at least one or more keypairs. you can see access and secret keypair by clicking Config button below. Remember that main access keypair is only one.
ja: すべてのユーザーは少なくとも1つ以上のキーペアを持っています。下の「設定」ボタンをクリックすると、アクセスキーとシークレットキーのキーペアを見ることができます。メインのアクセスキーペアは一つだけであることを覚えておいてください。
th: ผู้ใช้แต่ละคนมีคีย์คู่คืนหนึ่งคู่หรือมากกว่า คุณสามารถดูคีย์คู่การเข้าถึงและคีย์ลับได้โดยคลิกที่ปุ่มการตั้งค่าด้านล่าง จำไว้ว่าคีย์คู่การเข้าถึงหลักมีเพียงหนึ่งคู่เท่านั้น

source: My Keypair Information
ja: マイキーペア情報
th: ข้อมูล Keypair ของฉัน

source: EDIT BOOTSTRAP SCRIPT
ja: ブートストラップスクリプトを編集
ko_kr: 부트스트랩 스크립트 수정
th: แก้ไขสคริปต์บูตสแตรป

source: If you want to execute a one-time script just after your compute sessions started, write down the contents here.
ja: 計算セッションが開始された直後に一度だけスクリプトを実行したい場合は、ここに内容を書いてください。
ko_kr: 연산 세션 시작 후 한 번만 스크립트를 실행하고자 할 경우, 여기에 그 내용을 작성해주십시오.
th: หากคุณต้องการเรียกใช้งานสคริปต์ครั้งเดียวหลังจากที่เซสชันการประมวลผลของคุณเริ่มต้นขึ้น ให้เขียนเนื้อหาที่นี่

source: The compute session will be at the ``PREPARING`` status until the bootstrap script finishes its execution. Since a user cannot use the session until it is ``RUNNING``, if the script contains a long-running tasks, it might be better to remove them out of the bootstrap script and run them in a terminal app.
ja: コンピュートセッションは、ブートストラップスクリプトの実行が完了するまで ``PREPARING`` ステータスのままです。ユーザーはセッションが ``RUNNING`` になるまで使用できないため、スクリプトに長時間実行されるタスクが含まれている場合、それらをブートストラップスクリプトから外し、ターミナルアプリで実行する方が良いかもしれません。
ko_kr: 부트스트랩 스크립트 실행이 끝나기 전까지 세션은 ``PREPARING`` 상태에 머무르게 되고, 이 상태에서는 사용자가 연산 세션을 사용할 수 없습니다. 따라서, 오랫동안 실행해야 하는 작업이 있다면, 부트스트랩 스크립트에 작성하는 대신 연산 세션이 ``RUNNING`` 상태가 된 후 터미널 앱을 열고 실행하는 것이 나을 수 있습니다.
th: เซสชันการประมวลผลจะอยู่ในสถานะ ``PREPARING`` จนกว่าสคริปต์การบูตจะเสร็จสิ้นการทำงาน เนื่องจากผู้ใช้ไม่สามารถใช้เซสชันได้จนกว่าจะเป็น ``RUNNING`` หากสคริปต์มีงานที่ใช้เวลานาน ควรพิจารณานำงานเหล่านั้นออกจากสคริปต์การบูตและรันในแอปพลิเคชันเทอร์มินัลแทน

source: EDIT USER CONFIG SCRIPT
ja: ユーザー設定スクリプトを編集
ko_kr: 사용자 환경 스크립트 수정
th: แก้ไขสคริปต์การตั้งค่าผู้ใช้

source: You can write some config scripts to replace the default ones in a compute session. Files like ``.bashrc``, ``.tmux.conf.local``, ``.vimrc``, etc. can be customized. The scripts are saved for each user and can be used when certain automation tasks are required. For example, you can modify the ``.bashrc`` script to register your command aliases or specify that certain files are always downloaded to a specific location.
ja: コンピュートセッションでデフォルトのものを置き換えるために、いくつかの構成スクリプトを書くことができます。``.bashrc``、``.tmux.conf.local``、``.vimrc`` などのファイルはカスタマイズ可能です。スクリプトはユーザーごとに保存され、特定の自動化タスクが必要なときに使用できます。例えば、``.bashrc`` スクリプトを修正してコマンドエイリアスを登録したり、特定のファイルが常に特定の場所にダウンロードされるように指定したりすることができます。
ko_kr: 연산 세션 생성 시 몇 가지 사용자 설정 스크립트를 작성하여 기본 설정을 대체하 수 있습니다. ``.bashrc``, ``.tmux.conf.local``, ``.vimrc`` 등과 같은 파일을 변경하여 사용자화할 수 있습니다. 이 스크립트는 사용자 별로 저장되며, 일정한 자동화 작업이 필요할 때 활용할 수 있습니다. 예를 들어, ``.bashrc`` 스크립트를 수정하여 원하는 명령 alias 를 등록하거나 특정 파일을 특정 위치에 항상 다운로드 하도록 지정해둘 수 있습니다.
th: คุณสามารถเขียนสคริปต์การกำหนดค่าเพื่อแทนที่สคริปต์เริ่มต้นในเซสชั่นการคอมพิวเตอร์ ไฟล์เช่น ``.bashrc``, ``.tmux.conf.local``, ``.vimrc`` เป็นต้น สามารถปรับแต่งได้ สคริปต์จะถูกบันทึกไว้สำหรับแต่ละผู้ใช้และสามารถใช้เมื่อจำเป็นต้องทำงานอัตโนมัติบางอย่าง ตัวอย่างเช่น คุณสามารถแก้ไขสคริปต์ ``.bashrc`` เพื่อจดทะเบียนอัลลิอัสคำสั่งของคุณหรือระบุว่ามีไฟล์บางอย่างที่ดาวน์โหลดไปยังตำแหน่งเฉพาะเสมอ

source: Use the drop-down menu at the top to select the type of script you want to write and then write the content. You can save the script by clicking the SAVE or SAVE AND CLOSE button. Click the DELETE button to delete the script.
ja: 上部のドロップダウンメニューを使用して作成したいスクリプトのタイプを選択し、内容を記述します。スクリプトは、SAVE または SAVE AND CLOSE ボタンをクリックして保存できます。DELETE ボタンをクリックするとスクリプトを削除できます。
ko_kr: 상단의 드롭다운 메뉴를 활용해서 작성할 스크립트의 종류를 선택한 후 내용을 작성하십시오. 작성이 완료되면 SAVE 또는 SAVE AND CLOSE 버튼을 클릭해서 스크립트를 저장할 수 있습니다. DELETE 버튼을 클릭하면 해당 스크립트를 삭제할 수 있습니다.
th: ใช้เมนูแบบเลื่อนลงที่ด้านบนเพื่อเลือกประเภทของสคริปต์ที่คุณต้องการเขียนแล้วเขียนเนื้อหา คุณสามารถบันทึกสคริปต์โดยการคลิกปุ่มบันทึก (SAVE) หรือบันทึกและปิด (SAVE AND CLOSE) คลิกปุ่มลบ (DELETE) เพื่อลบสคริปต์

source: LOGS tab
ja: LOGSタブ
ko_kr: LOGS 탭
th: แท็บ LOGS

source: Displays detailed information of various logs recorded on the client side. You can visit this page to find out more about the errors occurred. You can search, filter the error logs, refresh and clear the logs by clicking the Clear Logs button at the top right.
ja: クライアント側で記録されたさまざまなログの詳細情報を表示します。このページを訪れることで、発生したエラーについて詳しく知ることができます。エラーログを検索したり、フィルタリングしたり、ログを更新したり、右上の「Clear Logs」ボタンをクリックしてログをクリアしたりすることができます。
ko_kr: 클라이언트 측에서 기록된 각종 로그의 상세 정보를 출력합니다. 요청 오류가 발생했을 때 자세한 내용을 확인하고 싶을 때 이 페이지에 방문할 수 있습니다. 우측 상단의 버튼을 이용해서 로그를 검색하거나 에러 메시지를 필터링하고, 로그를 새로고침하거나 지울 수 있습니다.
th: แสดงข้อมูลรายละเอียดของบันทึกต่างๆ ที่บันทึกไว้ในด้านของลูกค้า คุณสามารถไปที่หน้านี้เพื่อหาข้อมูลเพิ่มเติมเกี่ยวกับข้อผิดพลาดที่เกิดขึ้น คุณสามารถค้นหา กรองบันทึกข้อผิดพลาด อัปเดตและล้างบันทึกโดยการคลิกที่ปุ่มล้างบันทึกที่มุมขวาบน

source: If you only have one page logged in, clicking the REFRESH button may not seem to work properly. Logs pages are collection of requests to the server and responses from the server. If current page is the log page, then it will not send any requests to the server except refreshing the page explicitly. To check logs are being stacked properly, please open another page and click REFRESH button.
ja: 1つのページにしかログインしていない場合、REFRESHボタンをクリックしても正しく機能していないように見えるかもしれません。ログページはサーバーへのリクエストとサーバーからのレスポンスの集まりです。現在のページがログページである場合、ページを明示的にリフレッシュする以外にサーバーへのリクエストは送信されません。ログが正しく積み重ねられているか確認するには、別のページを開いてREFRESHボタンをクリックしてください。
ko_kr: 로그인된 페이지가 하나만 존재할 경우, REFRESH 버튼을 클릭하면 제대로 작동하지 않는 것처럼 보일 수 있습니다. 로그 페이지는 서버에 대한 요청과 서버의 응답을 모아둔 것이며, 현재 페이지가 로그 페이지인 경우 명시적으로 페이지를 새로 고침하는 것 외에는 서버에 요청을 보내지 않습니다. 로그가 제대로 쌓이는지 확인하려면 다른 페이지를 열고 REFRESH 버튼을 클릭하십시오.
th: หากคุณล็อกอินอยู่เพียงหน้าหนึ่ง การคลิกที่ปุ่ม REFRESH อาจไม่แสดงผลอย่างถูกต้อง หน้าบันทึกเป็นการรวมคำขอไปยังเซิร์ฟเวอร์และการตอบสนองจากเซิร์ฟเวอร์ หากหน้าปัจจุบันคือหน้าบันทึก มันจะไม่ส่งคำขอใด ๆ ไปยังเซิร์ฟเวอร์นอกเหนือจากการรีเฟรชหน้าตามที่ระบุ หากต้องการตรวจสอบว่าบันทึกกำลังถูกจัดเรียงอย่างถูกต้อง กรุณาเปิดหน้าอื่นและคลิกปุ่ม REFRESH

source: If you want to hide or show the certain columns, click the gear icon at the bottom right of the table. Then you can see below dialog to select the columns you want to see.
ja: 特定の列を非表示にしたり表示したりしたい場合は、テーブルの右下にある歯車アイコンをクリックしてください。すると、以下のダイアログが表示され、表示したい列を選択することができます。
ko_kr: 특정 열을 숨기거나 보이게 하려면, 테이블 우측 하단의 기어 아이콘을 클릭하십시오. 그러면 아래와 같은 다이얼로그가 나타나며, 보고 싶은 열을 선택할 수 있습니다.
th: หากคุณต้องการซ่อนหรือแสดงคอลัมน์บางอย่าง ให้คลิกที่ไอคอนเฟืองที่มุมขวาล่างของตาราง จากนั้นคุณจะสามารถเห็นกล่องโต้ตอบด้านล่างเพื่อเลือกคอลัมน์ที่คุณต้องการเห็น
