Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/summary/summary.po
Languages: ja, ko_kr, th

source: Summary Page
ja: サマリーページ
ko_kr: Summary 페이지
th: หน้าสรุป

source: On the Summary page, users can check resource status and session usage, and there are shortcut links to frequently used functions.
ja: 概要ページでは、ユーザーはリソースの状態とセッションの使用状況を確認でき、よく使われる機能へのショートカットリンクがあります。
ko_kr: Summary 페이지에서는 사용자의 자원 사용 상태 및 연산 세션 현황 등의 정보를 확인할 수 있고, 자주 사용되는 기능 또는 페이지에 대한 단축 링크가 있습니다.
th: ในหน้า สรุป ผู้ใช้สามารถตรวจสอบสถานะของทรัพยากรและการใช้งานเซสชัน และมีลิงก์ลัดไปยังฟังก์ชันที่ใช้บ่อย

source: Topbar
ja: トップバー
ko_kr: 상단 바
th: แถบด้านบน

source: Topbar usermenu
ja: トップバーユーザーメニュー
th: เมนูผู้ใช้บนแถบด้านบน

source: In the middle of the top bar is a drop-down menu to select the user's current project. If a user belongs to multiple projects, the user can change it from here. Each project may have different resource policies, therefore changing the project also changes the available resource policies. If there are not many users, there may be only one default project.
ja: トップバーの中央に、ユーザーの現在のプロジェクトを選択するためのドロップダウンメニューがあります。ユーザーが複数のプロジェクトに属している場合は、ここからプロジェクトを変更できます。各プロジェクトは異なるリソースポリシーを持つことがあるため、プロジェクトを変更すると利用可能なリソースポリシーも変更されます。ユーザーがそれほど多くない場合は、デフォルトプロジェクトが1つしかないかもしれません。
th: ในกลางแถบด้านบนเป็นเมนูเลื่อนลงเพื่อเลือกโปรเจกต์ปัจจุบันของผู้ใช้ หากผู้ใช้เป็นสมาชิกของหลายโปรเจกต์ ผู้ใช้สามารถเปลี่ยนได้จากที่นี่ โปรเจกต์แต่ละโปรเจกต์อาจมีกฎระเบียบด้านทรัพยากรที่แตกต่างกัน ดังนั้นการเปลี่ยนโปรเจกต์จึงทำให้กฎระเบียบด้านทรัพยากรที่มีอยู่เปลี่ยนแปลงไปด้วย หากมีผู้ใช้น้อย อาจมีโปรเจกต์เริ่มต้นเพียงโปรเจกต์เดียวเท่านั้น

source: Click the person icon on the right side of the top bar to see the user menu. Each menu item has the following functions.
ja: 上部バーの右側にある人型のアイコンをクリックすると、ユーザーメニューが表示されます。各メニュー項目の機能は次のとおりです。
ko_kr: 상단 바의 우측의 사람 아이콘을 클릭하면 사용자 메뉴를 확인할 수 있습니다. 각 메뉴 항목은 다음과 같은 기능을 가지고 있습니다.
th: คลิกที่ไอคอนคนด้านขวาของแถบด้านบนเพื่อตรวจสอบเมนูผู้ใช้ รายการเมนูแต่ละรายการมีฟังก์ชันดังต่อไปนี้

source: About Backend.AI: Displays information such as version of Backend.AI Web-UI, license type, etc.
ko_kr: About Backend.AI: Backend.AI Web-UI의 버전, 라이선스 종류 등과 같은 정보를 표시 합니다.
th: เกี่ยวกับ Backend.AI: แสดงข้อมูลเช่น เวอร์ชันของ Backend.AI Web-UI, ประเภทใบอนุญาต, เป็นต้น

source: My Account: Check/Update information of current login user
ja: マイアカウント: 現在のログインユーザーの情報を確認/更新する
th: บัญชีของฉัน: ตรวจสอบ/ปรับปรุงข้อมูลของผู้ใช้ที่เข้าสู่ระบบปัจจุบัน

source: Preferences: Go to user settings page
ja: 設定: ユーザー設定ページへ移動
ko_kr: Preferences: 사용자 설정 페이지로 이동합니다
th: การตั้งค่า: ไปที่หน้าการตั้งค่าผู้ใช้

source: Logs / Errors: Go to the log page. You can check the log and error history recorded on the client side.
ja: ログ/エラー: ログページに移動します。クライアント側に記録されたログとエラーの履歴を確認できます。
ko_kr: Logs / Erros: 로그 페이지로 이동합니다. 클라이언트 측에 기록된 로그 및 오류 내역을 확인할 수 있습니다.
th: บันทึก / ข้อผิดพลาด: ไปที่หน้าบันทึก คุณสามารถตรวจสอบประวัติบันทึกและข้อผิดพลาดที่บันทึกไว้ในฝั่งคล้ายได้

source: Log Out: Log out. Users can also logout by clicking the icon on the far right of the top bar.
ja: ログアウト: ログアウトします。ユーザーは、トップバーの右端にあるアイコンをクリックすることでもログアウトできます。
th: ออกจากระบบ: ออกจากระบบ ผู้ใช้สามารถออกจากระบบได้โดยการคลิกที่ไอคอนด้านขวาสุดของแถบด้านบน

source: If you click My Account, the following dialog appears.
ja: My Accountをクリックすると、次のダイアログが表示されます。
th: ถ้าคุณคลิกที่ บัญชีของฉัน จะมีหน้าต่างถูกเปิดขึ้นดังนี้

source: Each item has the following meaning.
ja: 各項目には以下の意味があります。
ko_kr: 각 항목은 다음과 같은 의미를 가집니다.
th: แต่ละรายการมีความหมายดังต่อไปนี้

source: Full Name: User's name (up to 64 characters)
ja: フルネーム: ユーザーの名前 (最大64文字)
ko_kr: Full Name: 사용자의 이름 (최대 64 자)
th: ชื่อเต็ม: ชื่อผู้ใช้งาน (สูงสุด 64 ตัวอักษร)

source: Original password: Original password. Click the right view icon to see the input contents.
ja: 元のパスワード：元のパスワード。入力内容を確認するには、右側のビューアイコンをクリックしてください。
ko_kr: Original password: 원래 비밀번호. 우측 보기 아이콘을 클릭하면 입력 내용을 볼 수 있음.
th: รหัสผ่านเดิม: รหัสผ่านเดิม คลิกที่ไอคอนดูทางขวาเพื่อดูเนื้อหาที่ป้อน

source: New password: New password (8 characters or more containing at least 1 alphabet, number, and symbol). Click the right view icon to see the input contents. Ensure this is the same as the Original password.
ja: 新しいパスワード: 新しいパスワード（少なくとも1つのアルファベット、数字、記号を含む8文字以上）。右側の表示アイコンをクリックして入力内容を確認します。元のパスワードと同じであることを確認してください。
ko_kr: New password: 새로운 비밀번호 (영문자, 숫자, 기호가 1 개 이상 포함 된 8 글자 이상). 우측 보기 아이콘을 클릭하면 입력 내용을 볼 수 있음. Original password 에 입력한 값과 같아야 합니다.
th: รหัสผ่านใหม่: รหัสผ่านใหม่ (8 ตัวอักษรขึ้นไปโดยต้องประกอบด้วยตัวอักษร 1 ตัว ตัวเลข และสัญลักษณ์อย่างน้อย 1 ตัว) คลิกที่ไอคอนดูที่ถูกต้องเพื่อดูเนื้อหาที่ป้อน ตรวจสอบให้แน่ใจว่านี่เหมือนกับรหัสผ่านเดิม

source: 2FA Enabled: 2FA activation. The user needs to enter the OTP code when logging in if it is checked.
ja: 2FA 有効: 2FA の有効化。チェックされている場合、ユーザーはログイン時に OTP コードを入力する必要があります。
th: เปิดใช้งาน 2FA: การเปิดใช้งาน 2FA ผู้ใช้จำเป็นต้องป้อนรหัส OTP เมื่อเข้าสู่ระบบหากมีการเลือกใช้งาน

source: Depending on the plugin settings, the ``2FA Enabled`` column might be invisible. In that case, please contact administrator of your system.
ja: プラグイン設定によっては、「2FA 有効」列が表示されないことがあります。その場合は、システムの管理者に連絡してください。
th: ขึ้นอยู่กับการตั้งค่า plugin คอลัมน์ ``2FA Enabled`` อาจไม่แสดงให้เห็น ในกรณีนั้นกรุณาติดต่อผู้ดูแลระบบของระบบคุณ

source: Enter the desired value and click the UPDATE button to update the user information.
ja: 希望する値を入力し、UPDATEボタンをクリックしてユーザー情報を更新します。
ko_kr: 원하는 값을 입력하고 UPDATE 버튼을 클릭하면 사용자 정보를 갱신할 수 있습니다.
th: ป้อนค่าที่ต้องการและคลิกปุ่ม UPDATE เพื่ออัปเดตข้อมูลผู้ใช้。

source: 2FA Setup
ja: 2FA 設定
th: การตั้งค่า 2FA

source: If you activate the ``2FA Enabled`` switch, the following dialog appears.
ja: ``2FA Enabled`` スイッチを有効にすると、次のダイアログが表示されます。
th: ถ้าคุณเปิดสวิตช์ ``2FA Enabled`` กล่องสนทนาดังต่อไปนี้จะแสดงขึ้น.

source: Turn on the 2FA application you use and scan the QR code or manually enter the verification code. There are many 2FA-enabled applications, such as Google Authenticator, 2STP, 1Password, and Bitwarden.
ja: 使用している2FAアプリケーションを起動し、QRコードをスキャンするか、手動で検証コードを入力します。2FA対応のアプリケーションには、Google Authenticator、2STP、1Password、Bitwardenなどがあります。
th: เปิดแอปพลิเคชัน 2FA ที่คุณใช้และสแกนรหัส QR หรือป้อนรหัสยืนยันด้วยตนเอง มีแอปพลิเคชันที่รองรับ 2FA หลายตัว เช่น Google Authenticator, 2STP, 1Password และ Bitwarden

source: Then enter the 6-digit code from the item added to your 2FA application into the dialog above. 2FA is activated when you press the CONFIRM button.
ja: 次に、お使いの2FAアプリケーションに追加された項目から6桁のコードを上記のダイアログに入力します。「確認」ボタンを押すと、2FAが有効になります。
th: จากนั้นให้ป้อนรหัส 6 หลักจากรายการที่เพิ่มไปยังแอปพลิเคชัน 2FA ของคุณในกล่องโต้ตอบด้านบน 2FA จะถูกเปิดใช้งานเมื่อคุณกดปุ่มยืนยัน

source: When you log in later, if you enter an email and password, an additional field appears asking for the OTP code.
ja: 後でログインする際に、メールアドレスとパスワードを入力すると、OTPコードを求める追加フィールドが表示されます。
th: เมื่อคุณเข้าสู่ระบบในภายหลัง หากคุณใส่อีเมลและรหัสผ่าน จะมีฟิลด์เพิ่มเติมปรากฏขึ้นเพื่อขอรหัส OTP

source: To log in, you must open the 2FA application and enter a 6-digit code in the One-time password field.
ja: ログインするには、2FAアプリケーションを開き、ワンタイムパスワードフィールドに6桁のコードを入力する必要があります。
th: ในการเข้าสู่ระบบ คุณต้องเปิดแอปพลิเคชัน 2FA และป้อนรหัส 6 หลักในช่องรหัสผ่านใช้ครั้งเดียว

source: If you want to disable 2FA, turn off the ``2FA Enabled`` switch and click the confirm button in the following dialog.
ja: 2FA を無効にしたい場合は、``2FA Enabled`` スイッチをオフにし、次のダイアログで確認ボタンをクリックしてください。
th: หากคุณต้องการปิดการใช้งาน 2FA ให้ปิดสวิตช์ ``2FA Enabled`` และคลิกปุ่มยืนยันในกล่องโต้ตอบด้านล่างนี้

source: Summary panel
ja: サマリーパネル
ko_kr: Summary 패널
th: แผงสรุป

source: Dashboard panels
ja: ダッシュボードパネル
th: แผงควบคุม

source: Various convenience panels are located under the top bar.
ja: トップバーの下にさまざまな便利なパネルがあります。
ko_kr: 상단 바 아래에는 각종 편의 패널이 위치합니다.
th: แผงความสะดวกต่างๆ ตั้งอยู่ใต้แถบด้านบน

source: Start Menu
ja: スタートメニュー
th: เมนูเริ่มต้น

source: You can start a compute session by clicking on the START button. It is the same as the feature on the Sessions page, and is a shortcut button that helps you create a compute session immediately after logging in.
ja: STARTボタンをクリックすることで、計算セッションを開始できます。これはセッションページの機能と同じで、ログイン直後に計算セッションをすぐに作成できるショートカットボタンです。
ko_kr: START 버튼을 클릭하여 연산 세션을 시작할 수 있습니다. Sessions 페이지에 있는 연산 세션 생성 기능과 동일하며, 처음 로그인 하자마자 바로 연산 세션을 생성할 수 있도록 돕는 단축 버튼입니다.
th: คุณสามารถเริ่มเซสชันการประมวลผลได้โดยการคลิกที่ปุ่ม START ซึ่งทำงานเหมือนกับฟีเจอร์ในหน้าเซสชัน และเป็นปุ่มลัดที่จะช่วยให้คุณสร้างเซสชันการประมวลผลทันทีหลังจากเข้าสู่ระบบ

source: Below the START button are shortcut links to the Data & Storage (Upload files), Users, and Maintenance pages. Among these, the links to the Users and to Maintenance pages are only available for the admin account.
ja: STARTボタンの下には、データ＆ストレージ（ファイルのアップロード）、ユーザー、およびメンテナンスページへのショートカットリンクがあります。この中で、ユーザーおよびメンテナンスページへのリンクは管理者アカウントのみに利用可能です。
ko_kr: START 버튼 하단에는 Data & Storage, Users, Maintenance 페이지로 이동할 수 있는 단 축 링크가 있습니다. 이 중 Users, Maintenance 페이지로 이동하는 링크는 관리자 계정으로 로그인 했을 때만 보입니다.
th: ด้านล่างปุ่ม START จะมีลิงก์ทางลัดไปยังหน้าข้อมูลและการจัดเก็บ (อัปโหลดไฟล์), ผู้ใช้ และบำรุงรักษา ในนี้ลิงก์ไปยังหน้าผู้ใช้และหน้าบำรุงรักษาจะมีเฉพาะสำหรับบัญชีผู้ดูแลระบบเท่านั้น

source: Resource Statistics
ja: リソース統計情報
th: สถิติทรัพยากร

source: It shows the total amount of resources the user can allocate and the amount of resources currently allocated. You can check the user's CPU, memory, and GPU resource occupancy and quota respectively. Also on the Sessions slider, you can see the maximum number of compute sessions you can create simultaneously and how many compute sessions are currently running.
ja: ユーザーが割り当てることができるリソースの総量と、現在割り当てられているリソースの量を表示します。ユーザーのCPU、メモリ、およびGPUリソースの占有率とクォータをそれぞれ確認できます。また、セッションスライダーでは、同時に作成できるコンピュートセッションの最大数と、現在実行中のコンピュートセッションの数を確認できます。
ko_kr: 사용자가 할당 가능한 총 자원의 양과 현재 할당받아 점유 중인 자원의 양을 보여줍니다. 사용 자의 CPU, 메모리, GPU 자원 점유량 및 할당량을 각각 확인할 수 있습니다. 또한, Sessions 슬라이더에서 사용자가 동시에 생성 가능한 연산 세션의 수 및 현재 작동 중인 연산 세션의 수를 확인할 수 있습니다.
th: จะแสดงจำนวนรวมของทรัพยากรที่ผู้ใช้สามารถจัดสรรได้และจำนวนทรัพยากรที่ถูกจัดสรรอยู่ในขณะนี้ คุณสามารถตรวจสอบการใช้ทรัพยากร CPU, หน่วยความจำ และ GPU ของผู้ใช้และโควต้าได้ตามลำดับ นอกจากนี้ในสไลเดอร์ Sessions คุณยังสามารถดูจำนวนเซสชันการคำนวณสูงสุดที่คุณสามารถสร้างพร้อมกันและจำนวนเซสชันการคำนวณที่กำลังทำงานอยู่ในขณะนี้

source: You can change the resource group by clicking the Resource Group field at the top. Resource group is a concept to group multiple Agent nodes as a single resource unit. If you have many agent nodes, you can configure settings such as assigning them to a specific project for each resource group. When there is only one agent node, it is normal to see only one resource group. If you change the resource group, the amount of resources may change depending on the amount of resources held by that resource group (agents belong to it).
ja: リソースグループは、上部のリソースグループフィールドをクリックすることで変更できます。リソースグループは、複数のエージェントノードを単一のリソース単位としてグループ化するための概念です。多数のエージェントノードがある場合、それらを特定のプロジェクトに割り当てるなど、各リソースグループに対して設定を構成できます。エージェントノードが1つしかない場合、1つのリソースグループしか表示されないのが通常です。リソースグループを変更すると、そのリソースグループが保有するリソース（エージェントが属する）によって、リソースの量が変わる場合があります。
ko_kr: 상단의 Resource Group 필드를 클릭하여 자원 그룹을 변경할 수 있습니다. 자원 그룹은 다 수의 Agent 노드가 있을 때, Agent 의 일부를 묶어 하나의 워커 노드 그룹으로 설정할 수 있는 기능입니다. 다양한 Agent 노드를 보유하고 있는 경우, 각 자원 그룹 별로 특정 사용자 그룹에 독접 할당하는 등의 설정이 가능합니다. Agent 노드가 한 대인 경우에는 하나의 자원 그룹만 보이는 것이 보통입니다. 자원 그룹을 변경하면, 해당 자원의 자원 보유량에 따라 자원량이 변할 수 있습니다.
th: คุณสามารถเปลี่ยนกลุ่มทรัพยากรได้โดยการคลิกที่ฟิลด์กลุ่มทรัพยากรด้านบน กลุ่มทรัพยากรเป็นแนวคิดในการรวมหน่วยงาน Agent หลาย ๆ ตัวเป็นหน่วยทรัพยากรเดียว หากคุณมีหน่วยงาน Agent หลายตัว คุณสามารถตั้งค่าต่าง ๆ เช่น การกำหนดพวกเขาให้กับโครงการเฉพาะสำหรับแต่ละกลุ่มทรัพยากร เมื่อมีหน่วยงาน Agent เพียงตัวเดียว จะเป็นเรื่องปกติที่จะเห็นเพียงกลุ่มทรัพยากรเดียว หากคุณเปลี่ยนกลุ่มทรัพยากร ปริมาณทรัพยากรอาจเปลี่ยนแปลงไปตามจำนวนทรัพยากรที่กลุ่มทรัพยากรนั้นถืออยู่ (หน่วยงานที่เป็นของมัน)

source: System Resources
ja: システムリソース
th: ทรัพยากรระบบ

source: It shows the number of Agent worker nodes connected to the Backend.AI system and the total number of compute sessions currently created. You can also check the CPU, memory, and GPU utilization of the agent node. If you are logged in as a normal user, only the number of compute sessions you have created is displayed.
ja: それは、Backend.AI システムに接続されているエージェントワーカーノードの数と、現在作成されている計算セッションの総数を表示します。エージェントノードの CPU、メモリ、GPU の利用率も確認できます。通常のユーザーとしてログインしている場合は、作成した計算セッションの数のみが表示されます。
ko_kr: Backend.AI 시스템에 연결된 Agent 워커 노드의 수와 현재 생성되어 있는 전체 연산 세션의 수를 보여줍니다. Agent 노드의 CPU, 메모리, GPU 실제 사용량 (utilization) 도 확인할 수 있습니다. 일반 사용자로 로그인 한 경우에는 자신이 생성한 연산 세션의 숫자만 표시됩니다.
th: จะแสดงจำนวนโหนดของ Agent worker ที่เชื่อมต่อกับระบบ Backend.AI และจำนวนเซสชันการคำนวณทั้งหมดที่สร้างขึ้นในปัจจุบัน คุณยังสามารถตรวจสอบการใช้ CPU, หน่วยความจำ และ GPU ของโหนดตัวแทนได้ หากคุณล็อกอินเป็นผู้ใช้ทั่วไป จะมีการแสดงผลเฉพาะจำนวนเซสชันการคำนวณที่คุณสร้างขึ้นเท่านั้น

source: Announcement
ja: お知らせ
th: ประกาศ

source: Announcements will be displayed here. Announcements can be made through a separate admin UI (Control-Panel).
ja: お知らせはここに表示されます。お知らせは別の管理者UI（コントロールパネル）を通じて行うことができます。
ko_kr: 공지사항이 있을 경우 여기에 표시됩니다. 공지사항은 별도의 관리자 Control-Panel GUI를 통해서 작성 가능 합니다.
th: ประกาศจะถูกแสดงที่นี่ ประกาศสามารถทำได้ผ่านทาง UI ผู้ดูแลระบบแยกต่างหาก (Control-Panel)

source: Invitation
ja: 招待
th: คำเชิญ

source: If another user has shared their storage folder to you, it will be displayed here. If you accept the share request, you can view and access the shared folder in the Data & Storage folder. The access rights are determined by the user who has sent the share request. Of course, you can decline the sharing requests.
ja: 他のユーザーがストレージフォルダを共有した場合、ここに表示されます。共有リクエストを承認すると、データ & ストレージフォルダ内で共有フォルダを閲覧およびアクセスできます。アクセス権は、共有リクエストを送信したユーザーによって決まります。もちろん、共有リクエストを拒否することもできます。
ko_kr: 다른 사용자가 저장 폴더를 공유한 경우 여기에 표시됩니다. 공유 요청을 수락하면 Data & Storage 폴더에서 공유 받은 폴더를 조회하고 접근할 수 있습니다. 접근 권한은 공유한 사용자가 지정한 설정에 따릅니다. 물론, 공유 요청을 거절할 수도 있습니다.
th: หากผู้ใช้คนอื่นได้แชร์โฟลเดอร์ที่เก็บข้อมูลของพวกเขาให้คุณ มันจะแสดงที่นี่ หากคุณยอมรับคำขอการแชร์ คุณสามารถดูและเข้าถึงโฟลเดอร์ที่แชร์ในโฟลเดอร์ข้อมูลและที่จัดเก็บ ข้อสิทธิ์การเข้าถึงจะถูกกำหนดโดยผู้ที่ส่งคำขอการแชร์ แน่นอนว่าคุณสามารถปฏิเสธคำขอการแชร์ได้

source: Download Backend.AI Web UI App
ja: Backend.AI Web UI アプリのダウンロード
th: ดาวน์โหลดแอป Backend.AI Web UI

source: Backend.AI WebUI supports desktop applications. By using desktop app, you can use desktop app specific features, such as :ref:`SSH/SFTP connection to a Compute Session<ssh-sftp-container>` . For now Backend.AI WebUI provides desktop application with following OS:
ja: Backend.AI WebUIはデスクトップアプリケーションをサポートしています。デスクトップアプリを使用することで、:ref:`計算セッションへのSSH/SFTP接続<ssh-sftp-container>` のようなデスクトップアプリ固有の機能を利用できます。現在、Backend.AI WebUIは以下のOSでデスクトップアプリケーションを提供しています:
th: Backend.AI WebUI รองรับแอปพลิเคชันเดสก์ท็อป โดยการใช้แอปพลิเคชันเดสก์ท็อป คุณสามารถใช้คุณลักษณะเฉพาะของแอปพลิเคชันเดสก์ท็อปได้ เช่น :ref:`การเชื่อมต่อ SSH/SFTP กับ Compute Session<ssh-sftp-container>` สำหรับตอนนี้ Backend.AI WebUI ให้บริการแอปพลิเคชันเดสก์ท็อปกับระบบปฏิบัติการต่อไปนี้:

source: Windows
ja: ウィンドウズ
th: หน้าต่าง

source: Linux
th: ลินุกซ์

source: Mac
ja: マック
th: แมค

source: When you click the button that match with your local environment (e.g. OS, Architecture), It will automatically downloads the same version of current webUI version. If you want to download later or former version of WebUI as a desktop app, please visit `here <https://github.com/lablup/backend.ai-webui/releases?page=1>`_ and download the desired version(s).
ja: ボタンをクリックしてローカル環境（例：OS、アーキテクチャ）に一致させると、現在のWebUIバージョンと同じバージョンが自動的にダウンロードされます。後でWebUIのバージョンや以前のバージョンをデスクトップアプリとしてダウンロードしたい場合は、`こちら <https://github.com/lablup/backend.ai-webui/releases?page=1>`_ を訪れて、希望のバージョンをダウンロードしてください。
th: เมื่อคุณคลิกปุ่มที่ตรงกับสภาพแวดล้อมของคุณ (เช่น OS, สถาปัตยกรรม) จะมีการดาวน์โหลดเวอร์ชันเดียวกันของเวอร์ชัน webUI ปัจจุบันโดยอัตโนมัติ หากคุณต้องการดาวน์โหลดเวอร์ชันก่อนหน้านี้หรือเวอร์ชันที่เก่ากว่าเป็นแอปเดสก์ท็อป โปรดเยี่ยมชม `ที่นี่ <https://github.com/lablup/backend.ai-webui/releases?page=1>`_ และดาวน์โหลดเวอร์ชันที่ต้องการ

source: In the middle of the top bar is a drop-down menu to select the user's current project (group). If a user belongs to multiple projects, the user can change it from here. Each project may have different resource policies, therefore changing the project also changes the available resource policies. If there are not many users, there may be only one default project.
ko_kr: 상단 바의 중간 부분에는 사용자의 현재 프로젝트 (그룹) 을 선택하는 드롭다운 메뉴가 있습니다. 사용자가 여러 프로젝트에 속해있을 경우 프로젝트를 바꿀 수 있습니다. 프로젝트 별로 다른 자원 정책을 가질 수 있으므로, 프로젝트를 변경하면 가용한 자원 정책도 바뀝니다. 사용자가 많지 않은 경우, default 프로젝트 하나만 있을 수 있습니다.

source: Change User Info: Change user name and password
ko_kr: Change User Info: 사용자의 이름과 비밀번호를 변경합니다

source: Logout: Log out. Users can also logout by clicking the icon on the far right of the top bar.
ko_kr: Logout: 로그아웃 합니다. 로그아웃은 상단 바의 가장 우측의 아이콘을 클릭해도 할 수 있습니다.

source: If you click Change User Info, the following dialog appears.
ko_kr: Change User Info 를 클릭하면 다음과 같은 다이얼로그가 나옵니다.
