Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/cluster_session/cluster_session.po
Languages: ja, ko_kr, th

source: Backend.AI Cluster Compute Session
ja: Backend.AI クラスターコンピュートセッション
ko_kr: Backend.AI 클러스터 연산 세션

source: Cluster compute session feature is supported from Backend.AI server 20.09 or higher.
ja: クラスタ計算セッション機能は、Backend.AI サーバー 20.09 以上でサポートされています。
ko_kr: 클러스터 연산 세션 기능은 Backend.AI 서버 20.09 버전 이상부터 지원합니다.

source: Overview of Backend.AI cluster compute session
ja: Backend.AI クラスター コンピュート セッションの概要
ko_kr: Backend.AI 클러스터 연산 세션 개괄

source: Backend.AI supports cluster compute session to support distributed computing / training tasks. A cluster session consists of multiple containers, each of which is created across multiple Agent nodes. Containers under a cluster session are automatically connected each other through a dynamically-created private network. Temporary domain names (``main1``, ``sub1``, ``sub2``, etc.) are also given, making it simple to execute networking tasks such as SSH connection. All the necessary secret keys and various settings for SSH connection between containers are automatically generated.
ja: Backend.AIは、分散コンピューティング/トレーニングタスクをサポートするためにクラスターコンピュートセッションをサポートしています。クラスターセッションは、複数のエージェントノードにまたがって作成された複数のコンテナで構成されます。クラスターセッションの下にあるコンテナは、動的に作成されたプライベートネットワークを通じて自動的に接続されます。また、一時的なドメイン名（``main1``、``sub1``、``sub2`` など）が与えられ、SSH接続などのネットワーキングタスクを簡単に実行できるようになります。コンテナ間のSSH接続に必要なすべての秘密鍵やさまざまな設定は自動的に生成されます。
ko_kr: Backend.AI 에서는 분산 연산 및 학습 작업을 지원하기 위해 클러스터 연산 세션을 지원하고 있습니다. 클러스터 세션은 여러 개의 컨테이너로 구성되며, 각 컨테이너는 여러 Agent 노드에 걸쳐 생성됩니다. 클러스터 세션으로 묶인 컨테이너는 동적으로 생성된 사설 네트워크를 통해 자동으로 연결되며, 임시 도메인 이름(``main1``, ``sub1``, ``sub2`` 등)이 부여되어 간단하게 SSH 접속 등의 네트워킹 작업이 가능합니다. 컨테이너 간 SSH 접속을 위해 필요한 비밀 키 및 각종 설정은 모두 자동으로 생성됩니다.

source: For detailed about Backend.AI cluster session, refer to the following.
ja: Backend.AI クラスターセッションの詳細については、以下を参照してください。
ko_kr: Backend.AI 클러스터 세션의 상세 특징은 다음을 참고 하십시오.

source: Containers under a cluster session are created across one or more Agent nodes which belon to a resource group.
ja: クラスタセッション下のコンテナは、リソースグループに属する1台以上のエージェントノードにわたって作成されます。
ko_kr: 클러스터 세션을 구성하는 컨테이너는 한 자원 그룹에 속한 하나 이상의 Agent 노드에 걸쳐 생성 됩니다.
th: คอนเทนเนอร์ภายใต้เซสชันคลัสเตอร์จะถูกสร้างขึ้นข้ามโหนดตัวแทนหนึ่งหรือมากกว่าซึ่งเป็นของกลุ่มทรัพยากร

source: A cluster session consists of one main container (``main1``) and one or more sub containers (``subX``).
ja: クラスタセッションは、1つのメインコンテナ（``main1``）と1つ以上のサブコンテナ（``subX``）で構成されます。
ko_kr: 클러스터 세션은 하나의 메인 컨테이너(``main1``)와 하나 이상의 서브 컨테이너(``subX``)로 구성됩니다.
th: เซสชันคลัสเตอร์ประกอบด้วยคอนเทนเนอร์หลักหนึ่งตัว (``main1``) และคอนเทนเนอร์ย่อยหนึ่งตัวหรือมากกว่า (``subX``)

source: All containers under a cluster session are created by allocating the same amount of resources. In the figure above, all four containers of session X are created with the same amount of resources.
ja: クラスターセッションの下にあるすべてのコンテナは、同じ量のリソースを割り当てて作成されます。上の図では、セッションXの4つのコンテナすべてが同じ量のリソースで作成されています。
ko_kr: 모든 구성 컨테이너는 동일한 자원을 할당하여 생성 됩니다. 위 그림에서 session X의 네 개 컨테이너는 모두 동일한 양의 자원으로 생성 됩니다.
th: ทุกคอนเทนเนอร์ภายใต้เซสชันคลัสเตอร์ถูกสร้างขึ้นโดยการจัดสรรทรัพยากรในปริมาณที่เท่ากัน ในรูปภาพข้างต้น คอนเทนเนอร์ทั้งสี่ของเซสชัน X ถูกสร้างขึ้นด้วยทรัพยากรในปริมาณที่เท่ากัน

source: All containers under a cluster session mount the same data folder specified when creating a compute session.
ja: クラスターセッション内のすべてのコンテナは、コンピュートセッションを作成するときに指定された同じデータフォルダーをマウントします。
ko_kr: 모든 구성 컨테이너는 연산 세션 생성 시 지정한 데이터 폴더를 동일하게 마운트 합니다.
th: ทุกคอนเทนเนอร์ภายใต้เซสชันคลัสเตอร์จะทำการจัดเก็บข้อมูลในโฟลเดอร์เดียวกันที่กำหนดไว้เมื่อสร้างเซสชันการคำนวณ

source: All containers under a cluster session are tied to a private network.
ja: クラスターセッション下のすべてのコンテナはプライベートネットワークに結びつけられます。
ko_kr: 모든 구성 컨테이너는 사설 네트워크로 묶입니다.
th: คอนเทนเนอร์ทั้งหมดภายใต้เซสชันคลัสเตอร์เชื่อมโยงกับเครือข่ายส่วนบุคคล

source: The name of the main container is ``main1``.
ja: メインコンテナの名前は ``main1`` です。
ko_kr: 메인 컨테이너의 이름은 ``main1`` 이 됩니다.
th: ชื่อของคอนเทนเนอร์หลักคือ ``main1``.

source: Sub-containers are named as ``sub1``, ``sub2``, ... in the increasing order.
ja: サブコンテナは、増加順に ``sub1``、``sub2``、... と名付けられます。
ko_kr: 서브 컨테이너의 이름은 ``sub1``, ``sub2``, … 와 같은 순서로 지어집니다.
th: ชื่อของซับคอนเทนเนอร์คือ ``sub1``, ``sub2``, ... ตามลำดับที่เพิ่มขึ้น

source: There is no firewall between the containers that make up a cluster session.
ja: クラスターセッションを構成するコンテナ間にファイアウォールはありません。
ko_kr: 한 클러스터 세션을 구성하는 컨테이너 사이에는 별도의 방화벽이 없습니다.
th: ไม่มีไฟร์วอลล์ระหว่างคอนเทนเนอร์ที่ประกอบเป็นเซสชันคลัสเตอร์

source: Users can directly connect to the main container, and sub-containers can only be connected from the main container.
ja: ユーザーはメインコンテナに直接接続でき、サブコンテナにはメインコンテナからのみ接続できます。
ko_kr: 사용자는 메인 컨테이너에 직접 접속할 수 있으며, 서브 컨테이너는 메인 컨테이너에 먼저 접속한 후 메인 컨테이너 내에서 접속할 수 있습니다.
th: ผู้ใช้สามารถเชื่อมต่อกับคอนเทนเนอร์หลักได้โดยตรง และคอนเทนเนอร์ย่อยสามารถเชื่อมต่อได้เฉพาะจากคอนเทนเนอร์หลักเท่านั้น

source: There are two modes/types of cluster session.
ja: クラスタセッションには、2つのモード/タイプがあります。
ko_kr: 두 가지 모드/형태의 클러스터 세션이 있습니다.
th: มีสองโหมด/ประเภทของเซสชันคลัสเตอร์

source: Single node cluster session: A cluster session composed of two or more containers on one, same agent node. In the figure above, this is session Z, which is bound to a local bridge network.
ja: 単一ノードクラスターセッション: 1つの同一のエージェントノード上で2つ以上のコンテナから構成されるクラスターセッション。上の図では、これはローカルブリッジネットワークにバインドされたセッションZです。
ko_kr: 단일 노드 클러스터 세션: 하나의 Agent 노드에서 두 개 이상의 컨테이너를 묶어 구성한 클러스터 세션입니다. 위 그림에서는 session Z가 이에 해당하며 로컬 브릿지 네트워크로 묶입니다.
th: เซสชันคลัสเตอร์แบบโหนดเดียว: เซสชันคลัสเตอร์ที่ประกอบด้วยสองหรือมากกว่าคอนเทนเนอร์บนโหนดเอเจนต์เดียวกัน ในภาพด้านบน นี่คือเซสชัน Z ซึ่งถูกผูกกับเครือข่ายสะพานท้องถิ่น

source: Multi-node cluster session: A cluster session composed of two or more containers on different Agent nodes. In the picture above, this is session X, which is bound to an overlay network.
ja: マルチノードクラスターセッション: 異なるエージェントノード上の2つ以上のコンテナで構成されるクラスターセッション。上の図では、これはオーバーレイネットワークにバインドされているセッションXです。
ko_kr: 멀티 노드 클러스터 세션: 두 개 이상의 컨테이너를 서로 다른 Agent 노드에 배치해서 구성한 클러스터 세션입니다. 위 그림에서는 session X가 이에 해당하며, 오버레이 네트워크로 묶입니다.
th: เซสชันคลัสเตอร์หลายโหนด: เซสชันคลัสเตอร์ที่ประกอบด้วยสองหรือมากกว่าคอนเทนเนอร์ต่างโหนดเอเจนต์ ในภาพด้านบน นี่คือเซสชัน X ซึ่งผูกติดกับเครือข่ายแบบโอเวอร์เลย์

source: A compute session with only one container is classified as normal compute session, not a cluster session. In the figure above, this is session Y.
ja: 1 つのコンテナしかない計算セッションは、クラスタセッションではなく通常の計算セッションとして分類されます。上の図では、これがセッション Y です。
ko_kr: 하나의 컨테이너를 가지는 연산 세션은 클러스터 세션이 아닌 일반 연산 세션으로 분류합니다. 위 그림에서는 session Y가 이에 해당합니다.
th: เซสชันการคอมพิวเตอร์ที่มีเพียงหนึ่งคอนเทนเนอร์จะถูกจำแนกเป็นเซสชันคอมพิวเตอร์ปกติ ไม่ใช่เซสชันคลัสเตอร์ ในรูปด้านบน เซสชันนี้คือเซสชัน Y.

source: A single node cluster session is created in the following cases.
ja: 単一ノードクラスターセッションは、以下の場合に作成されます。
ko_kr: 다음과 같은 경우에는 단일 노드 클러스터 세션이 생성됩니다.
th: เซสชันคลัสเตอร์โหนดเดียวจะสร้างขึ้นในกรณีต่อไปนี้

source: When "Single Node" is selected for Cluster mode field when creating a compute session. If there is no single agent with enough resources to create all containers at the same time, the session will stay in a pending (``PENDING``) state.
ja: コンピュートセッションを作成する際にクラスターモードフィールドで「シングルノード」が選択された場合、すべてのコンテナを同時に作成するのに十分なリソースを持つ単一のエージェントが存在しない場合、セッションは保留中（``PENDING``）の状態のままになります。
ko_kr: 연산 세션 생성 시 Cluster mode에 “Single Node”를 선택한 경우. 모든 컨테이너를 동시에 생성할 수 있는 자원을 가진 단일 Agent가 없으면, 해당 세션 생성 작업은 대기(``PENDING``) 상태로 머무르게 됩니다.
th: เมื่อเลือก "Single Node" สำหรับฟิลด์โหมดคลัสเตอร์เมื่อสร้างเซสชันการประมวลผล หากไม่มีตัวแทนเดียวที่มีทรัพยากรเพียงพอในการสร้างคอนเทนเนอร์ทั้งหมดในเวลาเดียวกัน เซสชันจะอยู่ในสถานะรอ (``PENDING``)

source: “Multi Node” is selected for Cluster mode, but there is a single agent with enough resources that can create all containers at the same time, then, all containers are deployed on that agent. This is to reduce network latency as much as possible by excluding external network access.
ja: 「マルチノード」がクラスター モードとして選択されているが、全てのコンテナを同時に作成できる十分なリソースを持つ単一のエージェントが存在する場合、全てのコンテナはそのエージェントにデプロイされる。これは外部ネットワークへのアクセスを排除し、ネットワーク遅延を可能な限り削減するためである。
ko_kr: 연산 세션 생성 시 Cluster mode에 “Multi Node”를 선택했으나, 모든 컨테이너를 동시에 생성할 수 있는 자원을 가진 단일 Agent가 있을 경우, 그 Agent에 모든 컨테이너를 배치합니다. 이는 가능한 외부 네트워크를 배제하여 연산 세션을 구성하여 네트워크 지연시간을 줄기 위함입니다.
th: “โหมดคลัสเตอร์” ถูกเลือกเป็น “หลายโหนด” แต่มีเอเจนต์เดียวที่มีทรัพยากรเพียงพอที่สามารถสร้างคอนเทนเนอร์ทั้งหมดได้พร้อมกัน ดังนั้น คอนเทนเนอร์ทั้งหมดจะถูกปรับใช้ในเอเจนต์นั้น เพื่อที่จะลดความหน่วงของเครือข่ายให้มากที่สุดโดยการไม่ให้เข้าถึงเครือข่ายภายนอก

source: Each container in a cluster session has the following environment variables. You can refer to it to check the cluster configuration and currently connected container information.
ja: クラスターセッション内の各コンテナには、以下の環境変数があります。これを参照してクラスターの構成や現在接続されているコンテナ情報を確認することができます。
ko_kr: 클러스터 세션의 각 컨테이너에는 다음과 같은 환경 변수가 지정됩니다. 클러스터 및 현재 접속된 컨테이너 정보를 확인하기 위해서 참고할 수 있습니다.
th: แต่ละคอนเทนเนอร์ในเซสชันคลัสเตอร์มีตัวแปรสภาพแวดล้อมดังต่อไปนี้ คุณสามารถอ้างถึงมันเพื่อตรวจสอบการกำหนดค่าคลัสเตอร์และข้อมูลคอนเทนเนอร์ที่เชื่อมต่ออยู่ในปัจจุบัน

source: ``BACKENDAI_CLUSTER_HOST``: the name of the current container (ex. ``main1``)
ja: ``BACKENDAI_CLUSTER_HOST``: 現在のコンテナの名前（例: ``main1``）
ko_kr: ``BACKENDAI_CLUSTER_HOST``: 현재 컨테이너의 이름 (ex. ``main1``)
th: ``BACKENDAI_CLUSTER_HOST``: ชื่อของคอนเทนเนอร์ปัจจุบัน (เช่น ``main1``)

source: ``BACKENDAI_CLUSTER_HOSTS``: Names of all containers belonging to the current cluster session (ex. ``main1,sub1,sub2``)
ja: ``BACKENDAI_CLUSTER_HOSTS``: 現在のクラスターセッションに属するすべてのコンテナの名前（例：``main1,sub1,sub2``）
ko_kr: ``BACKENDAI_CLUSTER_HOSTS``: 현재 클러스터 세션에 속한 모든 컨테이너의 이름 (ex. ``main1,sub1,sub2``)
th: ``BACKENDAI_CLUSTER_HOSTS``: ชื่อของคอนเทนเนอร์ทั้งหมดที่เป็นของเซสชันคลัสเตอร์ปัจจุบัน (เช่น ``main1,sub1,sub2``)

source: ``BACKENDAI_CLUSTER_IDX``: numeric index of the current container (ex. ``1``)
ja: ``BACKENDAI_CLUSTER_IDX``: 現在のコンテナの数値インデックス (例: ``1``)
ko_kr: ``BACKENDAI_CLUSTER_IDX``: 현재 컨테이너의 숫자 인덱스 (ex. ``1``)
th: ``BACKENDAI_CLUSTER_IDX``: ดัชนีเชิงตัวเลขของคอนเทนเนอร์ปัจจุบัน (เช่น ``1``)

source: ``BACKENDAI_CLUSTER_MODE``: Cluster session mode/type (ex. ``single-node``)
ja: ``BACKENDAI_CLUSTER_MODE``：クラスタセッションモード/タイプ（例：``single-node``）
ko_kr: ``BACKENDAI_CLUSTER_MODE``: 클러스터 세션의 모드/형태 (ex. ``single-node``)
th: ``BACKENDAI_CLUSTER_MODE``: โหมด/ประเภทเซสชันของคลัสเตอร์ (เช่น ``single-node``)

source: ``BACKENDAI_CLUSTER_ROLE``: Type of current container (ex. ``main``)
ja: ``BACKENDAI_CLUSTER_ROLE``: 現在のコンテナのタイプ（例: ``main``）
ko_kr: ``BACKENDAI_CLUSTER_ROLE``: 현재 컨테이너의 종류 (ex. ``main``)
th: ``BACKENDAI_CLUSTER_ROLE``: ประเภทของคอนเทนเนอร์ปัจจุบัน (เช่น ``main``)

source: ``BACKENDAI_CLUSTER_SIZE``: Total number of containers belonging to the current cluster session (ex. ``4``)
ja: ``BACKENDAI_CLUSTER_SIZE``: 現在のクラスタセッションに属するコンテナの総数（例：``4``）
ko_kr: ``BACKENDAI_CLUSTER_SIZE``: 현재 클러스터 세션에 속한 컨테이너의 총 수 (ex. ``4``)
th: ``BACKENDAI_CLUSTER_SIZE``: จำนวนรวมของคอนเทนเนอร์ที่เป็นของเซสชันคลัสเตอร์ปัจจุบัน (เช่น ``4``)

source: ``BACKENDAI_KERNEL_ID``: ID of the current container (ex. ``3614fdf3-0e04-...``)
ja: ``BACKENDAI_KERNEL_ID``: 現在のコンテナのID（例：``3614fdf3-0e04-...``）
ko_kr: ``BACKENDAI_KERNEL_ID``: 현재 컨테이너의 ID (ex. ``3614fdf3-0e04-…``)
th: ``BACKENDAI_KERNEL_ID``: รหัสของคอนเทนเนอร์ปัจจุบัน (เช่น ``3614fdf3-0e04-...``)

source: ``BACKENDAI_SESSION_ID``: ID of the cluster session to which the current container belongs (ex. ``3614fdf3-0e04-...``). The main container's ``BACKENDAI_KERNEL_ID`` is the same as ``BACKENDAI_SESSION_ID``.
ja: ``BACKENDAI_SESSION_ID``: 現在のコンテナが属するクラスターセッションのID (例: ``3614fdf3-0e04-...``)。メインコンテナの ``BACKENDAI_KERNEL_ID`` は ``BACKENDAI_SESSION_ID`` と同じです。
ko_kr: ``BACKENdAI_SESSION_ID``: 현재 컨테이너가 속한 클러스터 세션의 ID (ex. ``3614fdf3-0e04-…``). 메인 컨테이너의 ``BACKENDAI_KERNEL_ID`` 는 ``BACKENDAI_SESSION_ID`` 와 같습니다.
th: ``BACKENDAI_SESSION_ID``: รหัสของเซสชันคลัสเตอร์ที่คอนเทนเนอร์ปัจจุบันเป็นสมาชิกอยู่ (เช่น ``3614fdf3-0e04-...``) รหัส ``BACKENDAI_KERNEL_ID`` ของคอนเทนเนอร์หลักจะเหมือนกับ ``BACKENDAI_SESSION_ID``.

source: Use of Backend.AI cluster compute session
ja: Backend.AI クラスターコンピュートセッションの使用
ko_kr: Backend.AI 클러스터 연산 세션의 사용

source: In this section, we will take a look at how to actually create and use cluster compute sessions through the user GUI.
ja: このセクションでは、ユーザーGUIを通じて実際にクラスタコンピュートセッションを作成および使用する方法を見ていきます。
ko_kr: 이번 절에서는 실제로 사용자 GUI를 통해 클러스터 연산 세션을 생성하고 사용하는 법에 관해 알아보겠습니다.
th: ในส่วนนี้ เราจะดูว่าจริง ๆ แล้วจะสร้างและใช้เซสชันการคำนวณคลัสเตอร์ผ่าน GUI ของผู้ใช้ได้อย่างไร

source: In the Sessions page, open the session creation dialog and set it in the same way as creating a normal compute session. The amount of resources set at this time is the amount allocated to **one container**. For example, if you set 4 CPUs, 4 cores are allocated to each container under a cluster session. Please note that this is not the amount of resources allocated to entire cluster computing session. To create a cluster compute session, server resources equal to N times the amount of resources set here are required (N is the cluster size). Also, don't forget to mount the data folder for data safekeeping.
ja: セッションページで、セッション作成ダイアログを開き、通常の計算セッションを作成するのと同じ方法で設定します。このときに設定するリソース量は、**1つのコンテナ**に割り当てられる量です。例えば、4つのCPUを設定した場合、クラスタセッションの下で各コンテナに4コアが割り当てられます。これは、クラスタ計算セッション全体に割り当てられるリソース量ではないことに注意してください。クラスタ計算セッションを作成するには、ここで設定したリソース量のN倍に相当するサーバーリソースが必要です（Nはクラスタのサイズです）。データの安全保存のためにデータフォルダーをマウントすることを忘れないでください。
ko_kr: Sessions 페이지에서 연산 세션 생성 다이얼로그를 띄운 후 일반 연산 세션을 생성하는 것과 같은 방식으로 설정합니다. 이 때 설정한 자원의 양은 하나의 **컨테이너에** 할당되는 양입니다. 예를 들어, CPU를 4개로 설정한 경우 클러스터 세션을 구성하는 각 컨테이너에 4 코어 CPU가 할당됩니다. 클러스터 연산 세션 전체에 할당되는 자원 양이 아니라는 점에 유의 하십시오. 클러스터 연산 세션을 생성하기 위해서는 여기서 설정한 자원양의 N배에 해당하는 서버 자원이 필요합니다 (N은 클러스터 크기). 데이터 보존을 위해 데이터 폴더를 마운트 하는 것도 잊지 마십시오.
th: ในหน้าสมาชิก ให้เปิดกล่องสร้างเซสชันและตั้งค่าในลักษณะเดียวกับการสร้างเซสชันการคอมพิวเตอร์ปกติ จำนวนทรัพยากรที่ตั้งค่าในครั้งนี้คือจำนวนที่จัดสรรให้กับ **หนึ่งคอนเทนเนอร์** ตัวอย่างเช่น หากคุณตั้งค่า 4 CPUs จะมีการจัดสรร 4 คอร์ให้กับแต่ละคอนเทนเนอร์ภายใต้เซสชันคลัสเตอร์ โปรดทราบว่านี่ไม่ใช่จำนวนทรัพยากรที่จัดสรรให้กับเซสชันการคอมพิวเตอร์คลัสเตอร์ทั้งหมด สำหรับการสร้างเซสชันการคอมพิวเตอร์คลัสเตอร์ ต้องการทรัพยากรเซิร์ฟเวอร์เท่ากับ N เท่าของจำนวนทรัพยากรที่ตั้งค่าไว้ที่นี่ (N คือขนาดของคลัสเตอร์) นอกจากนี้ยังอย่าลืมเชื่อมต่อโฟลเดอร์ข้อมูลสำหรับการเก็บรักษาข้อมูลอีกด้วย

source: In the "Cluster mode" field at the bottom, you can choose what type of cluster you want to create.
ja: 下部にある「クラスターモード」フィールドで、作成したいクラスターのタイプを選択できます。
ko_kr: 아래쪽에 있는 “Cluster mode” 필드에서 원하는 클러스터 생성 형태를 결정할 수 있습니다.
th: ในฟิลด์ "โหมดคลัสเตอร์" ที่ด้านล่าง คุณสามารถเลือกประเภทของคลัสเตอร์ที่คุณต้องการสร้างได้

source: Single Node: All containers are created on one Agent node.
ja: 単一ノード: すべてのコンテナは1つのエージェントノード上に作成されます。
ko_kr: Single Node: 모든 구성 컨테이너는 하나의 Agent 노드에 생성 됩니다.
th: โหนดเดียว: ทุกคอนเทนเนอร์จะถูกสร้างขึ้นบนโหนดเอเยนต์เดียว

source: Multi Node: Containers are created across multiple Agent nodes within a resource group. However, if all containers can be created in one agent node, all of them are created on that node. This is to minimize network latency between the containers.
ja: マルチノード：コンテナはリソースグループ内の複数のエージェントノードにわたって作成されます。ただし、すべてのコンテナを1つのエージェントノードで作成できる場合は、すべてそのノード上で作成されます。これはコンテナ間のネットワーク遅延を最小限に抑えるためです。
ko_kr: Multi Node: 구성 컨테이너는 자원 그룹 내에 있는 여러 Agent 노드에 걸쳐 생성됩니다. 다만, 모든 컨테이너가 하나의 Agent 노드에 생성될 수 있는 경우에는, 하나의 Agent 노드에 우선 생성합니다. 이는 컨테이너 간 통신 과정에서 네트워크 지연 시간을 최대한 줄이기 위함입니다.
th: Multi Node: คอนเทนเนอร์จะถูกสร้างขึ้นทั่วทั้งหลายโหนดของเอเจนต์ภายในกลุ่มทรัพยากร อย่างไรก็ตาม หากคอนเทนเนอร์ทั้งหมดสามารถสร้างขึ้นในโหนดเอเจนต์เดียวได้ คอนเทนเนอร์ทั้งหมดจะถูกสร้างในโหนดนั้น เพื่อช่วยลดเวลาล่าช้าของเครือข่ายระหว่างคอนเทนเนอร์

source: Set the "Cluster size" below it. If set to 3, a total of three containers will be created including the main container. These three containers are bound under a private network to form one compute session.
ja: その下の「クラスターサイズ」を設定します。3に設定すると、メインコンテナを含む合計3つのコンテナが作成されます。これらの3つのコンテナは、プライベートネットワークで結合され、1つの計算セッションを形成します。
ko_kr: 그 아래에 있는 “Cluster size”를 설정합니다. 3으로 설정할 경우, 메인 컨테이너를 포함해서 총 세 개의 컨테이너가 생성됩니다. 이 세 개의 컨테이너는 사설 네트워크로 묶여 하나의 연산 세션을 구성합니다.
th: ตั้งค่า "ขนาดคลัสเตอร์" ด้านล่าง หากตั้งค่าเป็น 3 จะมีการสร้างคอนเทนเนอร์ทั้งหมดสามตัวรวมถึงคอนเทนเนอร์หลัก คอนเทนเนอร์ทั้งสามนี้จะถูกผูกไว้ภายใต้เครือข่ายส่วนตัวเพื่อสร้างเซสชันการคำนวณหนึ่งเซสชัน

source: Click the LAUNCH button to send a request to create a compute session, and wait for a while to get a cluster session. In the Session Info column, make sure there is a "Single-node" or "Multi-node" tag indicating the number of containers.
ja: LAUNCH ボタンをクリックして、コンピュートセッションの作成をリクエストし、クラスタセッションが取得されるまでしばらく待ちます。Session Info 列で、コンテナの数を示す "Single-node" または "Multi-node" タグがあることを確認してください。
th: คลิกที่ปุ่ม LAUNCH เพื่อส่งคำร้องขอสร้างเซสชันการประมวลผล และรอสักครู่เพื่อรับเซสชันคลัสเตอร์ ในคอลัมน์ข้อมูลเซสชัน ให้ตรวจสอบว่ามีแท็ก "Single-node" หรือ "Multi-node" แสดงถึงจำนวนคอนเทนเนอร์

source: Let's open the terminal app in the compute session we just have created. If you look up the environment variables, you can see that the ``BACKENDAI_CLUSTER_*`` variables described in the above section are set. Compare the meaning and value of each environment variable with the description above.
ja: 作成したコンピュートセッションでターミナルアプリを開きましょう。環境変数を調べてみると、上記のセクションで説明した``BACKENDAI_CLUSTER_*``変数が設定されていることがわかります。それぞれの環境変数の意味と値を上記の説明と比較してください。
ko_kr: 생성한 연산 세션에서 터미널 앱을 열어 보겠습니다. 환경 변수를 조회해보면 윗 절에서 설명한 ``BACKENDAI_CLUSTER_*`` 변수가 설정된 것을 확인할 수 있습니다. 각 환경 변수의 의미와 값을 위 설명과 대조해 보십시오.
th: มาเปิดแอปเทอร์มินัลในเซสชันการคอมพิวเตอร์ที่เรเพิ่งสร้างขึ้น หากคุณตรวจสอบตัวแปรสภาพแวดล้อม คุณจะเห็นว่า ตัวแปร ``BACKENDAI_CLUSTER_*`` ที่กล่าวถึงในส่วนข้างต้นถูกตั้งค่าไว้ เปรียบเทียบความหมายและค่าของแต่ละตัวแปรสภาพแวดล้อมกับคำอธิบายข้างต้น

source: You can also SSH into the ``sub1`` container. No separate SSH setting is required, just issue the command ``ssh sub1`` and you are done. You can see the hostname after ``work@`` has changed, which indicated the sub container's shell is displayed.
ja: ``sub1`` コンテナに SSH することも可能です。特別な SSH 設定は不要で、単にコマンド ``ssh sub1`` を実行すれば完了です。``work@`` の後のホスト名が変わったことが分かり、サブコンテナのシェルが表示されていることを示します。
ko_kr: ``sub1`` 컨테이너로 SSH 접속을 할 수도 있습니다. 별도의 SSH 설정 없이 ``ssh sub1`` 이라는 명령만 내리면 끝입니다. ``work@`` 뒤의 호스트 이름이 변한 것을 볼 수 있습니다. sub1 컨테이너의 쉘로 접속한 것입니다.
th: คุณยังสามารถ SSH เข้าไปในคอนเทนเนอร์ ``sub1`` ไม่มีการตั้งค่า SSH แยกต่างหากที่จำเป็น เพียงแค่ใช้คำสั่ง ``ssh sub1`` และคุณก็เสร็จสิ้น คุณจะเห็นชื่อโฮสต์หลังจาก ``work@`` เปลี่ยนไป ซึ่งบ่งชี้ว่าเชลล์ของซับคอนเทนเนอร์ถูกแสดงอยู่

source: In this way, Backend.AI makes it easy to create cluster computing sessions. In order to execute distributed learning and calculation through a cluster calculation session, a distributed learning module provided by ML libraries such as TensorFlow/PyTorch, or additional supporting software such as Horovod, NNI, MLFlow, etc. is required, and code in a way that can utilize the software. Must be written carefully. Backend.AI provides a kernel image containing the software required for distributed learning, so you can use that image to create a nice distributed learning algorithm.
ja: このように、Backend.AI はクラスタコンピューティングセッションの作成を容易にします。クラスタ計算セッションを通じて分散学習と計算を実行するには、TensorFlow/PyTorch などの ML ライブラリが提供する分散学習モジュールや、Horovod、NNI、MLFlow などの追加のサポートソフトウェアが必要であり、そのソフトウェアを利用できる方法でコードを記述する必要があります。慎重に書く必要があります。Backend.AI は分散学習に必要なソフトウェアを含むカーネルイメージを提供しているため、そのイメージを使用して優れた分散学習アルゴリズムを作成することができます。
ko_kr: 이런 방식으로 Backend.AI 에서는 클러스터 연산 세션을 손쉽게 생성할 수 있습니다. 클러스터 연산 세션을 통해 분산 학습 및 연산을 실행하기 위해서는, TensorFlow/PyTorch 등 ML 라이브러리에서 제공하는 분산 학습용 모듈이나 Horovod, NNI, MLFlow 등과 같은 별도의 지원 소프트웨어가 필요하고, 해당 소프트웨어을 활용할 수 있는 방식으로 코드를 주의깊게 작성해야 합니다. Backend.AI에서는 분산 학습에 필요한 소프트웨어를 포함하는 커널 이미지를 제공하고 있으므로, 해당 이미지를 사용해서 멋진 분산 학습 알고리즘을 만들어 보실 수 있습니다.

source: See logs per container
ja: コンテナごとのログを表示
ko_kr: 컨테이너 별 로그 확인하기
th: ดูบันทึกต่อคอนเทนเนอร์

source: From 24.03, You can check each log of container in logs modal. It will help you to understand what's going on not only in ``main`` container but also ``sub`` containers.
ja: 24.03から、ログモーダルでコンテナごとにログを確認できます。これにより、``main`` コンテナだけでなく、``sub`` コンテナで何が起こっているかを理解するのに役立ちます。
ko_kr: 24.03 부터는 컨테이너 로그 다이얼로그에서 각 컨테이너별 로그를 확인할 수 있습니다. 'main' 컨테이너 뿐만 아니라 'sub' 컨테이너에서 어떤 일이 일어나고 있는지 더 쉽게 확인할 수 있습니다.
th: ตั้งแต่วันที่ 24.03 คุณสามารถตรวจสอบบันทึกของแต่ละคอนเทนเนอร์ในโมดัลบันทึกได้ ซึ่งจะช่วยให้คุณเข้าใจสิ่งที่กำลังเกิดขึ้นไม่เฉพาะในคอนเทนเนอร์ ``main`` แต่ยังรวมถึงคอนเทนเนอร์ ``sub`` ด้วย

source: Log modal per container
ja: コンテナごとのログモーダル
th: ล็อกโมดัลต่อคอนเทนเนอร์

source: GPU Platform Cluster Compute Session
th: เซสชันการคอมพิวเตอร์คลัสเตอร์ GPU Platform

source: Cluster compute session feature is supported from GPU Platform server 20.09 or higher.
th: ฟีเจอร์เซสชันการคอมพิวเตอร์คลัสเตอร์ได้รับการสนับสนุนตั้งแต่เซิร์ฟเวอร์ GPU Platform 20.09 ขึ้นไป

source: Overview of GPU Platform cluster compute session
th: ภาพรวมของเซสชันการคำนวณคลัสเตอร์ GPU Platform

source: GPU Platform supports cluster compute session to support distributed computing / training tasks. A cluster session consists of multiple containers, each of which is created across multiple Agent nodes. Containers under a cluster session are automatically connected each other through a dynamically-created private network. Temporary domain names (``main1``, ``sub1``, ``sub2``, etc.) are also given, making it simple to execute networking tasks such as SSH connection. All the necessary secret keys and various settings for SSH connection between containers are automatically generated.
th: GPU Platform รองรับการทำงานแบบคลัสเตอร์เพื่อสนับสนุนการคอมพิวเตอร์ / งานฝึกสอนแบบกระจาย งานเซสชันคลัสเตอร์ประกอบด้วยคอนเทนเนอร์หลายตัว ซึ่งแต่ละตัวถูกสร้างขึ้นจากหลายโหนดตัวแทน คอนเทนเนอร์ภายใต้เซสชันคลัสเตอร์จะถูกเชื่อมต่อกันโดยอัตโนมัติผ่านเครือข่ายส่วนตัวที่สร้างขึ้นแบบไดนามิก ชื่อโดเมนชั่วคราว (``main1``, ``sub1``, ``sub2``, เป็นต้น) ยังได้รับการจัดสรรทำให้การดำเนินงานด้านเครือข่ายเช่นการเชื่อมต่อ SSH เป็นเรื่องง่าย คีย์ลับที่จำเป็นทั้งหมดและการตั้งค่าต่างๆ สำหรับการเชื่อมต่อ SSH ระหว่างคอนเทนเนอร์จะถูกสร้างขึ้นโดยอัตโนมัติ

source: For detailed about GPU Platform cluster session, refer to the following.
th: สำหรับรายละเอียดเกี่ยวกับเซสชันของคลัสเตอร์ GPU Platform โปรดดูที่ด้านล่างนี้

source: Use of GPU Platform cluster compute session
th: การใช้เซสชันการคอมพิวเตอร์ของคลัสเตอร์ GPU Platform

source: In this way, GPU Platform makes it easy to create cluster computing sessions. In order to execute distributed learning and calculation through a cluster calculation session, a distributed learning module provided by ML libraries such as TensorFlow/PyTorch, or additional supporting software such as Horovod, NNI, MLFlow, etc. is required, and code in a way that can utilize the software. Must be written carefully. GPU Platform provides a kernel image containing the software required for distributed learning, so you can use that image to create a nice distributed learning algorithm.
th: ด้วยวิธีนี้ GPU Platform ทำให้การสร้างเซสชันการคอมพิวเตอร์แบบคลัสเตอร์เป็นเรื่องง่าย เพื่อให้สามารถดำเนินการเรียนรู้และการคำนวณแบบกระจายผ่านเซสชันการคำนวณแบบคลัสเตอร์ จำเป็นต้องใช้โมดูลการเรียนรู้แบบกระจายที่จัดเตรียมโดยไลบรารี ML เช่น TensorFlow/PyTorch หรือซอฟต์แวร์สนับสนุนเพิ่มเติม เช่น Horovod, NNI, MLFlow เป็นต้น และต้องเขียนโค้ดในลักษณะที่สามารถใช้ซอฟต์แวร์ได้อย่างระมัดระวัง GPU Platform มีภาพเคอร์เนลที่มีซอฟต์แวร์ที่จำเป็นสำหรับการเรียนรู้แบบกระจาย ดังนั้นคุณจึงสามารถใช้ภาพนั้นในการสร้างอัลกอริธึมการเรียนรู้แบบกระจายที่ดีได้

source: Click the LAUNCH button to send a request to create a compute session, and wait for a while to get a cluster session. After the session is created, you can view the created containers on the session details page.
ko_kr: LAUNCH 버튼을 클릭하여 연산 세션 생성 요청을 보내고 잠시 기다리면 클러스터 세션이 생성됩니다. 세션 생성 이후에, 세션 상세 페이지에서 생성된 3개의 컨테이너를 확인할 수 있습니다.
