Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/admin_menu/admin_menu.po
Languages: ja, ko, th

source: In the Configuration page, you can see main settings of Backend.AI server. Currently, it provides several controls which can change and list settings.
ja: 設定ページでは、Backend.AI サーバーの主な設定を確認できます。現在、設定を変更および一覧表示するためのいくつかのコントロールが提供されています。
ko: Configuration 페이지에서 Backend.AI에 설정된 주요 설정값을 조회할 수 있습니다. 현재는 몇가지 변경 기능 및 설정 조회 기능을 제공하고 있습니다.
th: ในหน้าการกำหนดค่า คุณสามารถดูการตั้งค่าหลักของเซิร์ฟเวอร์ Backend.AI ได้ ขณะนี้มีตัวควบคุมหลายอย่างที่สามารถเปลี่ยนแปลงและแสดงการตั้งค่าได้

source: You can change image auto install and update rule by selecting one option from ``Digest``, ``Tag``, ``None``. ``Digest`` is kind of checksum for the image which verifies integrity of the image and also enhances efficiency in downloading images by reusing duplicated layers. ``Tag`` is only for developing option since it does not guarantee the Integrity of the image.
ja: ``Digest``, ``Tag``, ``None`` のオプションのいずれかを選択することで、イメージの自動インストールおよび更新ルールを変更できます。``Digest`` はイメージの整合性を検証し、重複したレイヤーを再利用することでイメージのダウンロード効率を向上させる一種のチェックサムです。``Tag`` は開発時のオプション専用であり、イメージの整合性を保証しません。
ko: 자동 설치 및 업데이트 규칙을 ``Digest``, ``Tag``, ``None`` 중에서 선택할 수 있습니다. ``Digest`` 는 이미지에 대한 checksum 과 같은 것으로, image의 무결성을 검증하고, 중복된 레이어를 재사용함으로써 이미지 다운로드의 효율성을 높이는데에 사용됩니다. ``Tag`` 는 개발용 옵션에만 사용할 수 있는데, 태그는 이미지의 무결성을 보장하지 않기 때문입니다.
th: คุณสามารถเปลี่ยนกฎการติดตั้งและอัปเดตอัตโนมัติของภาพโดยการเลือกหนึ่งตัวเลือกจาก ``Digest``, ``Tag``, ``None``. ``Digest`` เป็นประเภทของ checksum สำหรับภาพซึ่งใช้ตรวจสอบความถูกต้องของภาพและยังช่วยเพิ่มประสิทธิภาพในการดาวน์โหลดภาพโดยการนำชั้นที่ซ้ำกันมาใช้ใหม่ ``Tag`` ใช้เฉพาะสำหรับตัวเลือกการพัฒนาเนื่องจากไม่รับประกันความถูกต้องของภาพ.

source: Don't change rule selection unless you completely understand the meaning of each rule.
ja: 各ルールの意味を完全に理解している場合を除き、ルールの選択を変更しないでください。
ko: 각 규칙에 대해 완전히 이해하고 있지 않는 한 선택된 규칙을 변경하지 마십시오.
th: อย่าเปลี่ยนการเลือกกฎเว้นแต่คุณจะเข้าใจความหมายของแต่ละกฎอย่างสมบูรณ์

source: System setting about image
ja: イメージに関するシステム設定
ko: 이미지 내 자원 제한 값 수정
th: การตั้งค่าระบบเกี่ยวกับภาพ

source: You can also change settings for scaling and plugins.
ja: スケーリングとプラグインの設定も変更できます。
ko: 스케일링과 플러그인에 대한 설정도 변경할 수 있습니다.
th: คุณยังสามารถเปลี่ยนตั้งค่าสำหรับการปรับขนาดและปลั๊กอินได้อีกด้วย

source: System setting about scaling and plugins
ja: スケーリングおよびプラグインに関するシステム設定
ko: 스케일링 및 플러그인 시스템 설정
th: การตั้งค่าระบบเกี่ยวกับการปรับขนาดและปลั๊กอิน

source: When a user launches a multi-node cluster session, which is introduced at version 20.09, Backend.AI will dynamically create an overlay network to support private inter-node communication. Admins can set the value of the Maximum Transmission Unit (MTU) for the overlay network, if it is certain that the value will enhance the network speed.
ja: ユーザーがバージョン20.09で導入されたマルチノードクラスタセッションを起動すると、Backend.AIはプライベートなノード間通信をサポートするためにオーバーレイネットワークを動的に作成します。管理者は、ネットワーク速度が向上することが確実である場合、オーバーレイネットワークの最大伝送単位 (MTU) の値を設定することができます。
ko: 사용자가 멀티 노드 클러스터 세션(Backend.AI 20.09부터 지원)을 생성할 경우, Backend.AI는 노드간 사설 통신을 지원하기 위해 동적으로 오버레이 네트워크(overlay network)를 생성합니다. 이 오버레이 네트워크에서 사용하는 Maximum Transmission Unit (MTU) 값을 설정할 수 있습니다. 다만, 이 값이 네트워크 성능을 향상시키는 것이 확실할 때만 설정하십시오.
th: เมื่อผู้ใช้เริ่มเซสชันคลัสเตอร์หลายโหนด ซึ่งถูกนำเสนอในเวอร์ชัน 20.09, Backend.AI จะสร้างเครือข่าย overlay ขึ้นมาโดยอัตโนมัติเพื่อสนับสนุนการสื่อสารระหว่างโหนดแบบส่วนตัว ผู้ดูแลระบบสามารถตั้งค่าค่าหน่วยการส่งสูงสุด (MTU) สำหรับเครือข่าย overlay ได้ หากมั่นใจว่าค่านั้นจะช่วยเพิ่มความเร็วของเครือข่าย

source: Overlay network setting dialog
ja: オーバーレイネットワーク設定ダイアログ
th: กล่องสนทนาการตั้งค่าเครือข่ายโอเวอร์เลย์

source: For more information about Backend.AI Cluster session, please refer to :ref:`Backend.AI Cluster Compute Session<backendai-cluster-compute-session>` section.
ja: Backend.AI クラスターセッションの詳細については、:ref:`Backend.AI クラスターコンピュートセッション<backendai-cluster-compute-session>` セクションを参照してください。
ko: Backend.AI 클러스터 세션에 대해 더 자세한 정보를 확인하시려면, :ref:`Backend.AI 클러스터 연산 세션<backendai-cluster-compute-session>` 섹션을 참고하십시오.
th: สำหรับข้อมูลเพิ่มเติมเกี่ยวกับเซสชัน Backend.AI Cluster โปรดอ้างถึง :ref:`Backend.AI Cluster Compute Session<backendai-cluster-compute-session>` ส่วนนี้

source: You can edit the configuration per job scheduler by clicking the Scheduler's config button. The values in the scheduler setting are the defaults to use when there is no scheduler setting in each :ref:`resource group<scheduling-methods>`. If there is a resource group-specific setting, this value will be ignored.
ja: スケジューラーの設定ボタンをクリックすることで、各ジョブスケジューラーごとの設定を編集できます。スケジューラー設定内の値は、各 :ref:`resource group<scheduling-methods>` にスケジューラー設定がない場合に使用されるデフォルトです。リソースグループ固有の設定がある場合、この値は無視されます。
ko: Scheduler의 설정(CONFIG) 버튼을 누르면 스케줄러 별 설정을 할 수 있습니다. 스케줄러 별 설정값은 :ref:`자원 그룹<scheduling-methods>` 의 스케줄러 설정값이 없을 때 사용하는 기본 값을 의미합니다. 자원 그룹에 설정한 값이 있을 경우, 이 값은 무시됩니다.
th: คุณสามารถแก้ไขการตั้งค่าตามตัวจัดตารางงานแต่ละตัวได้โดยคลิกที่ปุ่มการตั้งค่าของตัวจัดตารางงาน ค่าในการตั้งค่าตัวจัดตารางงานจะเป็นค่าเริ่มต้นที่ใช้เมื่อไม่มีการตั้งค่าตัวจัดตารางงานในแต่ละ :ref:`resource group<scheduling-methods>` หากมีการตั้งค่าเฉพาะสำหรับกลุ่มทรัพยากร ค่านี้จะถูกละเว้น

source: Currently supported scheduling methods include ``FIFO``, ``LIFO``, and ``DRF``. Each method of scheduling is exactly the same as the :ref:`scheduling methods<scheduling-methods>` above. Scheduler options include session creation retries. Session creation retries refers to the number of retries to create a session if it fails. If the session cannot be created within the trials, the request will be ignored and Backend.AI will process the next request. Currently, changes are only possible when the scheduler is FIFO.
ja: 現在サポートされているスケジューリングメソッドには、``FIFO``、``LIFO``、および ``DRF`` が含まれます。各スケジューリングメソッドは、上記の :ref:`scheduling methods<scheduling-methods>` と全く同じです。スケジューラーオプションには、セッション作成の再試行が含まれています。セッション作成の再試行とは、セッションの作成に失敗した場合に再試行する回数を指します。試行回数内にセッションを作成できない場合、リクエストは無視され、Backend.AIは次のリクエストを処理します。現在、変更はスケジューラーがFIFOのときのみ可能です。
ko: 현재 지원하는 스케줄링 방법에는 ``FIFO``, ``LIFO``, ``DRF`` 가 있습니다. 각 스케줄링 방법은 위의 :ref:`스케줄링 방법<scheduling-methods>` 과 동일합니다. 스케줄러 옵션에는 세션 재시도 횟수가 있습니다. 세션 재시도 횟수란 세션 생성이 실패한 경우 세션 생성을 재시도 하는 횟수를 말합니다. 만약 지정한 횟수 안에 세션 생성을 하지 못하는 경우 해당 요청을 무시하고 다음 요청을 처리합니다. 현재는 스케줄러가 FIFO일 때만 가능합니다.
th: ในปัจจุบันวิธีการจัดตารางเวลาที่รองรับได้แก่ ``FIFO``, ``LIFO`` และ ``DRF`` วิธีการจัดตารางเวลาทั้งหมดนั้นเหมือนกับ :ref:`วิธีการจัดตารางเวลา<scheduling-methods>` ข้างต้น ตัวเลือกสำหรับตัวจัดตารางรวมถึงการลองสร้างเซสชันใหม่ การลองสร้างเซสชันใหม่หมายถึงจำนวนครั้งที่ลองสร้างเซสชันหากการสร้างเซสชันนั้นล้มเหลว หากไม่สามารถสร้างเซสชันได้ภายในจำนวนครั้งที่กำหนด คำร้องจะถูกละเว้นและ Backend.AI จะดำเนินการคำร้องถัดไป ขณะนี้การเปลี่ยนแปลงสามารถทำได้เฉพาะเมื่อตัวจัดตารางเป็น FIFO เท่านั้น

source: System setting dialog scheduler settings
ja: システム設定ダイアログ スケジューラー設定
th: การตั้งค่าตารางการตั้งค่าระบบ

source: We will continue to add broader range of setting controls.
ja: 私たちは引き続き、より幅広い設定コントロールを追加していきます。
ko: 향후 CLI에서 지원하는 다양한 설정 변경 기능을 GUI에도 계속 추가할 예정입니다.
th: เราจะยังคงเพิ่มการควบคุมการตั้งค่าที่หลากหลายมากขึ้นต่อไป

source: System settings are default settings. If resource group has certain value, then it overrides configured value in system settings.
ja: システム設定はデフォルト設定です。リソースグループに特定の値がある場合、それがシステム設定で構成された値を上書きします。
ko: 시스템 설정값은 기본 설정입니다. 자원 그룹에서 특정 값이 설정된 경우, 시스템 설정값이 아닌 자원 그룹 설정값을 적용합니다.
th: การตั้งค่าระบบคือค่าปริยาย หากกลุ่มทรัพยากรมีค่าเฉพาะ ค่าดังกล่าวจะช่วยแทนที่ค่าที่ตั้งค่าไว้ในการตั้งค่าระบบ

source: Server management
ja: サーバー管理
ko: 서버 관리 메뉴
th: การจัดการเซิร์ฟเวอร์

source: Go to the Maintenance page and you will see some buttons to manage the server.
ja: メンテナンスページにアクセスすると、サーバーを管理するためのいくつかのボタンが表示されます。
ko: Maintenance 페이지로 이동하면 서버를 관리할 수 있는 몇 가지 버튼을 볼 수 있습니다.
th: ไปที่หน้าบำรุงรักษาและคุณจะเห็นปุ่มบางปุ่มสำหรับจัดการเซิร์ฟเวอร์

source: RECALCULATE USAGE: Occasionally, due to unstable network connections or container management problem of Docker daemon, there may be a case where the resource occupied by Backend.AI does not match the resource actually used by the container. In this case, click the RECALCULATE USAGE button to manually correct the resource occupancy.
ja: 使用量を再計算: 不安定なネットワーク接続やDockerデーモンのコンテナ管理の問題によって、Backend.AIが占有しているリソースが実際にコンテナで使用されているリソースと一致しない場合があります。この場合、使用量を再計算ボタンをクリックしてリソースの占有状況を手動で修正してください。
ko: RECALCULATE USAGE: 간혹 네트워크 접속이나 도커 데몬의 컨테이너 관리 문제로 컨테이너가 실제로 사용하고 있는 자원과 Backend.AI에서 출력되는 자원 점유량이 일치하지 않는 경우가 있을 수 있습니다. 그 때 RECALCULATE USAGE 버튼을 클릭하면 자원 점유량을 수동 보정할 수 있습니다.
th: การคำนวณการใช้งานใหม่: บางครั้ง เนื่องจากการเชื่อมต่อเครือข่ายที่ไม่เสถียรหรือปัญหาการจัดการคอนเทนเนอร์ของ Docker daemon อาจมีกรณีที่ทรัพยากรที่ถูกใช้โดย Backend.AI ไม่ตรงกับทรัพยากรที่ใช้จริงโดยคอนเทนเนอร์ ในกรณีนี้ให้คลิกที่ปุ่มคำนวณการใช้งานใหม่เพื่อแก้ไขการใช้ทรัพยากรด้วยตนเอง

source: RESCAN IMAGES: Update image meta information from all registered Docker registries. It can be used when a new image is pushed to a Backend.AI-connected docker registry.
ja: RESCAN IMAGES: すべての登録済みDockerレジストリからイメージのメタ情報を更新します。これは、Backend.AIに接続されたdockerレジストリに新しいイメージがプッシュされたときに使用できます。
ko: RESCAN IMAGES: 등록된 모든 도커 레지스트리에서 이미지 메타 정보를 받고 업데이트 합니다. Backend.AI에서 사용 가능한 이미지를 레지스트리에 새로 등록한 경우 사용할 수 있습니다.
th: RESCAN IMAGES: อัปเดตข้อมูลเมตาภาพจาก Docker registries ที่ลงทะเบียนทั้งหมด สามารถใช้ได้เมื่อมีการส่งภาพใหม่ไปยัง docker registry ที่เชื่อมต่อกับ Backend.AI

source: Maintenance page
ja: メンテナンスページ
th: หน้าเมนูบำรุงรักษา

source: We will continue to add other settings needed for management, such as removing unused images or registering periodic maintenance schedules.
ja: 未使用のイメージの削除や定期的なメンテナンススケジュールの登録など、管理に必要な他の設定を追加し続けます。
ko: 사용하지 않는 이미지를 제거하거나, 주기적 관리 일정 등록 등 기타 관리에 필요한 설정이 계속 추가될 예정입니다.
th: เราจะทำการเพิ่มการตั้งค่าอื่น ๆ ที่จำเป็นสำหรับการจัดการ เช่น การลบภาพที่ไม่ได้ใช้งาน หรือการลงทะเบียนตารางการบำรุงรักษาที่เป็นประจำ

source: Detailed Information
ja: 詳細情報
ko: 상세 정보
th: ข้อมูลรายละเอียด

source: In Information page, you can see several detailed information and status of each feature. To see Manager version and API version, check the Core panel. To see whether each component for Backend.AI is compatible or not, check the Component panel.
ja: 情報ページでは、各機能の詳細情報とステータスを確認できます。マネージャのバージョンとAPIバージョンを確認するには、Coreパネルをチェックしてください。Backend.AIの各コンポーネントが互換性があるかどうか確認するには、Componentパネルをチェックしてください。
ko: Information 페이지에서는 여러가지 자세한 정보와 각 기능의 상태를 볼 수 있습니다. 매니저 버전과 API 버전을 보려면 Core 패널을 확인하십시오. Backend.AI를 구성하는 각 컴포넌트의 호환 가능 여부를 보려면 Component 패널을 확인하십시오.
th: ในหน้าข้อมูล คุณสามารถดูข้อมูลรายละเอียดหลายรายการและสถานะของแต่ละฟีเจอร์ได้ สำหรับดูเวอร์ชันของผู้จัดการและเวอร์ชันของ API ให้ตรวจสอบที่แผง Core สำหรับตรวจสอบว่าแต่ละส่วนประกอบของ Backend.AI เข้ากันได้หรือไม่ ให้ตรวจสอบที่แผง Component

source: This page is only for showing current information.
ja: このページは現在の情報を表示するためだけのものです。
ko: 이 페이지는 현재 정보를 보여주기 위한 것입니다.
th: หน้านี้ใช้เพื่อแสดงข้อมูลปัจจุบันเท่านั้น

source: Information page
ja: インフォメーションページ
ko: 정보 페이지
th: หน้าข้อมูล

source: Information page 2
ja: 情報ページ 2
ko: 정보 페이지 2
th: หน้าข้อมูล 2

source: When you log in with an admin account, you will see an additional Administration menu in the bottom left sidebar. User information registered in Backend.AI is listed in the Users tab. Domain admin can see only the users who belong to the domain, while superadmin can see all users' information. Only superadmin can create and deactivate a user.
ko: 관리자 계정으로 로그인 하면 왼쪽 사이드바에 Administration 메뉴가 추가로 보입니다. Backend.AI 에 등록된 사용자 정보는 Users 탭에서 볼 수 있습니다. Domain admin 의 경우 도메인에 속한 사용자 정보만 확인할 수 있고, super admin 은 전체 사용자 정보를 조회할 수 있습니다. 사용자의 생성 및 비활성화는 super admin 만 할 수 있습니다.

source: In Backend.AI, administrators can set limits on the total amount of resources available for each keypair, user and project. Resource policies enable you to define the maximum allowed resources and other compute session-related settings. If needed, multiple resource policies can be created, such as for user or research purposes, and applied individually.
ko: Backend.AI에서 관리자는 각 키페어, 사용자 및 프로젝트에 대해 사용 가능한 자원의 총량에 대한 제한을 설정할 수 있습니다. 자원 정책을 사용하면 최대 허용 자원 및 기타 계산 세션 관련 설정을 정의할 수 있습니다. 필요한 경우 사용자 또는 연구 목적과 같이 여러 자원 정책을 만들고 개별적으로 적용할 수 있습니다.

source: On the Resource Policy page, administrators can view the list of currently registered resource policies. You can check the list of resource policies set for keypairs, users, and projects on the Resource Policy page. Let's begin by examining the resource policies for keypairs. In the figure below, there are three policies in total (gardener, student, default). The infinity symbol (∞) indicates that no resource restrictions have been applied to those resources.
ko: 자원 정책 페이지에서 관리자는 현재 등록된 자원 정책 목록을 확인할 수 있습니다. 자원 정책 페이지에서는 키페어, 사용자 및 프로젝트에 설정된 자원 정책 목록을 확인할 수 있습니다. 먼저 키페어에 대한 자원 정책을 살펴봅시다. 아래 그림에서는 총 세 가지 정책 (gardener, student, default)이 있습니다. 무한대 기호 (∞)는 해당 리소스에 제한이 없음을 나타냅니다.

source: You can change the minimum resource requirements for each image by clicking the 'Setting (Gear)' in the Controls panel. Each image has hardware and resource requirements for minimal operation. (For example, for GPU-only images, there must be a minimum allocated GPU.) The default value for the minimum resource amount is provided as embedded in the image's metadata. If an attempt is made to create a compute session with a resource that is less than the amount of resources specified in each image, the request is automatically adjusted to the minimum resource requirements for the image and then generated, not canceled.
ko: Controls 열의 '설정' 버튼을 클릭하여 이미지의 최소 자원 요구량을 변경할 수 있습니다. 이미지마다 최소 동작을 위해 필요한 연산 자원 양 및 하드웨어가 있습니다. (예를 들어, GPU 전용 이미지의 경우 최소 할당 GPU가 있어야 합니다.) 최소 자원량의 기본값은 이미지의 메타데이터에 포함된 채로 제공됩니다. 각 이미지마다 지정 된 자원의 양보다 작은 자원으로 세션을 생성하려고 할 경우, 해당 요청은 자동으로 이미지 최소 자원 요구량으로 조정된 후 생성됩니다.
