Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/admin_menu/admin_menu.po
Languages: ja, ko, th

source: Admin Menus
ja: 管理者メニュー
ko: 관리자 기능
th: เมนูผู้ดูแลระบบ

source: Logging in with an admin account will reveal an extra Administration menu on the bottom left of the sidebar. User information registered in Backend.AI is listed in the Users tab. Domain admin can see only the users who belong to the domain, while superadmin can see all users' information. Only superadmin can create and deactivate a user.
ja: 管理者アカウントでログインすると、サイドバーの左下に追加のAdministrationメニューが表示されます。Backend.AIに登録されたユーザー情報は、Usersタブに一覧表示されます。ドメイン管理者はそのドメインに所属するユーザーのみを確認できますが、スーパー管理者は全てのユーザー情報を確認できます。ユーザーの作成と無効化はスーパー管理者のみが行えます。
th: การเข้าสู่ระบบด้วยบัญชีผู้ดูแลระบบจะเปิดเผยเมนูการจัดการเพิ่มเติมที่มุมล่างซ้ายของแถบด้านข้าง ข้อมูลผู้ใช้ที่ลงทะเบียนใน Backend.AI จะถูกแสดงในแท็บผู้ใช้ ผู้ดูแลโดเมนสามารถเห็นเฉพาะผู้ใช้ที่เป็นของโดเมน ในขณะที่ผู้ดูแลระบบทั่วไประดับสูงจะเห็นข้อมูลผู้ใช้ทั้งหมด เฉพาะผู้ดูแลระบบระดับสูงเท่านั้นที่สามารถสร้างและปิดการใช้งานผู้ใช้ได้

source: User ID (email), Name (username), and Main Access Key can be filtered by typing text in the search box on each column header.
ja: ユーザーID（メール）、名前（ユーザー名）、およびメインアクセスキーは、各列ヘッダーの検索ボックスにテキストを入力することでフィルタリングできます。
ko: 사용자 ID(이메일), username, 메인 access key 는 컬럼 헤더의 검색창에 텍스트를 입력하여 조회 결과를 필터링할 수도 있습니다.
th: สามารถกรอง User ID (อีเมล), ชื่อ (ชื่อผู้ใช้), และ Main Access Key โดยการพิมพ์ข้อความในช่องค้นหาที่หัวแต่ละคอลัมน์ได้

source: User management page
ja: ユーザー管理ページ
ko: 사용자 관리 메뉴
th: หน้าจัดการผู้ใช้

source: Depending on the plugin settings, the ``2FA Enabled`` column might be invisible. In that case, please contact administrator of your system.
ja: プラグインの設定によっては、``2FA Enabled`` 列が表示されない場合があります。その場合は、システムの管理者にご連絡ください。
ko: 플러그인 설정에 따라 ``이중 인증 사용(2FA Enabled)`` 열이 안보일 수 있습니다. 이 경우에는 시스템 관리자에게 문의 하십시오.
th: ขึ้นอยู่กับการตั้งค่าของปลั๊กอิน คอลัมน์ ``2FA Enabled`` อาจจะไม่แสดง ในกรณีนั้น กรุณาติดต่อผู้ดูแลระบบของระบบของคุณ

source: Create and update users
ja: ユーザーの作成と更新
ko: 새로운 사용자 생성 및 정보 갱신
th: สร้างและปรับปรุงผู้ใช้

source: A user can be created by clicking the CREATE USER button. Note that the password must be longer or equal to 8 characters and at least 1 alphabet/special character/ number should be included. The maximum length allowed for E-Mail and Username is 64.
ja: ユーザーは、CREATE USERボタンをクリックして作成できます。パスワードは8文字以上である必要があり、少なくとも1つのアルファベット/特殊文字/数字を含める必要があります。E-MailとUsernameに許可される最大長は64です。
ko: 사용자는 CREATE USER 버튼을 클릭하여 생성할 수 있습니다. 이 때 비밀번호는 8 자 이상, 알파벳/특수문자/숫자를 1 개 이상 포함해야 합니다. E-Mail 과 Username 필드에는 최대 64 자까지 입력할 수 있습니다.
th: ผู้ใช้สามารถสร้างได้โดยการคลิกที่ปุ่ม CREATE USER โปรดทราบว่ารหัสผ่านต้องมีความยาว 8 ตัวอักษรขึ้นไปและต้องมีอย่างน้อย 1 ตัวอักษร/สัญลักษณ์พิเศษ/เลขรวมอยู่ด้วย ความยาวสูงสุดที่อนุญาตสำหรับอีเมลและชื่อผู้ใช้คือ 64 ตัวอักษร

source: If a user with the same email or username already exists, it is not possible to creat user account. Please try other email and username.
ja: 同じメールアドレスまたはユーザー名のユーザーが既に存在する場合、ユーザーアカウントを作成することはできません。他のメールアドレスとユーザー名を試してください。
ko: 이미 같은 이메일이나 사용자 이름을 가지는 사용자가 존재한다면 사용자를 생성할 수 없습니다. 다른 이메일과 사용자 이름을 사용해 보십시오.
th: หากผู้ใช้ที่มีอีเมลหรือชื่อผู้ใช้งานเดียวกันมีอยู่แล้ว จะไม่สามารถสร้างบัญชีผู้ใช้ได้ กรุณาลองใช้อีเมลและชื่อผู้ใช้งานอื่น

source: Create user dialog
ja: ユーザー作成ダイアログ
th: สร้างกล่องสนทนาผู้ใช้

source: Check if the user is created.
ja: ユーザーが作成されたかどうか確認します。
ko: 사용자가 생성된 것을 확인합니다.
th: ตรวจสอบว่าผู้ใช้ถูกสร้างขึ้นหรือไม่

source: Click the green button in the Controls panel for more detailed user information. You can also check the domain and project information where the user belongs.
ja: コントロールパネルで緑のボタンをクリックすると、より詳細なユーザー情報を確認できます。また、ユーザーが所属するドメインおよびプロジェクト情報も確認できます。
ko: Controls 열에서 초록색 정보 버튼을 클릭하면 보다 자세한 사용자 정보를 확인할 수 있습니다. 사용자가 소속된 Domain과 Project 정보 또한 확인할 수 있습니다.
th: คลิกปุ่มสีเขียวในแผงควบคุมเพื่อดูข้อมูลผู้ใช้โดยละเอียด คุณยังสามารถตรวจสอบโดเมนและข้อมูลโปรเจกต์ที่ผู้ใช้สังกัดอยู่ได้อีกด้วย

source: Detailed information of a user
ja: ユーザーの詳細情報
ko: 사용자 상세 정보
th: ข้อมูลรายละเอียดของผู้ใช้งาน

source: Click the 'Setting (Gear)' in the Controls panel to update information of a user who already exists. User's name, password, activation state, etc. can be changed. User ID cannot be changed.
ja: 既存のユーザーの情報を更新するには、コントロールパネルの「設定（ギア）」をクリックします。ユーザーの名前、パスワード、アクティベーション状態などを変更できます。ユーザーIDは変更できません。
ko: Controls 열의 톱니바퀴로 된 '설정' 버튼을 클릭하면 이미 존재하는 사용자의 정보를 업데이트 할 수 있습니다. 사용자의 이름, 비밀번호, 활성/비활성 여부 등을 변경하여 저장할 수 있습니다. User ID는 변경되지 않습니다.
th: คลิกที่ 'การตั้งค่า (เกียร์)' ในแผงควบคุมเพื่ออัปเดตข้อมูลของผู้ใช้ที่มีอยู่แล้ว ชื่อผู้ใช้ รหัสผ่าน สถานะการเปิดใช้งาน ฯลฯ สามารถเปลี่ยนแปลงได้ แต่หมายเลขผู้ใช้ไม่สามารถเปลี่ยนแปลงได้

source: User update dialog
ja: ユーザー更新ダイアログ
th: กล่องสนทนาการอัปเดตผู้ใช้

source: Each of the three items at the bottom of the dialog has the following functions.
ja: ダイアログの下部にある3つのアイテムには、以下の機能があります。
ko: 이 다이얼로그 하단의 세 항목은 각각 다음과 같은 기능을 합니다.
th: แต่ละรายการสามรายการที่ด้านล่างของกล่องโต้ตอบมีฟังก์ชันดังต่อไปนี้

source: User Status: Indicates the user's status. Inactive users cannot log in. Before Verification is a status indicates that a user needs an additional step to activate the account such as email verification or an approval from an admin. Note that the inactive users are listed in the Inactive tab separately.
ja: ユーザーステータス: ユーザーのステータスを示します。非アクティブなユーザーはログインできません。確認待ちは、ユーザーがアカウントを有効化するためにメール確認や管理者からの承認といった追加の手順が必要であることを示すステータスです。非アクティブなユーザーは、非アクティブタブに別途リストされます。
ko: User Status: 사용자의 상태를 나타냅니다. 비활성(Inactive) 사용자는 로그인이 불가합니다. Before Verification 상태의 경우 해당 계정을 활성화 하기 위해 추가 단계가 남아있음을 의미합니다. 이는 사용자 이메일을 통한 검증 또는 관리자의 승인 절차 등이 될 수 있습니다. 비활성 사용자는 Inactive 탭에 별도로 보여지게 됩니다.
th: สถานะผู้ใช้: แสดงสถานะของผู้ใช้ ผู้ใช้ที่ไม่เคลื่อนไหวไม่สามารถเข้าสู่ระบบได้ สถานะก่อนการตรวจสอบเป็นสถานะที่บ่งบอกว่าผู้ใช้ต้องทำขั้นตอนเพิ่มเติมเพื่อเปิดใช้งานบัญชี เช่น การตรวจสอบอีเมลหรือการอนุมัติจากผู้ดูแลระบบ โปรดทราบว่าผู้ใช้ที่ไม่เคลื่อนไหวจะถูกแสดงในแท็บที่ไม่เคลื่อนไหวแยกต่างหาก

source: Require password change?: If the admin has chosen random passwords while creating users in batches, this field can be set to ON to indicate that password change is required. The users will see the top bar that notify user to update their password, but this is a kind of descriptive flag which has no effect on actual use.
ja: パスワード変更を要求しますか?: 管理者がユーザーをバッチで作成する際にランダムパスワードを選択した場合、このフィールドをONに設定してパスワード変更が必要であることを示せます。ユーザーはパスワード更新を通知するトップバーを見ることになりますが、これは実際の使用には影響を与えない説明用のフラグです。
ko: Require password change?: 관리자가 일괄적으로 사용자를 생성하면서 비밀번호를 임의 지정했을 경우, 이 필드를 On 으로 지정하여 구분할 수 있습니다. 비밀번호 변경이 필요하다는 일종의 기록 플래그로, 사용자 화면 상단에 비밀번호 변경을 안내하는 메시지가 출력되긴 하지만 실 사용에는 아무런 영향을 미치지 않습니다.
th: ต้องการเปลี่ยนรหัสผ่าน?: หากผู้ดูแลระบบเลือกใช้รหัสผ่านสุ่มขณะสร้างผู้ใช้เป็นชุด ฟิลด์นี้สามารถตั้งค่าเป็น ON เพื่อระบุว่าจำเป็นต้องเปลี่ยนรหัสผ่าน ผู้ใช้จะเห็นแถบด้านบนที่แจ้งเตือนให้ผู้ใช้ปรับปรุงรหัสผ่านของตน แต่สิ่งนี้เป็นเพียงธงเชิงพรรณนา ซึ่งไม่มีผลต่อการใช้งานจริง

source: Enable sudo session: Allow the user to use sudo in the compute session. This is useful when the user needs to install packages or run commands that require root privileges. However, it is not recommended to enable this option for all users, as it may cause security issues.
ja: sudoセッションを有効にする: ユーザーが計算セッションでsudoを使用できるようにします。これは、ユーザーがパッケージをインストールしたり、root権限が必要なコマンドを実行する必要がある場合に便利です。しかし、すべてのユーザーに対してこのオプションを有効にすることは推奨されません。なぜなら、セキュリティ上の問題を引き起こす可能性があるからです。
ko: Enable sudo session: 사용자가 연산 세션에서 sudo 를 사용할 수 있도록 허용합니다. 이는 사용자가 패키지를 설치하거나 루트 권한이 필요한 명령을 실행할 때 유용합니다. 그러나 모든 사용자에게 이 옵션을 활성화 하는 것은 보안 문제를 일으킬 수 있기 때문에 권장되지 않습니다.
th: เปิดใช้งานเซสชัน sudo: อนุญาตให้ผู้ใช้ใช้ sudo ในเซสชันการคอมพิวเตอร์ สิ่งนี้มีประโยชน์เมื่อผู้ใช้จำเป็นต้องติดตั้งแพ็คเกจหรือล้างคำสั่งที่ต้องการสิทธิ์ของผู้ดูแลระบบ อย่างไรก็ตาม ไม่แนะนำให้เปิดใช้งานตัวเลือกนี้สำหรับผู้ใช้ทั้งหมด เนื่องจากอาจทำให้เกิดปัญหาด้านความปลอดภัย

source: 2FA Enabled: A flag indicating whether the user uses two-factor authentication. When using two-factor authentication, users are additionally required to enter an OTP code when logging in. Administrators can only disable two-factor authentication for other users.
ja: 2FA Enabled: ユーザーが2要素認証を使用しているかどうかを示すフラグ。2要素認証を使用する場合、ユーザーはログイン時にOTPコードも入力する必要があります。管理者は他のユーザーに対してのみ2要素認証を無効にすることができます。
ko: 2FA Enabled: 사용자가 이중 인증을 사용하는지를 나타내는 플래그입니다. 이중 인증을 사용할 경우, 사용자는 로그인 시 OTP 코드를 추가로 입력해야 합니다. 관리자는 다른 사용자의 이중 인증 해제만 가능합니다.
th: 2FA เปิดใช้งาน: ธงระบุว่าผู้ใช้ใช้การตรวจสอบสิทธิ์แบบสองปัจจัยหรือไม่ เมื่อใช้การตรวจสอบสิทธิ์แบบสองปัจจัย ผู้ใช้จะต้องป้อนรหัส OTP เพิ่มเติมเมื่อเข้าสู่ระบบ ผู้ดูแลระบบสามารถปิดการใช้งานการตรวจสอบสิทธิ์แบบสองปัจจัยสำหรับผู้ใช้อื่นได้เท่านั้น

source: Inactivate user account
ja: ユーザーアカウントを無効化する
ko: 사용자 계정 비활성화
th: ปิดการใช้งานบัญชีผู้ใช้

source: Deleting user accounts is not allowed even for superadmins, to track usage statistics per user, metric retention, and accidental account loss. Instead, admins can inactivate user accounts to keep users from logging in. Click the trash icon in the Controls panel. A dialog asking confirmation appears, and you can inactivate the user by clicking the OKAY button.
ja: ユーザーアカウントの削除は、各ユーザーの使用状況統計、メトリクス保持、誤ってアカウントを失うことを追跡するために、スーパー管理者でも許可されていません。代わりに、管理者はユーザーアカウントを非アクティブ化してユーザーのログインを防ぐことができます。コントロールパネルでゴミ箱アイコンをクリックします。確認を求めるダイアログが表示され、OKAYボタンをクリックすることでユーザーを非アクティブ化できます。
ko: 사용자 계정을 삭제하는 기능은 사용량 통계 처리 및 메트릭 보존, 실수로 인한 계정 유실을 막기 위하여 만약을 위해 관리자라 할지라도 막혀 있습니다. 대신 사용자 계정을 비활성화 해서 사용자가 해당 계정을 통해 로그인 하는 것을 막을 수 있습니다. Controls 열의 휴지통 아이콘을 클릭합니다. 확인을 위한 다이얼로그가 뜨는데, OKAY 버튼을 클릭하면 사용자를 비활성화 할 수 있습니다.
th: การลบบัญชีผู้ใช้ไม่ได้รับอนุญาตแม้แต่สำหรับผู้ดูแลระบบระดับสูง เนื่องจากต้องการติดตามสถิติการใช้งานต่อผู้ใช้ การเก็บข้อมูลเมตริก และการสูญหายของบัญชีโดยไม่ตั้งใจ ทางเลือกคือ ผู้ดูแลระบบสามารถทำให้บัญชีผู้ใช้ไม่ทำงานได้เพื่อไม่ให้ผู้ใช้งานเข้าระบบได้ คลิกที่ไอคอนถังขยะในแผงควบคุม จะปรากฏกล่องโต้ตอบขอการยืนยัน และคุณสามารถทำให้บัญชีผู้ใช้ไม่ทำงานโดยการคลิกที่ปุ่มตกลง

source: Deactivating user account
ja: ユーザーアカウントの無効化
ko: 사용자 계정 비활성화
th: การปิดใช้งานบัญชีผู้ใช้

source: To re-activate users, go to Users - Inactive tab, and select the status of the target user to ``Active``.
ja: ユーザーを再アクティベートするには、Users - Inactive タブに移動し、対象ユーザーのステータスを「Active」に選択します。
ko: 사용자를 다시 활성화 하려면 Users - Inactive 탭에 방문하여 사용자 편집 버튼(톱니 아이콘)을 클릭한 후 사용자의 상태를 ``Active`` 로 변경하십시오.
th: ในการเปิดใช้งานผู้ใช้ใหม่อีกครั้ง ให้ไปที่แท็บผู้ใช้ - ไม่ใช้งาน และเลือกสถานะของผู้ใช้เป้าหมายเป็น ``Active``.

source: Please note that inactivating the user changes all of credentials to be inactive, but reactivating the user does not reactivate the inactivated credentials, since the user account can have multiple keypairs, which brings it hard to decide which credential should be reactivated.
ja: ユーザーを非アクティブ化すると、すべての資格情報が非アクティブになりますが、ユーザーを再アクティブ化しても非アクティブ化された資格情報は再アクティブ化されません。なぜなら、ユーザーアカウントは複数のキーペアを持つことができ、どの資格情報を再アクティブ化すべきかを決定するのが難しいためです。
ko: 사용자 계정을 비활성화 하면 그 사용자의 모든 자격증명도 따라서 비활성 상태로 바뀌게 됩니다. 하지만, 사용자를 다시 활성화 해도 비활성 상태의 자격증명을 다시 활성화 하지는 않습니다. 사용자는 여러 개의 자격증명을 가질 수 있어 어떤 키페어를 활성화 할지 일관된 정책을 정하기 어렵기 때문입니다.
th: โปรดทราบว่าการทำให้ผู้ใช้ไม่สามารถใช้งานได้จะทำให้ข้อมูลประจำตัวทั้งหมดไม่สามารถใช้งานได้ แต่การทำให้ผู้ใช้สามารถใช้งานได้อีกครั้งจะไม่ทำให้ข้อมูลประจำตัวที่ถูกทำให้ไม่สามารถใช้งานได้กลับมาทำงานได้ เนื่องจากบัญชีผู้ใช้สามารถมีคู่กุญแจหลายคู่ ซึ่งทำให้ตัดสินใจได้ยากว่าข้อมูลประจำตัวใดควรกลับมาทำงานได้

source: Manage User's Keypairs
ja: ユーザーのキーペアを管理
ko: 사용자의 키페어 관리
th: จัดการคู่กุญแจของผู้ใช้

source: Each user account usually have one or more keypairs. A keypair is used for API authentication to the Backend.AI server, after user logs in. Login requires authentication via user email and password, but every request the user sends to the server is authenticated based on the keypair.
ja: 各ユーザーアカウントには通常、1つ以上のキーペアがあります。キーペアは、ユーザーがログインした後、Backend.AIサーバーへのAPI認証に使用されます。ログインには、ユーザーのメールアドレスとパスワードを介した認証が必要ですが、ユーザーがサーバーに送信するすべてのリクエストはキーペアに基づいて認証されます。
ko: 사용자 계정에는 보통 하나 이상의 키페어가 할당되어 있습니다. 키페어는 사용자 로그인 후 Backend.AI 서버로 요청을 보낼 때 인증을 위해 사용 됩니다. 로그인을 위해서는 사용자 이메일 및 비밀번호를 통한 인증이 필요하지만, 사용자가 서버로 보내는 매 요청은 키페어에 기반하여 인증하게 됩니다.
th: บัญชีผู้ใช้แต่ละบัญชีมักจะมีหนึ่งหรือมากกว่าคู่กุญแจ คู่กุญแจจะถูกใช้สำหรับการตรวจสอบสิทธิ์ API ไปยังเซิร์ฟเวอร์ Backend.AI หลังจากที่ผู้ใช้ทำการเข้าสู่ระบบ การเข้าสู่ระบบต้องการการตรวจสอบสิทธิ์ผ่านอีเมลและรหัสผ่านของผู้ใช้ แต่ทุกคำขอที่ผู้ใช้ส่งไปยังเซิร์ฟเวอร์จะถูกตรวจสอบสิทธิ์ตามคู่กุญแจ

source: A user can have multiple keypairs, but to reduce the user's burden of managing keypairs, we are currently using only one of the user's keypairs to send requests. Also, when you create a new user, a keypair is automatically created, so you do not need to create and assign a keypair manually in most cases.
ja: ユーザーは複数のキーペアを持つことができますが、キーペアの管理におけるユーザーの負担を減らすために、現在はユーザーのキーペアのうちの1つだけを使用してリクエストを送信しています。また、新しいユーザーを作成すると、キーペアが自動的に作成されるため、ほとんどの場合、手動でキーペアを作成して割り当てる必要はありません。
ko: 한 사용자가 여러 개의 키페어를 가질 수 있지만, 사용자의 키페어 관리 부담을 줄이기 위해 현재는 사용자의 키페어 중 하나만 사용하여 요청을 보내도록 하고 있습니다. 또한, 새 사용자를 생성하면 자동으로 키페어가 하나 만들어지므로, 사용자 생성 시 별도로 키페어를 생성하여 할당할 필요는 없습니다.
th: ผู้ใช้สามารถมีคีย์เพียร์หลายชุด แต่เพื่อลดภาระของผู้ใช้ในการจัดการคีย์เพียร์ เราจึงใช้คีย์เพียร์เพียงชุดเดียวของผู้ใช้ในการส่งคำขอ นอกจากนี้ เมื่อคุณสร้างผู้ใช้ใหม่ คีย์เพียร์จะถูกสร้างขึ้นโดยอัตโนมัติ ดังนั้นคุณจึงไม่จำเป็นต้องสร้างและกำหนดคีย์เพียร์ด้วยตนเองในกรณีส่วนใหญ่

source: Keypairs can be listed on the Credentials tab of in the Users page. Active keypairs are shown immediately, and to see the inactive keypairs, click the Inactive panel at the bottom.
ja: キーペアは、ユーザーページの資格情報タブで一覧表示できます。アクティブなキーペアはすぐに表示され、非アクティブなキーペアを表示するには、下部の非アクティブパネルをクリックします。
ko: 키페어는 Users 페이지의 Credentials 탭에서 조회할 수 있습니다. 현재 활성화된 키페어가 바로 출력이 되고, 비활성 키페어를 조회하려면 하단의 Inactive 패널을 클릭하면 됩니다.
th: คู่กุญแจสามารถดูได้ที่แท็บข้อมูลประจำตัวในหน้าผู้ใช้ คู่กุญแจที่ใช้งานอยู่จะแสดงทันที และเพื่อดูคู่กุญแจที่ไม่ใช้งาน ให้คลิกที่แผงไม่ใช้งานที่ด้านล่าง

source: Credential list page
ja: 資格情報リストページ
th: หน้ารายการข้อมูลประจำตัว

source: Like in Users tab, you can use the buttons in the Controls panel to view or update keypair details. Click the blue trash button to disable that keypair, or click the red trash button to completely delete the keypair. However, if you have created a compute session using a keypair, you cannot delete it. If you accidentally deleted a keypair, you can re-create keypair for the user by clicking the ADD CREDENTIAL button at the upper right corner. If necessary, you can also explicitly enter the access key and secret key by clicking the Advanced panel.
ja: ユーザータブと同様に、コントロールパネルのボタンを使用してキーペアの詳細を表示または更新できます。青いゴミ箱ボタンをクリックしてそのキーペアを無効にするか、赤いゴミ箱ボタンをクリックしてキーペアを完全に削除します。ただし、キーペアを使用してコンピュートセッションを作成している場合は、それを削除することはできません。キーペアを誤って削除した場合は、右上隅のADD CREDENTIALボタンをクリックしてユーザーのキーペアを再作成できます。必要に応じて、高度なパネルをクリックしてアクセスキーとシークレットキーを明示的に入力することもできます。
ko: Users 탭과 마찬가지로 Controls 열의 버튼을 이용해서 키페어의 상세 정보를 확인하거나 업데이트 할 수 있습니다. 파란색 휴지통 버튼을 클릭하면 해당 키페어를 비활성화 할 수 있고, 빨간색 휴지통 버튼을 클릭하면 키페어를 완전히 삭제할 수 있습니다. 단, 키페어를 사용해서 연산 세션을 생성한 적이 있으면 삭제할 수 없습니다. 만약, 실수로 키페어를 삭제한 경우 우측 상단의 ADD CREDENTIAL 버튼을 클릭하여 해당 사용자의 키페어를 다시 생성할 수 있습니다. 필요한 경우 Advanced 패널을 클릭해서 access key 와 secret key 를 직접 명시적으로 적어줄 수도 있습니다.
th: เช่นเดียวกับในแท็บผู้ใช้ คุณสามารถใช้ปุ่มในแผงควบคุมเพื่อดูหรืออัปเดตรายละเอียดของคู่กุญแจ คลิกที่ปุ่มถังขยะสีน้ำเงินเพื่อปิดใช้งานคู่กุญแจนั้น หรือคลิกที่ปุ่มถังขยะสีแดงเพื่อลบคู่กุญแจออกทั้งหมด อย่างไรก็ตาม หากคุณได้สร้างเซสชันการประมวลผลโดยใช้คู่กุญแจ คุณไม่สามารถลบมันได้ หากคุณลบคู่กุญแจโดยไม่ตั้งใจ คุณสามารถสร้างคู่กุญแจใหม่สำหรับผู้ใช้โดยการคลิกปุ่มเพิ่มข้อมูลรับรองที่มุมขวาด้านบน หากจำเป็น คุณยังสามารถป้อนคีย์เข้าถึงและคีย์ลับอย่างชัดเจนโดยการคลิกที่แผงขั้นสูง

source: The Rate Limit field is where you specify the maximum number of requests that can be sent to the Backend.AI server in 15 minutes. For example, if set to 1000, and the keypair sends more than 1000 API requests in 15 minutes, and the server throws an error and does not accept the request. It is recommended to use the default value and increase it when the API request frequency goes up high according to the user's pattern.
ja: Rate Limitフィールドでは、Backend.AIサーバーに15分間で送信できるリクエストの最大数を指定します。たとえば、1000に設定されている場合、キー・ペアが15分以内に1000を超えるAPIリクエストを送信すると、サーバーはエラーをスローし、リクエストを受け付けません。デフォルト値を使用し、ユーザーのパターンに応じてAPIリクエストの頻度が高くなった場合に、それを増やすことをお勧めします。
ko: Rate Limit 필드는 15분 동안 Backend.AI 서버로 보내는 요청의 최대 수를 지정하는 곳입니다. 예를 들어 1000으로 설정한 경우, 해당 키페어로는 15분 동안 1000개 이상의 API 요청을 보내면 서버에서 에러를 발생하고 요청을 받아들이지 않습니다. 기본값을 사용하다가 사용자의 패턴에 따라 API 요청 빈도가 많을 경우 이 값을 증가시키는 것을 권장됨.
th: ฟิลด์ Rate Limit คือที่ที่คุณกำหนดจำนวนสูงสุดของคำขอที่สามารถส่งไปยังเซิร์ฟเวอร์ Backend.AI ใน 15 นาที ตัวอย่างเช่น หากตั้งค่าเป็น 1000 และ keypair ส่งคำขอ API มากกว่า 1000 ใน 15 นาที เซิร์ฟเวอร์จะเกิดข้อผิดพลาดและไม่รับคำขอ จะขอแนะนำให้ใช้ค่าตั้งต้นและเพิ่มขึ้นเมื่อความถี่ของคำขอ API เพิ่มขึ้นตามรูปแบบของผู้ใช้

source: Add keypair dialog
ja: 鍵ペア追加ダイアログ
th: เพิ่มกล่องโต้ตอบคีย์คู่

source: In each of USERS, CREDENTIALS tabs, there is an icon (``...``) on the right side of the tab header. Clicking this shows export CSV menu, which again brings up a CSV export dialog for each tabs. By giving an appropriate file name, if necessary, and clicking EXPORT CSV FILE button, you can download the list of users, keypairs.
ja: USERS、CREDENTIALS タブのそれぞれに、タブヘッダーの右側にアイコン（``...``）があります。これをクリックするとCSVエクスポートメニューが表示され、再び各タブのCSVエクスポートダイアログが表示されます。必要に応じて適切なファイル名を指定し、EXPORT CSV FILEボタンをクリックすると、ユーザーやキーペアのリストをダウンロードできます。
ko: USERS, CREDENTIALS 탭의 우측 끝부분에 ⋯ 모양의 아이콘이 있습니다. 이 버튼을 클릭하면 export CSV 메뉴가 나타나고, 다시 해당 메뉴를 클릭하면 각 탭 자원 별 CSV export 다이얼로그가 나타납니다. 필요한 경우 적당한 파일 이름을 기입하고, EXPORT CSV FILE 버튼을 클릭하면 사용자, 키페어 리스트를 CSV 형태로 다운로드 할 수 있습니다.
th: ในแต่ละแท็บ USERS และ CREDENTIALS จะมีไอคอน (``...``) อยู่ด้านขวาของหัวแท็บ การคลิกที่นี่จะแสดงเมนูส่งออก CSV ซึ่งจะนำไปสู่กล่องโต้ตอบการส่งออก CSV สำหรับแต่ละแท็บ โดยการกำหนดชื่อไฟล์ที่เหมาะสมถ้าจำเป็น และคลิกปุ่ม EXPORT CSV FILE คุณสามารถดาวน์โหลดรายการผู้ใช้และคู่กุญแจได้

source: Share project storage folders with project members
ja: プロジェクトメンバーとプロジェクトストレージフォルダーを共有する
ko: 프로젝트 Storage 폴더를 다른 사용자와 공유하기
th: แชร์โฟลเดอร์ที่จัดเก็บโครงการกับสมาชิกในโครงการ

source: Backend.AI provides storage folders for projects, in addition to user's own storage folder. A project storage folder is a folder belonging to a specific project, not a specific user, and can be accessed by all users in that project.
ja: Backend.AIは、ユーザー自身のストレージフォルダに加えて、プロジェクト用のストレージフォルダを提供します。プロジェクトストレージフォルダは特定のユーザーではなく特定のプロジェクトに属しており、そのプロジェクト内のすべてのユーザーがアクセス可能です。
ko: Backend.AI 는 개인용 Storage 폴더 외에 프로젝트 전용 Storage 폴더를 제공합니다. 프로젝트 Storage 폴더는 특정 사용자가 아닌 특정 프로젝트에 속하는 폴더이며, 해당 프로젝트에 속한 모든 사용자가 접근할 수 있습니다.
th: Backend.AI มีโฟลเดอร์จัดเก็บสำหรับโครงการ นอกเหนือจากโฟลเดอร์จัดเก็บของผู้ใช้เอง โฟลเดอร์จัดเก็บโครงการคือโฟลเดอร์ที่เป็นของโครงการเฉพาะ ไม่ใช่ของผู้ใช้เฉพาะ และสามารถเข้าถึงได้โดยผู้ใช้ทุกคนในโครงการนั้น

source: Project folders can be created only by administrators. Normal users can only access the contents of the project folder created by the administrator. Depending on the system settings, project folders may not be allowed.
ja: プロジェクトフォルダーは管理者のみが作成できます。一般ユーザーは管理者によって作成されたプロジェクトフォルダーの内容のみアクセスできます。システム設定によっては、プロジェクトフォルダーが許可されていない場合もあります。
ko: 프로젝트 폴더는 오직 관리자만 생성할 수 있습니다. 일반 사용자는 관리자가 생성한 프로젝트 폴더 내용을 공유받아 접근할 수 있을 뿐입니다. 단, 시스템 설정에 따라 프로젝트 폴더 생성이 허용되지 않는 경우도 있을 수 있습니다.
th: โฟลเดอร์โปรเจกต์สามารถสร้างได้โดยผู้ดูแลระบบเท่านั้น ผู้ใช้ทั่วไปสามารถเข้าถึงเนื้อหาภายในโฟลเดอร์โปรเจกต์ที่สร้างโดยผู้ดูแลระบบเท่านั้น ขึ้นอยู่กับการตั้งค่าของระบบ โฟลเดอร์โปรเจกต์อาจไม่ได้รับอนุญาตให้สร้าง

source: First, log in with an admin account and create a project folder. After moving to the Data & Storage page, click NEW FOLDER to open the folder creation dialog. Enter the folder name, set the Type to Project, and select the project to share the folder. Let's select the project to which User B belongs for this example to work. Permission is set to Read-Only.
ja: まず、管理者アカウントでログインし、プロジェクトフォルダを作成します。データ & ストレージページに移動後、NEW FOLDERをクリックしてフォルダ作成ダイアログを開きます。フォルダ名を入力し、タイプをプロジェクトに設定し、フォルダを共有するプロジェクトを選択します。この例では、User Bが属するプロジェクトを選択しましょう。権限は読み取り専用に設定します。
ko: 먼저 관리자 계정으로 로그인 한 뒤 프로젝트 폴더를 만들어보겠습니다. Data & Storage 페이지로 이동 후 NEW FOLDER 를 클릭하여 폴더 생성 다이얼로그를 엽니다. 폴더 이름을 입력하고 Type 을 Project 로 설정한 후 목표 Project를 선택합니다. 이 때, 목표 프로젝트는 사용자 B 가 속한 프로젝트로 설정합니다. Permission 은 Read-Only 로 설정했습니다.
th: ก่อนอื่นให้เข้าสู่ระบบด้วยบัญชีผู้ดูแลระบบและสร้างโฟลเดอร์โปรเจกต์ หลังจากย้ายไปที่หน้าข้อมูลและการจัดเก็บ ให้คลิกที่โฟลเดอร์ใหม่เพื่อเปิดกล่องสนทนาการสร้างโฟลเดอร์ กรอกชื่อโฟลเดอร์ ตั้งค่าประเภทเป็นโปรเจกต์ และเลือกโปรเจกต์ที่จะแบ่งปันโฟลเดอร์ ให้เลือกโปรเจกต์ที่ผู้ใช้ B เป็นสมาชิกในตัวอย่างนี้เพื่อให้ทำงานได้ สิทธิ์จะถูกตั้งค่าเป็นอ่านอย่างเดียว

source: After confirming that the folder has been created, log in with the User B's account and check that the project folder just created on the Data & Storage page is displayed without any invitation procedure. You can see that R (Read Only) is also displayed in the Permission panel.
ja: フォルダーが作成されたことを確認した後、ユーザーBのアカウントでログインし、データ & ストレージページで作成されたばかりのプロジェクトフォルダーが招待手続きなしで表示されることを確認します。[権限]パネルにR (読み取り専用) が表示されていることも確認できます。
ko: 폴더가 생성된 것을 확인한 후 사용자 B 계정으로 로그인 하여 Data & Storage 페이지에 방금 생성한 프로젝트 폴더가 별도의 초대 절차 없이 조회되는 것을 확인합니다. Permission 열에 R(읽기전용) 표시가 나타난 것을 확인할 수 있습니다.
th: หลังจากยืนยันว่ามีการสร้างโฟลเดอร์แล้ว ให้เข้าสู่ระบบด้วยบัญชีผู้ใช้ B และตรวจสอบว่าโฟลเดอร์โครงการที่เพิ่งสร้างขึ้นในหน้าข้อมูล & ที่เก็บข้อมูลแสดงโดยไม่มีขั้นตอนการเชิญ คุณจะเห็นว่า R (อ่านอย่างเดียว) ก็แสดงในแผงสิทธิ์ด้วย

source: Manage Models cards
ja: モデルカードを管理
th: จัดการการ์ดโมเดล

source: All of the Model cards in model store are managed by project admin. After uploading model store with model-definition file, any user in the project can access to model card and clone it if needed.
ja: モデルストア内のすべてのモデルカードはプロジェクト管理者によって管理されます。モデル定義ファイルでモデルストアをアップロードした後、プロジェクト内の任意のユーザーがモデルカードにアクセスし、必要に応じてそれをクローンすることができます。
th: โมเดลการ์ดทั้งหมดในร้านโมเดลจะถูกจัดการโดยผู้ดูแลโปรเจกต์ หลังจากที่อัปโหลดร้านโมเดลพร้อมกับไฟล์กำหนดโมเดล ผู้ใช้ในโปรเจกต์สามารถเข้าถึงโมเดลการ์ดและคัดลอกได้หากต้องการ

source: Following method is to add model cards from the Hugging Face.
ja: 以下の方法は、Hugging Faceからモデルカードを追加するためのものです。
th: วิธีการด้านล่างนี้ใช้เพื่อเพิ่มการ์ดโมเดลจาก Hugging Face

source: Before creating a model card, getting an access to the specific model on Hugging Face is needed. For more information, please refer to `Gated models <https://huggingface.co/docs/hub/models-gated>`_ .
ja: モデルカードを作成する前に、Hugging Faceで特定のモデルへのアクセスを取得する必要があります。詳細については、`Gated models <https://huggingface.co/docs/hub/models-gated>`_ を参照してください。
th: ก่อนที่จะสร้างบัตรโมเดล จำเป็นต้องเข้าถึงโมเดลเฉพาะบน Hugging Face สำหรับข้อมูลเพิ่มเติม โปรดดูที่ `Gated models <https://huggingface.co/docs/hub/models-gated>`_ .

source: First, Set the project to 'model-store'.
ja: まず、プロジェクトを 'model-store' に設定します。
th: ก่อนอื่น ตั้งค่าโครงการเป็น 'model-store'

source: Select project to model store
ja: モデルストアにプロジェクトを選択
th: เลือกโครงการเพื่อเก็บแบบจำลอง

source: Click the 'Add' button on the right side. Enter the folder name, and set the rest of folder configuration as shown below:
ja: 右側の「追加」ボタンをクリックします。フォルダ名を入力し、以下に示すようにフォルダ設定の残りを設定します。
th: คลิกปุ่ม 'เพิ่ม' ที่ด้านขวา ป้อนชื่อโฟลเดอร์ และตั้งค่าการกำหนดค่าโฟลเดอร์ที่เหลือตามที่แสดงด้านล่าง:

source: Type: project
ja: タイプ: プロジェクト
th: ประเภท: โครงการ

source: Project: 'model-store'
ja: プロジェクト: 'model-store'
th: โปรเจกต์: 'model-store'

source: Usage Mode: Model
ja: 使用モード：モデル
th: โหมดการใช้งาน: โมเดล

source: Permission: Read-Write
ja: 権限: 読み書き
th: สิทธิ์: อ่าน-เขียน

source: Cloneable: True
ja: クローン可能: 真
th: Cloneable: จริง

source: Model store folder
ja: モデルストアフォルダ
th: โฟลเดอร์จัดเก็บโมเดล
