Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/admin_menu/admin_menu.po
Languages: ja, ko, th

source: You may want to prevent new compute sessions from being scheduled to an Agent service without stopping it. In this case, you can disable the Schedulable status of the Agent. Then, you can block the creation of a new session while preserving the existing sessions on the Agent.
ja: エージェントサービスを停止せずに新しい計算セッションがスケジュールされるのを防ぎたい場合があります。この場合、エージェントのスケジューラブルステータスを無効にすることができます。これにより、エージェント上の既存のセッションを維持しながら、新しいセッションの作成をブロックすることができます。
ko: 특정 Agent 서비스를 중단하지 않고 신규 세션이 스케줄링되는 것을 막고 싶을 수 있습니다. 이 경우, Agent의 Schedulable 상태를 비활성화할 수 있습니다. 기존에 해당 Agent에서 실행 중이던 연산 세션은 그대로 보존하면서 신규 세션 생성만 차단할 수 있습니다.
th: คุณอาจต้องการป้องกันไม่ให้มีการกำหนดการเซสชันการคอมพิวเตอร์ใหม่ไปยังบริการตัวแทนโดยไม่หยุดมัน ในกรณีนี้ คุณสามารถปิดสถานะสามารถกำหนดการของตัวแทนได้ จากนั้นคุณสามารถบล็อกการสร้างเซสชันใหม่ในขณะที่รักษาเซสชันที่มีอยู่บนตัวแทนไว้

source: Agent settings
ja: エージェント設定
ko: Agent 설정
th: การตั้งค่าตัวแทน

source: Manage resource group
ja: リソースグループを管理する
ko: 자원 그룹 관리
th: จัดการกลุ่มทรัพยากร

source: Agents can be grouped into units called resource (scaling) groups. For example, let's say there are 3 agents with V100 GPUs and 2 agents with P100 GPUs. You want to expose two types of GPUs to users separately, then you can group three V100 agents into one resource group, and the remaining two P100 agents into another resource group.
ja: エージェントはリソース（スケーリング）グループと呼ばれるユニットにグループ化できます。例えば、V100 GPUを持つエージェントが3つあり、P100 GPUを持つエージェントが2つあるとします。ユーザーに対して2種類のGPUを別々に提供したい場合、3つのV100エージェントを1つのリソースグループに、残りの2つのP100エージェントを別のリソースグループにグループ化することができます。
ko: Agent는 자원 그룹이라는 단위로 묶일 수 있습니다. 예를 들어, V100 GPU를 탑재한 agent가 3대, P100 GPU를 탑재한 agent가 2대 있는데, 사용자에게 두 GPU 자원을 별도로 노출하고 싶을 경우 V100 agent 3대를 하나의 자원 그룹으로 묶고, 나머지 P100 agent 2대를 다른 자원 그룹으로 묶어서 관리할 수 있습니다.
th: ตัวแทนสามารถถูกรวมกลุ่มเป็นหน่วยที่เรียกว่ากลุ่มทรัพยากร (การปรับขนาด) ยกตัวอย่างเช่น สมมุติว่ามีตัวแทน 3 ตัวที่มี GPU V100 และตัวแทน 2 ตัวที่มี GPU P100 คุณต้องการเปิดเผย GPU สองประเภทให้กับผู้ใช้แยกกัน ดังนั้นคุณสามารถรวมตัวแทน V100 สามตัวเข้าด้วยกันเป็นกลุ่มทรัพยากรหนึ่งกลุ่ม และตัวแทน P100 ที่เหลืออีกสองตัวเข้าด้วยกันเป็นกลุ่มทรัพยากรอีกกลุ่มหนึ่ง

source: Adding a specific agent to a specific resource group is not currently handled in the Web-UI, and it can be done by editing agent config file from the installation location and restart the agent daemon. Management of the resource groups is possible in Resource Group tab of the Resource page.
ja: 特定のエージェントを特定のリソースグループに追加することは現在Web-UIでは対応しておらず、インストール場所からエージェントの設定ファイルを編集し、エージェントデーモンを再起動することで行えます。リソースグループの管理は、リソースページのリソースグループタブで可能です。
ko: 자원 그룹에 특정 agent를 추가하는 작업은 현재 UI 상에서 처리되지 않으며, agent 설치 폴더의 설정 파일 옵션을 수정한 뒤 agent를 재시작 하는 방식으로 가능합니다. 자원 그룹은 Resources 페이지의 Resource Group 탭에서 조회할 수 있습니다.
th: การเพิ่มตัวแทนเฉพาะไปยังกลุ่มทรัพยากรเฉพาะใน Web-UI ขณะนี้ยังไม่สามารถทำได้ และสามารถทำได้โดยการแก้ไขไฟล์กำหนดค่าตัวแทนจากตำแหน่งที่ติดตั้งและรีสตาร์ทตัวดำเนินการตัวแทน การจัดการกลุ่มทรัพยากรสามารถทำได้ในแท็บกลุ่มทรัพยากรของหน้าทรัพยากร

source: Resource group tab
ja: リソースグループタブ
ko: 자원 그룹 탭
th: แท็บกลุ่มทรัพยากร

source: You can edit a resource group by clicking the 'Setting (Gear)' in the Control panel. In the Select scheduler field, you can choose the scheduling method for creating a compute session. Currently, there are three types: ``FIFO``, ``LIFO``, and ``DRF``. ``FIFO`` and ``LIFO`` are scheduling methods creating the first- or the last-enqueued compute session in the job queue. ``DRF`` stands for Dominant Resource Fairness, and it aims to provide resources as fair as possible for each user. You can deactivate a resource policy by turning off Active Status.
ja: コントロールパネルで「設定（ギア）」をクリックすると、リソースグループを編集できます。スケジューラの選択フィールドでは、計算セッションを作成するためのスケジューリング方法を選択できます。現在、3つのタイプがあります：``FIFO``、``LIFO``、および ``DRF``。``FIFO`` と ``LIFO`` はジョブキュー内で最初または最後にエンキューされた計算セッションを作成するスケジューリング方法です。``DRF`` はDominant Resource Fairnessの略で、各ユーザーに対してできるだけ公平にリソースを提供することを目指しています。アクティブステータスをオフにすることで、リソースポリシーを非アクティブ化できます。
ko: Control 열에서 '설정' 버튼을 클릭하여 자원 그룹을 편집할 수 있습니다. Select scheduler 필드에서 연산 세션 생성 스케줄링 방식을 선택할 수 있는데, 현재 지원하는 방식은 FIFO, LIFO, DRF 세 가지 입니다. FIFO 와 LIFO 는 가장 처음 또는 가장 마지막에 작업 큐에 들어 온 연산 세션을 먼저 생성하는 방식으로 스케줄링 방식이고, DRF 는 Dominant Resource Fairness 의 약자로 사용자 별로 최대한 공평하게 자원 할당이 가능하도록 조절하여 스케줄링 하는 방식입니다. Active Status 를 꺼서 해당 자원 정책을 비활성화 할 수 있습니다.
th: คุณสามารถแก้ไขกลุ่มทรัพยากรได้โดยการคลิกที่ 'การตั้งค่า (เกียร์)' ในแผงควบคุม ในช่องเลือกตัวจัดตาราง คุณสามารถเลือกวิธีการจัดตารางสำหรับการสร้างเซสชันการคอมพิวเตอร์ ขณะนี้มีสามประเภท: ``FIFO``, ``LIFO``, และ ``DRF`` ``FIFO`` และ ``LIFO`` เป็นวิธีการจัดตารางที่สร้างเซสชันการคอมพิวเตอร์ที่ถูกเข้าคิวเป็นลำดับแรกหรือท้ายสุดในคิวของงาน ``DRF`` ย่อมาจาก Dominant Resource Fairness ซึ่งมีเป้าหมายเพื่อให้ทรัพยากรอย่างยุติธรรมที่สุดสำหรับผู้ใช้แต่ละคน คุณสามารถปิดใช้งานนโยบายทรัพยากรได้โดยการปิดสถานะที่ใช้งานอยู่

source: Modify resource group dialog
ja: リソースグループの変更ダイアログ
ko: 자원 그룹 수정 다이얼로그
th: กล่องโต้ตอบแก้ไขกลุ่มทรัพย์สิน

source: WSProxy Server Address sets the WSProxy address for the resource group's Agents to use. If you set a URL in this field, WSProxy will relay the traffic of an app like Jupyter directly to the compute session via Agent bypassing Manager (v2 API). By enabling the v2 API, you can lower the Manager's burden when using app services. This also achieves the better efficiency and scalability in deploying the services. If a direct connection from WSProxy to the Agent node is not available, however, please leave this field blank to fall back to the v1 API, which relays the traffic through Manager in a traditional way.
ja: WSProxy Server Addressは、リソースグループのエージェントが使用するWSProxyアドレスを設定します。このフィールドにURLを設定すると、WSProxyは、Jupyterのようなアプリのトラフィックをマネージャーを介さずに（v2 API）エージェント経由で直接コンピュートセッションに中継します。v2 APIを有効にすると、アプリサービスを使用する際のマネージャーの負担を軽減することができます。また、サービスの展開時に効率とスケーラビリティを向上させることができます。ただし、WSProxyからエージェントノードへの直接接続が利用できない場合は、このフィールドを空にして、従来の方法でトラフィックをマネージャー経由で中継するv1 APIにフォールバックしてください。
ko: WSProxy Server Address에는 리소스 그룹에 속한 Agent 에서 사용할 WSProxy 서비스 주소를 설정할 수 있습니다. 이 필드에 URL 을 설정하면 WSProxy 에서 Jupyter 등의 앱 트래픽을 중계할 때 Manager 를 거치지 않고 Agent 를 통해 바로 사용자의 컨테이너에 접속하게 됩니다(v2 API). v2 API 를 사용하는 경우, 앱 서비스 사용 시 Manager 의 부하를 줄일 수 있습니다. 서비스를 배포할 때 효율성과 확장성도 증가합니다. 다만, WSProxy 에서 Agent 가 설치된 노드로 직접적인 네트워크 연결이 불가능한 경우에는, 이 필드를 빈 값으로 설정하여 Manager 를 거쳐 컨테이너로 트래픽을 중계하는 v1 API 를 사용할 수 있습니다.
th: ที่อยู่ WSProxy Server กำหนดที่อยู่ WSProxy สำหรับ Agent ของกลุ่มทรัพยากร หากคุณตั้งค่า URL ในฟิลด์นี้ WSProxy จะส่งต่อการสัญจรของแอปพลิเคชันเช่น Jupyter โดยตรงไปยังเซสชันการคำนวณผ่าน Agent โดยไม่ต้องผ่าน Manager (v2 API) โดยการเปิดใช้งาน v2 API คุณสามารถลดภาระของ Manager เมื่อใช้บริการแอปพลิเคชัน ซึ่งยังช่วยให้มีประสิทธิภาพและสามารถปรับขนาดในการออกบริการได้ดีขึ้น อย่างไรก็ตาม หากไม่สามารถเชื่อมต่อโดยตรงจาก WSProxy ไปยังโหนด Agent ได้ โปรดเว้นฟิลด์นี้ให้ว่างเพื่อกลับไปยัง v1 API ซึ่งส่งต่อการสัญจรผ่าน Manager ในรูปแบบดั้งเดิม

source: The resource group has further Scheduler Options. The details are described below.
ja: リソースグループは、さらにスケジューラーオプションを持っています。詳細は以下に記載されています。
ko: 리소스 그룹에서 스케줄러 관련 옵션(Scheduler Options)을 추가 설정할 수도 있습니다. 각 항목별 설정은 아래 내용을 참고하세요.
th: กลุ่มทรัพยากรมีตัวเลือกตัวกำหนดเวลาที่เพิ่มเติม รายละเอียดมีดังต่อไปนี้

source: Allowed session types: Since user can choose the type of session, resource group can allow certain type of session. You should allow at lest one session types. The allowed session types are Interactive, Batch, and Inference.
ja: 許可されるセッションタイプ: ユーザーがセッションのタイプを選択できるので、リソースグループは特定のタイプのセッションを許可できます。少なくとも一つのセッションタイプを許可する必要があります。許可されるセッションタイプは、インタラクティブ、バッチ、およびインファレンスです。
ko: Allowed session types: 사용자가 세션 타입을 설정할 수 있기 때문에, 자원 그룹에서도 특정 타입의 세션만 허용할 수 있음. 하나 이상의 세션 타입을 허용해야 하며, 허용되는 타입은 Interactive, Batch, Inference 임.
th: ประเภทเซสชันที่อนุญาต: เนื่องจากผู้ใช้สามารถเลือกประเภทของเซสชัน กลุ่มทรัพยากรสามารถอนุญาตประเภทของเซสชันบางประเภทได้ คุณควรอนุญาตอย่างน้อยหนึ่งประเภทเซสชัน ประเภทเซสชันที่อนุญาตคือ Interactive, Batch, และ Inference.

source: Pending timeout: A compute session will be canceled if it stays ``PENDING`` status for longer than the Pending timeout. When you wish to prevent a session from remaining PENDING indefinitely, set this time. Set this value to zero (0) if you do not want to apply the pending timeout feature.
ja: 保留タイムアウト: コンピュートセッションが ``PENDING`` ステータスのまま保留タイムアウトを超えている場合、そのセッションはキャンセルされます。セッションが無期限にPENDINGのまま残らないようにしたい場合は、この時間を設定してください。保留タイムアウト機能を適用したくない場合は、この値をゼロ (0) に設定します。
ko: Pending timeout: PENDING 상태에 머무는 시간이 Pending timeout 보다 긴 경우, 해당 세션을 취소함. 무한히 PENDING 상태에 머무르는 세션을 방지하고자 할 때 기준 시간을 설정할 수 있음. 0을 설정하면 Pending timeout이 적용되지 않음.
th: ระยะเวลารอคอยที่รอดำเนินการ: เซสชันการคอมพิวเตอร์จะถูกยกเลิกหากอยู่ในสถานะ ``PENDING`` นานกว่าระยะเวลารอคอยที่รอดำเนินการ เมื่อคุณต้องการป้องกันไม่ให้เซสชันอยู่ในสถานะ PENDING เป็นเวลานานโดยไม่มีกำหนด ให้ตั้งค่าเวลานี้ ตั้งค่าเป็นศูนย์ (0) หากคุณไม่ต้องการใช้ฟีเจอร์ระยะเวลารอคอยที่รอดำเนินการ

source: The number of retries to skip pending session: The number of retries the scheduler tries before skipping a PENDING session. It can be configured to prevent the situation where one PENDING session blocks the scheduling of the subsequent sessions indefinitely (Head-of-line blocking, HOL). If no value is specified, the global value in Etcd will be used (``num retries to skip``, default three times).
ja: 保留中のセッションをスキップするためのリトライ回数: スケジューラが保留中のセッションをスキップする前に試行するリトライの回数。ある保留中のセッションが後続するセッションのスケジューリングを無期限に妨げる状況（先頭行詰まり、HOL）を防ぐために設定できます。値が指定されていない場合、Etcdのグローバル値が使用されます（``スキップするためのリトライ回数``, デフォルトは3回）。
ko: The number of retries to skip pending session: PENDING 세션을 건너뛸 때까지의 스케줄러 재시도 횟수. 한 PENDING 세션이 그 뒤에 요청된 세션의 스케줄링을 무한히 막는 경우 (Head-of-line blocking, HOL)를 방지하기 위해 설정할 수 있음. 따로 설정하지 않는 경우에는 Etcd 에 설정된 글로벌 값 (num_retries_to_skip, 기본 3 회)을 사용함.
th: จำนวนการลองใหม่เพื่อละเว้นเซสชันที่รอดำเนินการ: จำนวนการลองใหม่ที่โปรแกรมจัดตารางพยายามก่อนที่จะละเว้นเซสชันที่รออยู่ PENDING สามารถกำหนดค่าได้เพื่อป้องกันไม่ให้เกิดสถานการณ์ที่เซสชัน PENDING หนึ่งทำให้การจัดตารางเซสชันถัดไปถูกบล็อกอย่างไม่มีกำหนด (Head-of-line blocking, HOL) หากไม่มีการระบุค่า จะใช้ค่าทั่วไปใน Etcd (``num retries to skip``, ค่าเริ่มต้นสามครั้ง)

source: Modify resource group scheduler options
ja: リソースグループのスケジューラーオプションを修正
th: ปรับเปลี่ยนตัวเลือกการกำหนดการกลุ่มทรัพยากร

source: You can create a new resource policy by clicking the CREATE button. Likewise other creating options, you cannot create a resource policy with the name that already exists, since name is the key value.
ja: CREATEボタンをクリックすると、新しいリソースポリシーを作成できます。同様に、他の作成オプションでも、名前がキー値であるため、既に存在する名前のリソースポリシーを作成することはできません。
ko: CREATE 버튼을 클릭하여 새로운 자원 정책을 생성할 수 있습니다.다른 생성하기 기능과 마찬가지로, 자원 정책 이름은 키 값이기 때문에, 이미 존재하는 자원 정책 이름과 동일한 이름을 갖는 자원 정책 생성은 불가능합니다.
th: คุณสามารถสร้างนโยบายทรัพยากรใหม่ได้โดยการคลิกที่ปุ่ม CREATE เช่นเดียวกับตัวเลือกการสร้างอื่น ๆ คุณไม่สามารถสร้างนโยบายทรัพยากรที่มีชื่อซ้ำได้ เนื่องจากชื่อเป็นค่าที่เป็นกุญแจ

source: Create resource group dialog
ja: リソースグループ作成ダイアログ
ko: 자원 그룹 생성 다이얼로그
th: กล่องสนทนาสร้างกลุ่มทรัพยากร

source: Storages
ja: ストレージ
ko: 저장소
th: ที่เก็บข้อมูล

source: On STORAGES tab, you can see what kind of mount volumes (usually NFS) exist. From 23.03 version, We provide per-user/per-project quota setting on storage that supports quota management. By using this feature, admin can easily manage and monitor the exact amount of storage usage for each user and project based folder.
ja: STORAGESタブでは、どのようなマウントボリューム（通常はNFS）が存在するかを確認できます。バージョン23.03から、クォータ管理をサポートするストレージ上で、ユーザーごと、プロジェクトごとのクォータ設定を提供しています。この機能を使用することで、管理者は各ユーザーおよびプロジェクトに基づいたフォルダごとの正確なストレージ使用量を簡単に管理および監視できます。
ko: STORAGES 탭에서는 시스템에 마운트 된 볼륨을 조회할 수 있습니다. 주로 NFS라고 생각하시면 됩니다. 23.03 버전부터는 쿼타 관리를 지원하는 스토리지에 대해 사용자별/프로젝트별 쿼타 설정이 가능합니다. 이 기능을 사용함으로써, 관리자는 좀 더 손쉽게 사용자와 프로젝트용 폴더가 스토리지 내에서 얼마만큼 공간을 차지하고 있는지 확인하고 관리할 수 있습니다.
th: ในแท็บ STORAGES คุณสามารถดูว่ามีประเภทของ volume ที่ติดตั้งอยู่ (โดยปกติจะเป็น NFS) อะไรบ้าง ตั้งแต่เวอร์ชัน 23.03 เป็นต้นไป เราได้กำหนดการตั้งค่าโควต้าต่อผู้ใช้/ต่อโครงการบนพื้นที่จัดเก็บที่รองรับการจัดการโควต้า ด้วยการใช้ฟีเจอร์นี้ ผู้ดูแลระบบสามารถจัดการและติดตามปริมาณการใช้พื้นที่จัดเก็บที่แน่นอนสำหรับแต่ละผู้ใช้และโฟลเดอร์ตามโครงการได้อย่างง่ายดาย

source: In order to set quota, you need to first access to storages tab in resource page. And then, click 'Setting (Gear)' in control column.
ja: クォータを設定するには、まずリソースページのストレージタブにアクセスする必要があります。その後、コントロール列の「設定（ギア）」をクリックします。
ko: 쿼타를 설정하기 위해서는 자원 페이지의 '저장소(Storage)' 탭을 누르고, 컨트롤 컬럼의 '설정' 버튼을 클릭합니다.
th: เพื่อกำหนดโควตา คุณต้องเข้าถึงแท็บสตอเรจในหน้าทรัพยากรก่อน จากนั้นคลิก 'การตั้งค่า (เกียร์)' ในคอลัมน์การควบคุม

source: Please remind that quota setting is only available in storage that provides quota setting (e.g. XFS, CephFS, NetApp, Purestorage, etc.). Although you can see the usage of storage in quota setting page regardless of storage, you cannot configure the quota which doesn't support quota configuration internally.
ja: クォータ設定は、クォータ設定を提供するストレージ（例：XFS、CephFS、NetApp、Purestorage など）でのみ利用可能であることに注意してください。ストレージに関係なくクォータ設定ページでストレージの使用状況を確認できますが、内部でクォータ設定をサポートしていないクォータの設定は構成できません。
ko: 쿼타 설정은 해당 기능을 제공하는 저장소 (예: XFS, CephFS, NetApp, Purestorage, 등)에 한해서만 가능합니다. 저장소의 쿼타 설정 기능 제공 여부에 관계없이 쿼타 설정 페이지를 제공하지만, 내부적으로 쿼타 설정을 지원하지 않는 저장소에 대해서는 쿼타를 설정할 수 없습니다.
th: โปรดทราบว่าการตั้งค่าคอนควอตจะสามารถทำได้เฉพาะในที่จัดเก็บข้อมูลที่รองรับการตั้งค่าคอนควอต (เช่น XFS, CephFS, NetApp, Purestorage เป็นต้น) แม้ว่าคุณจะสามารถดูการใช้งานที่จัดเก็บข้อมูลในหน้าการตั้งค่าคอนควอตได้ไม่ว่าจะเป็นที่จัดเก็บข้อมูลประเภทใด คุณไม่สามารถกำหนดค่าคอนควอตที่ไม่ได้รับการสนับสนุนการตั้งค่าคอนควอตภายในได้

source: Quota Setting Panel
ja: クオータ設定パネル
ko: 쿼타 설정 패널
th: แผงการตั้งค่าโควตา

source: In Quota setting page, there are two panels that represent the corresponding items for each panel's title.
ja: Quota設定ページには、各パネルのタイトルに対応するアイテムを表す2つのパネルがあります。
ko: 쿼타 설정 페이지에는 각 패널의 제목에 대응하는 두 개의 패널이 있습니다.
th: ในหน้าการตั้งค่าโควตาจะมีสองแผงที่แสดงรายการที่เกี่ยวข้องสำหรับชื่อแผงแต่ละอัน

source: Overview panel
ja: 概要パネル
ko: 스토리지 정보 패널
th: แผงภาพรวม

source: Usage: Shows the actual amount usage of the selected storage.
ja: 使用量: 選択したストレージの実際の使用量を表示します。
ko: 사용량: 선택된 저장소에서의 실제 사용량
th: การใช้งาน: แสดงปริมาณการใช้งานจริงของที่เก็บที่เลือก

source: Endpoint: Represents the mount point of the selected storage.
ja: エンドポイント: 選択されたストレージのマウントポイントを表します。
ko: 엔드포인트: 선택된 저장소가 스토리지 노드에 마운트된 경로
th: จุดสิ้นสุด: แทนจุดที่ตั้งของพื้นที่เก็บข้อมูลที่เลือก

source: Backend Type: The type of storage.
ja: バックエンドタイプ: ストレージのタイプ。
ko: 백엔드 타입: 저장소의 타입
th: ประเภท Backend: ชนิดของการจัดเก็บข้อมูล。

source: Capabilities: The supported feature of the selected storage.
ja: 機能: 選択されたストレージのサポートされている機能。
ko: 지원 기능: 선택된 저장소에서 지원하는 기능
th: ความสามารถ: ฟีเจอร์ที่รองรับของการจัดเก็บที่เลือก

source: Quota Settings
ja: クォータ設定
ko: 시스템 설정 조회
th: การตั้งค่าโควต้า

source: For User: Configure per-user quota setting here.
ja: ユーザー向け: ここでユーザーごとのクォータ設定を構成します。
ko: 사용자 대상: 사용자별로 쿼타를 설정합니다.
th: สำหรับผู้ใช้: กำหนดการตั้งค่าส่วนแบ่งของผู้ใช้ที่นี่。

source: For Project: Configure per-project quota(project-folder) setting here.
ja: プロジェクトの場合: ここでプロジェクトごとのクォータ（project-folder）設定を構成します。
ko: 프로젝트 대상: 프로젝트별로 쿼타(프로젝트-폴더) 를 설정합니다.
th: สำหรับโปรเจกต์: ตั้งค่าขีดจำกัดตามโปรเจกต์ (โฟลเดอร์โปรเจกต์) ที่นี่

source: ID: Corresponds to user or project id.
ja: ID: ユーザーまたはプロジェクトのIDに対応します。
ko: ID: 사용자나 프로젝트 ID에 대응합니다.
th: ID: ตรงกับรหัสผู้ใช้หรือรหัสโปรเจกต์

source: Hard Limit (GB): Currently set hard limit quota for selected quota.
ja: ハードリミット (GB): 選択されたクォータに対して現在設定されているハードリミットクォータ。
ko: Hard Limit (GB): 선택된 쿼타에서 현재 설정된 Hard Limit 쿼타를 표시합니다.
th: ขีดจำกัดสูงสุด (GB): ตั้งค่าขีดจำกัดสูงสุดสำหรับโควตาที่เลือกอยู่ในปัจจุบัน

source: Control: Provides editing the hard limit or even deleting the quota setting.
ja: 制御: ハードリミットの編集やクォータ設定の削除を行う機能を提供します。
ko: 설정: Hard limit 과 같은 설정값을 수정하거나, 쿼타 설정값을 삭제하는 기능을 제공합니다.
th: ควบคุม: ให้สามารถแก้ไขขีดจำกัดสูงสุดหรือลบการตั้งค่าโควตาได้

source: Set User Quota
ja: ユーザークォータを設定
ko: 사용자 쿼타 설정하기
th: ตั้งโควต้าผู้ใช้

source: In Backend.AI, there are two types of vfolders created by user and admin(project). In this section, we would like to show how to check current quota setting per-user and how to configure it. First, make sure the active tab of quota settings panel is ``For User``. Then, select user you desire to check and edit the quota. You can see the quota id that corresponds to user's id and the configuration already set in the table, if you already set the quota.
ja: Backend.AI には、ユーザーによって作成された vfolder と管理者（プロジェクト）によって作成された 2 種類の vfolder があります。このセクションでは、ユーザーごとの現在のクオータ設定を確認する方法と、その設定方法を紹介します。まず、クオータ設定パネルのアクティブなタブが ``For User`` になっていることを確認してください。次に、確認して編集したいユーザーを選択します。すでにクオータを設定している場合、ユーザーの id に対応するクオータ id と、その設定がテーブルに表示されています。
ko: Backend.AI에서는 사용자와 프로젝트 관리자에 의해 생성되는 두 가지 타입의 폴더가 있습니다. 이 섹션에서는, 사용자별로 현재 쿼타 설정값을 확인하고, 어떻게 값을 설정하는지 다룹니다. 우선, 쿼타 설정 패널의 활성화된 탭이 ``For User`` 인지 확인해주세요. 그 다음, 쿼타를 수정하고 확인할 대상인 사용자를 선택해주세요. 만일 쿼타가 이미 설정되어 있다면, 사용자 ID와 동일한 쿼타 ID 값이 테이블에 표시된 것을 확인하실 수 있습니다.
th: ใน Backend.AI มี vfolders สองประเภทที่สร้างโดยผู้ใช้และผู้ดูแลระบบ (โครงการ) ในส่วนนี้ เราต้องการแสดงวิธีการตรวจสอบการตั้งค่าส่วนแบ่งปัจจุบันต่อผู้ใช้และวิธีการกำหนดค่าให้กับมัน ก่อนอื่นให้แน่ใจว่าแท็บที่เปิดใช้งานของแผงการตั้งค่าส่วนแบ่งคือ ``For User`` จากนั้นเลือกผู้ใช้ที่คุณต้องการตรวจสอบและแก้ไขส่วนแบ่ง คุณสามารถเห็นหมายเลขส่วนแบ่งที่สอดคล้องกับหมายเลขผู้ใช้ และการกำหนดค่าที่ตั้งไว้ในตาราง หากคุณได้ตั้งค่าส่วนแบ่งไว้แล้ว

source: Of course, if you want to edit the quota, you can simply click the Edit button in the control column. After Clicking ``Edit`` button, you may see the small modal that enables configuring quota setting. After input the exact amount, don't forget to Click ``OK`` button, unless the changes will not be applied.
ja: もちろん、クォータを編集したい場合は、コントロール列の編集ボタンをクリックするだけです。``Edit`` ボタンをクリックすると、クォータ設定を構成できる小さなモーダルが表示されます。正確な値を入力した後、``OK`` ボタンをクリックすることを忘れないでください、さもなければ変更は適用されません。
ko: 물론, 쿼타를 수정하려고 할 경우, 컨트롤 컬럼의 수정 버튼을 선택하기만 하면 됩니다. ``Edit`` 버튼을 클릭하고 나면, 쿼타를 설정하는 작은 모달 창이 뜬 것을 확인하실 수 있습니다. 설정할 값을 정확히 입력 후, 반드시 ``OK`` 버튼을 클릭해주세요. 그렇지 않으면 변경 내용은 반영되지 않습니다.
th: แน่นอน ถ้าคุณต้องการแก้ไขโควตา คุณสามารถคลิกที่ปุ่มแก้ไขในคอลัมน์การควบคุม หลังจากคลิกปุ่ม ``Edit`` คุณอาจเห็นโมดัลขนาดเล็กที่ช่วยให้คุณตั้งค่าโควตาได้ หลังจากกรอกจำนวนที่แน่นอนแล้ว อย่าลืมคลิกปุ่ม ``OK`` มิฉะนั้นการเปลี่ยนแปลงจะไม่ถูกนำไปใช้

source: Set Project Quota
ja: プロジェクトクォータを設定
ko: 프로젝트 쿼타 설정하기
th: ตั้งโควต้าของโปรเจกต์

source: Setting a quota on project-folder is similar to setting a user quota. The difference between setting project quota and user quota is to confirm setting the project quota requires one more procedure, which is selecting the domain that the project is dependent on. The rest are the same. As in the picture below, you need to first select the domain, and then select the project.
ja: プロジェクトフォルダにクォータを設定することは、ユーザークォータを設定することと似ています。プロジェクトクォータとユーザークォータの設定の違いは、プロジェクトクォータを設定するには、プロジェクトが依存しているドメインを選択するという追加の手続きが必要であることです。それ以外は同じです。下の図のように、まずドメインを選択し、その後プロジェクトを選択する必要があります。
ko: 프로젝트 폴더에 대해 쿼타를 설정하는 것은 사용자 쿼타 설정과 유사합니다. 프로젝트별로 적용되는 쿼타와 사용자별로 적용되는 쿼타의 차이점은, 프로젝트별로 적용되는 쿼타에서는 프로젝트가 소속되어 있는 도메인을 우선 선택하는 과정이 추가되었다는 것입니다. 그 이후 과정은 동일합니다. 하단 그림에서 볼 수 있듯이, 우선 도메인을 선택하고, 적용할 프로젝트를 선택하면 됩니다.
th: การตั้งค่าส่วนแบ่งในโฟลเดอร์โปรเจคมีความคล้ายคลึงกับการตั้งค่าส่วนแบ่งของผู้ใช้ ความแตกต่างระหว่างการตั้งค่าส่วนแบ่งของโปรเจคและการตั้งค่าส่วนแบ่งของผู้ใช้คือการยืนยันการตั้งค่าส่วนแบ่งของโปรเจคต้องการขั้นตอนเพิ่มเติม ซึ่งคือการเลือกโดเมนที่โปรเจคขึ้นอยู่กับ ส่วนที่เหลือเหมือนกัน ตามภาพด้านล่าง คุณต้องเลือกโดเมนก่อนแล้วจึงเลือกโปรเจค

source: Unset Quota
ja: クォータの解除
ko: 쿼타 해제하기
th: ยกเลิกโควตา

source: We also provides the feature to unset the quota. Please remind that after removing the quota setting, quota will automatically follows user or project default quota, which cannot be set in WebUI. If you want to change the default quota setting, you may need to access to admin-only page. By Clicking ``Unset`` button in control column, the small snackbar message will show up and confirm whether you really want to delete the current quota setting. If you click ``OK`` button in the snackbar message, then it will delete the quota setting and automatically reset the quota follows to corresponding quota, which depends on the quota type(user / project).
ja: また、クォータを解除する機能も提供しています。クォータ設定を解除すると、クォータは自動的にユーザーまたはプロジェクトのデフォルトクォータに従うことになりますが、これはWebUIでは設定できないことを覚えておいてください。デフォルトクォータ設定を変更したい場合は、管理者専用ページにアクセスする必要があるかもしれません。コントロール列の「解除」ボタンをクリックすると、小さなスナックバーのメッセージが表示され、現在のクォータ設定を本当に削除したいか確認します。スナックバーのメッセージで「OK」ボタンをクリックすると、クォータ設定が削除され、クォータタイプ（ユーザー / プロジェクト）に応じた対応するクォータに自動的にリセットされます。
ko: 쿼타를 해제하는 기능도 제공합니다. 쿼타 설정값을 삭제한 뒤에는, 해당 프로젝트/사용자에 적용된 쿼타는 사용자 또는 프로젝트에서 기본적으로 적용된 쿼타를 따라가게 됩니다. 이 값은 WebUI에서 따로 설정하는 사용자 인터페이스를 지원하지 않습니다. 기본 쿼타 설정값을 변경하려면, 관리자 전용 페이지에 접근해서 해당 값을 변경해야 합니다. 컨트롤 컬럼에 있는 ``Unset`` 버튼을 클릭하면, 작은 스낵바 메시지 창이 뜨고, 현재 쿼타 세팅을 정말로 삭제할 것인지 확인하게 됩니다. 여기서 ``OK`` 버튼을 클릭하게 되면, 쿼타 설정값이 삭제되고, 자동으로 쿼타 설정값은 쿼타의 타입(사용자 / 프로젝트)에 대응하는 값으로 적용되게 됩니다.
th: เราให้บริการฟีเจอร์ในการยกเลิกการตั้งค่าค่าจำกัด โปรดจำไว้ว่าหลังจากลบการตั้งค่าค่าจำกัด ค่าจำกัดจะกลับไปตามค่าจำกัดเริ่มต้นของผู้ใช้หรือโครงการ ซึ่งไม่สามารถตั้งค่าใน WebUI ได้ หากคุณต้องการเปลี่ยนแปลงการตั้งค่าค่าจำกัดเริ่มต้น คุณอาจต้องเข้าถึงหน้าสำหรับผู้ดูแลระบบเท่านั้น โดยคลิกปุ่ม ``Unset`` ที่อยู่ในคอลัมน์การควบคุม ข้อความ snackbar ขนาดเล็กจะปรากฏขึ้นเพื่อยืนยันว่าคุณต้องการลบการตั้งค่าค่าจำกัดปัจจุบันหรือไม่ หากคุณคลิกที่ปุ่ม ``OK`` ในข้อความ snackbar แล้วมันจะลบการตั้งค่าค่าจำกัดและรีเซ็ตค่าจำกัดตามค่าที่เกี่ยวข้อง ซึ่งขึ้นอยู่กับประเภทค่าจำกัด (ผู้ใช้ / โครงการ)

source: If there's no config per user/project, then corresponding values in the user/project resource policy will be set as a default value. For example, If no hard limit value for quota is set, ``max_vfolder_size`` value in the resource policy is used as the default value.
ja: ユーザー/プロジェクトごとに設定がない場合、ユーザー/プロジェクトのリソースポリシー内の対応する値がデフォルト値として設定されます。例えば、クォータのハードリミット値が設定されていない場合、リソースポリシー内の``max_vfolder_size``の値がデフォルト値として使用されます。
ko: 만일 사용자 별/프로젝트 별 설정값이 없을 경우, 사용자/프로젝트 별 자원 정책 내 대응하는 값들이 기본 값으로 설정되게 됩니다. 예를 들어 쿼타에서 hard limit 값이 설정되어 있지 않다면, 자원 정책 내 ``max_vfolder_size`` 값이 기본 값으로 쓰이게 됩니다.
th: หากไม่มีการกำหนดค่าตามผู้ใช้/โครงการ ค่าที่ correspond ใน นโยบายทรัพยากรของผู้ใช้/โครงการจะถูกตั้งค่าเป็นค่าที่กำหนดล่วงหน้า ตัวอย่างเช่น หากไม่มีการตั้งค่าค่าขีดจำกัดสูงสุดสำหรับโควตา ``max_vfolder_size`` ใน นโยบายทรัพยากรจะถูกใช้เป็นค่าที่กำหนดล่วงหน้า

source: Download session lists
ja: セッションリストをダウンロード
ko: 세션 자원 다운로드
th: ดาวน์โหลดรายการเซสชัน

source: There's additional feature in Session page for admin. On the right side of the FINISHED tab there is a menu marked with ``...``. When you click this menu, a sub-menu export CSV appears.
ja: 管理者用のセッションページに追加機能があります。FINISHEDタブの右側には「...」でマーキングされたメニューがあります。このメニューをクリックすると、サブメニューとしてCSVのエクスポートが表示されます。
ko: 세션 페이지에는 관리자를 위한 추가 기능이 있습니다. FINISHED 탭 우측을 보면 ``…`` 으로 표시된 메뉴가 있습니다. 이 메뉴를 클릭하면 export CSV 라는 하위 메뉴가 나옵니다.
th: มีฟีเจอร์เพิ่มเติมในหน้าชั้นเรียนสำหรับผู้ดูแลระบบ ที่ด้านขวาของแท็บ FINISHED มีเมนูที่ระบุด้วย ``...`` เมื่อคุณคลิกที่เมนูนี้ จะมีซับเมนูส่งออก CSV ปรากฏขึ้น

source: If you click this menu, you can download the information of the comcpute sessions created so far in CSV format. After the following dialog opens, enter an appropriate file name (if necessary), click the EXPORT button and you will get the CSV file. Please note that a file name can have up to 255 characters.
ja: このメニューをクリックすると、これまでに作成された計算セッションの情報をCSV形式でダウンロードすることができます。次のダイアログが開いたら、適切なファイル名を入力し（必要に応じて）、EXPORTボタンをクリックするとCSVファイルが取得できます。ファイル名は最大255文字まで指定できることに注意してください。
ko: 이 메뉴를 클릭하면 현재까지 생성된 연산 세션의 정보를 CSV 형태로 다운로드 받을 수 있습니 다. 다음과 같은 다이얼로그가 열린 후, (필요한 경우) 적당한 파일 이름을 입력하고 EXPORT 버튼을 클릭하십시오. 파일 이름은 최대 255 자까지만 입력 가능한 점에 유의하십시오. 곧 CSV 파일 하나가 다운로드 될 것입니다.
th: ถ้าคุณคลิกเมนูนี้ คุณสามารถดาวน์โหลดข้อมูลของเซสชันการคำนวณที่สร้างขึ้นจนถึงปัจจุบันในรูปแบบ CSV หลังจากที่กล่องสนทนาข้างต้นเปิดขึ้น ให้ป้อนชื่อไฟล์ที่เหมาะสม (ถ้าจำเป็น) คลิกปุ่ม EXPORT และคุณจะได้รับไฟล์ CSV โปรดทราบว่าชื่อไฟล์สามารถมีได้สูงสุด 255 ตัวอักษร

source: System settings
ja: システム設定
ko: 시스템 설정 조회
th: การตั้งค่าระบบ
