Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/admin_menu/admin_menu.po
Languages: ja, ko, th

source: After creating the folder, you need to set and upload the model-definition.yaml file to the folder that you've just created. Following is the example of the model-definition file. If you want to know how to write model-definition file, please refer to :ref:`Model definition guide <model_definition_guide>` section.
ja: フォルダーを作成した後、model-definition.yaml ファイルを設定し、作成したばかりのフォルダーにアップロードする必要があります。以下はモデル定義ファイルの例です。モデル定義ファイルの書き方については、:ref:`モデル定義ガイド <model_definition_guide>` セクションを参照してください。
th: หลังจากสร้างโฟลเดอร์แล้ว คุณต้องตั้งค่าและอัปโหลดไฟล์ model-definition.yaml ไปยังโฟลเดอร์ที่คุณเพิ่งสร้าง ข้างล่างนี้คือตัวอย่างของไฟล์ model-definition หากคุณต้องการทราบวิธีการเขียนไฟล์ model-definition กรุณาอ้างอิงไปที่ส่วน :ref:`Model definition guide <model_definition_guide>`

source: Once the model-definition file is uploaded, the model card will appear in the model store section.
ja: モデル定義ファイルがアップロードされると、モデルカードがモデルストアセクションに表示されます。
th: เมื่อไฟล์กำหนดโมเดลได้รับการอัปโหลด การ์ดโมเดลจะปรากฏในส่วนของร้านโมเดล

source: Model card added
ja: モデルカードが追加されました
th: เพิ่มการ์ดโมเดล

source: You need to download model manually after setting model-definition file. For downloading the model file to folder, you can mount the model folder to session creation and download file to there by referring `Downloading models <https://huggingface.co/docs/hub/models-downloading>`_ .
ja: モデル定義ファイルを設定した後、手動でモデルをダウンロードする必要があります。モデルファイルをフォルダーにダウンロードするには、セッション作成時にモデルフォルダーをマウントし、`Downloading models <https://huggingface.co/docs/hub/models-downloading>`_ を参照してそこにファイルをダウンロードできます。
th: คุณต้องดาวน์โหลดโมเดลด้วยตนเองหลังจากตั้งค่าไฟล์การกำหนดโมเดล สำหรับการดาวน์โหลดไฟล์โมเดลไปยังโฟลเดอร์ คุณสามารถเชื่อมต่อโฟลเดอร์โมเดลกับการสร้างเซสชันและดาวน์โหลดไฟล์ไปที่นั่นโดยอ้างอิงจาก `Downloading models <https://huggingface.co/docs/hub/models-downloading>`_ .

source: Clicking on the model card you've just created will display the details of the model-definition file you uploaded. Now, every member of the project can access the model card and clone it.
ja: 作成したモデルカードをクリックすると、アップロードしたモデル定義ファイルの詳細が表示されます。これで、プロジェクトのすべてのメンバーがモデルカードにアクセスし、クローンを作成できます。
th: การคลิกที่การ์ดโมเดลที่คุณเพิ่งสร้างขึ้นจะแสดงรายละเอียดของไฟล์การกำหนดโมเดลที่คุณได้อัปโหลด ตอนนี้สมาชิกทุกคนในโครงการสามารถเข้าถึงการ์ดโมเดลและสร้างสำเนาได้

source: Model card detail
ja: モデルカードの詳細
th: รายละเอียดบัตรโมเดล

source: Manage Resource Policy
ja: リソースポリシーの管理
ko: 자원 정책 관리
th: จัดการนโยบายทรัพยากร

source: Keypair Resource Policy
ja: キーペアリソースポリシー
ko: 키페어 자원 정책
th: นโยบายทรัพยากร Keypair

source: In Backend.AI, administrators have the ability to set limits on the total resources available for each keypair, user, and project. Resource policies enable you to define the maximum allowed resources and other compute session-related settings. Additionally, it is possible to create multiple resource policies for different needs, such as user or research requirements, and apply them on an individual basis.
ja: Backend.AIでは、管理者は各キーペア、ユーザー、およびプロジェクトに対して利用可能な総リソースに制限を設定することができます。リソースポリシーを使用すると、許可される最大リソースやその他のコンピュートセッションに関連する設定を定義することができます。さらに、ユーザーや研究の要件に応じて複数のリソースポリシーを作成し、個別に適用することも可能です。
th: ใน Backend.AI ผู้ดูแลระบบมีความสามารถในการตั้งขีดจำกัดเกี่ยวกับทรัพยากรทั้งหมดที่มีอยู่สำหรับแต่ละคู่กุญแจ ผู้ใช้ และโครงการ นโยบายทรัพยากรช่วยให้คุณกำหนดทรัพยากรสูงสุดที่อนุญาตและการตั้งค่าอื่น ๆ ที่เกี่ยวข้องกับเซสชันคอมพิวเตอร์ นอกจากนี้ยังสามารถสร้างนโยบายทรัพยากรหลายรายการสำหรับความต้องการที่แตกต่างกัน เช่น ความต้องการของผู้ใช้หรือการวิจัย และนำไปใช้เป็นกรณี ๆ ไป

source: The Resource Policy page allows administrators to view a list of all registered resource policies. Administrators can review the resource policies established for keypairs, users, and projects directly on this page. Let's begin by examining the resource policies for keypairs. In the figure below, there are three policies in total (gardener, student, default). The infinity symbol (∞) indicates that no resource restrictions have been applied to those resources.
ja: リソースポリシーページでは、管理者が登録されているすべてのリソースポリシーの一覧を表示できます。管理者は、このページ上で直接、キーペア、ユーザー、プロジェクトに対して設定されたリソースポリシーを確認できます。まずは、キーペアのリソースポリシーを調べてみましょう。下図では、合計で3つのポリシー（gardener、student、default）があります。無限大記号（∞）は、それらのリソースに制限が適用されていないことを示しています。
th: หน้ากฎเกณฑ์ทรัพยากรช่วยให้ผู้ดูแลระบบสามารถดูรายชื่อของกฎเกณฑ์ทรัพยากรที่ลงทะเบียนทั้งหมด ผู้ดูแลระบบสามารถตรวจสอบกฎเกณฑ์ทรัพยากรที่กำหนดไว้สำหรับคู่กุญแจ ผู้ใช้ และโครงการโดยตรงที่หน้านี้ มาลองเริ่มต้นโดยการตรวจสอบกฎเกณฑ์ทรัพยากรสำหรับคู่กุญแจ ในภาพด้านล่าง มีนโยบายทั้งหมดสามรายการ (gardener, student, default) สัญลักษณ์อนันต์ (∞) แสดงว่ามิได้มีข้อจำกัดทรัพยากรใด ๆ ที่นำไปใช้กับทรัพยากรเหล่านั้น

source: Resource policy page
ja: リソースポリシーページ
ko: 자원 정책
th: หน้านโยบายทรัพยากร

source: The user account being used in this guide is currently assigned to the default resource policy. This can be verified in the Credentials tab on the Users page. In the Resource Policy panel, you can also observe that all resources can be utilized up to the hardware limit (∞).
ja: このガイドで使用されるユーザーアカウントは、現在デフォルトのリソースポリシーに割り当てられています。これは、ユーザーページの資格情報タブで確認できます。リソースポリシーパネルでは、すべてのリソースがハードウェアの制限（∞）まで利用可能であることも確認できます。
ko: 이 가이드에서 사용 중인 사용자 계정은 현재 default 자원 정책에 할당되어 있습니다. 이 정보는 사용자 페이지의 자격 증명 탭에서 확인할 수 있습니다. 자원 정책 패널에서는 모든 자원이 하드웨어 한도까지 사용 가능함을 확인할 수 있습니다 (∞).
th: บัญชีผู้ใช้ที่ใช้ในคู่มือนี้ถูกกำหนดให้กับนโยบายทรัพยากรเริ่มต้น สามารถตรวจสอบได้ในแท็บข้อมูลประจำตัวในหน้า ผู้ใช้ ในแผงนโยบายทรัพยากร คุณยังสามารถสังเกตเห็นว่าทรัพยากรทั้งหมดสามารถใช้ประโยชน์ได้จนถึงขีดจำกัดของฮาร์ดแวร์ (∞)

source: To modify resource policies, click the 'Setting (Gear)' in the Control column of the default policy group. In the Update Resource Policy dialog, every option is editable except for Policy Name, which serves as the primary key for distinguishing resource policies in the list. Uncheck the Unlimited checkbox at the bottom of CPU, RAM, and fGPU, and set the resource limits to the desired values. Ensure that the allocated resources are less than the total hardware capacity. In this case, set CPU, RAM, and fGPU to 2, 4, and 1 respectively. Click the OK button to apply the updated resource policy.
ja: リソースポリシーを変更するには、デフォルトのポリシーグループのコントロール列にある「設定（ギア）」をクリックします。リソースポリシー更新ダイアログでは、リスト内でリソースポリシーを区別するための主キーとして機能する「ポリシー名」を除くすべてのオプションが編集可能です。CPU、RAM、およびfGPUの下部にある無制限のチェックボックスをオフにし、リソース制限を希望する値に設定します。割り当てられたリソースがハードウェアの総容量より少ないことを確認してください。この場合、CPU、RAM、およびfGPUをそれぞれ2, 4, および1に設定します。更新されたリソースポリシーを適用するには、OKボタンをクリックします。
ko: 자원 정책을 수정하려면 기본 정책 그룹의 제어 열에 있는 '설정' 버튼을 클릭합니다. 자원 정책 업데이트 다이얼로그에서 정책 이름을 제외한 모든 옵션을 편집할 수 있으며, 이는 목록에서 자원 정책을 구별하는 주요 키 역할을 합니다. 여기에서는 CPU, RAM 및 fGPU 하단의 무제한 확인란을 해제하고 원하는 값으로 리소스 제한을 설정하겠습니다. 할당된 리소스는 총 하드웨어 용량보다 작아야 합니다. 이 경우 CPU, RAM 및 fGPU를 각각 2, 4, 1로 설정하겠습니다. 업데이트된 자원 정책을 적용하려면 OK 버튼을 클릭합니다.
th: ในการแก้ไขนโยบายทรัพยากร ให้คลิกที่ 'การตั้งค่า (ฟันเฟือง)' ในคอลัมน์ควบคุมของกลุ่มนโยบายเริ่มต้น ในกล่องโ โต้ตอบอัปเดตนโยบายทรัพยากร ตัวเลือกทุกตัวสามารถแก้ไขได้ ยกเว้นชื่อ นโยบายซึ่งทำหน้าที่เป็นคีย์หลักในการแยกนโยบายทรัพยากรในรายการ ยกเลิกการเลือกช่องทำเครื่องหมายไม่จำกัดที่ด้านล่างของ CPU, RAM และ fGPU และตั้งค่าขีดจำกัดทรัพยากรให้เป็นค่าที่ต้องการ ตรวจสอบให้แน่ใจว่าทรัพยากรที่จัดสรรมีค่าน้อยกว่าความสามารถของฮาร์ดแวร์รวม ในกรณีนี้ ให้ตั้งค่า CPU, RAM และ fGPU เป็น 2, 4 และ 1 ตามลำดับ คลิกปุ่มตกลงเพื่อใช้การอัปเดตนโยบายทรัพยากร

source: Update resource policy dialog
ja: リソースポリシー更新ダイアログ
ko: 자원 정책 수정 다이얼로그
th: กล่องสนทนานโยบายทรัพยากรอัปเดต

source: About details of each option in resource policy dialog, see the description below.
ja: リソースポリシーダイアログ内の各オプションの詳細については、以下の説明を参照してください。
ko: 자원 정책 창의 각 옵션에 대한 자세한 내용은 아래 설명을 참조하세요.
th: เกี่ยวกับรายละเอียดของแต่ละตัวเลือกในกล่องสนทนานโยบายทรัพยากร ดูคำอธิบายด้านล่าง

source: Resource Policy
ja: リソースポリシー
ko: 자원 정책
th: นโยบายทรัพยากร

source: CPU: Specify the maximum amount of CPU cores. (max value: 512)
ja: CPU: 最大CPUコア数を指定します。（最大値: 512）
ko: CPU : CPU 코어 최대 할당 가능량 설정. (최대 입력 값: 512)
th: CPU: ระบุจำนวนคอร์ CPU สูงสุดที่ต้องการใช้ (ค่าสูงสุด: 512)

source: Memory: Specify the maximum amount of memory in GB. It would be good practice to set memory twice as large as the maximum value of GPU memory. (max value: 1024)
ja: メモリ: メモリの最大量をGB単位で指定します。GPUメモリの最大値の2倍のメモリを設定することは良い習慣です。（最大値: 1024）
ko: Memory : GB 단위로 최대 할당 가능한 메모리 양 설정. 최대 할당 가능한 GPU 메모리 양의 두 배 이상으로 설정하는 것이 권장됨. (최대 입력 값: 1024)
th: หน่วยความจำ: ระบุปริมาณหน่วยความจำสูงสุดเป็น GB จะเป็นการดีหากตั้งหน่วยความจำให้ใหญ่เป็นสองเท่าของค่าหน่วยความจำ GPU สูงสุด (ค่าสูงสุด: 1024)

source: CUDA-capable GPU: Specify the maximum amount of physical GPUs. If fractional GPU is enabled by the server, this setting has no effect. (max value: 64)
ja: CUDA対応GPU: 物理GPUの最大数量を指定します。サーバーがフラクショナルGPUを有効にしている場合、この設定は影響を与えません。（最大値: 64）
ko: CUDA-capable GPU : 할당 가능한 최대 물리 GPU 개수 설정. 서버에서 GPU 분할 가상화 기능이 켜져 있는 경우에는 적용되지 않음. (최대 입력 값: 64) * 대부분의 엔터프라이즈 사이트에는 GPU 분할 가상화 기능이 켜져 있음.
th: GPU ที่รองรับ CUDA: กำหนดจำนวน GPU ทางกายภาพสูงสุด หากเซิร์ฟเวอร์เปิดใช้งาน GPU เฟรกชัน ตัวตั้งค่านี้จะไม่มีผล (ค่ารวมสูงสุด: 64)

source: CUDA-capable GPU (fractional): Fractional GPU (fGPU) is literally split a single GPU to multiple partitions in order to use GPU efficiently. Notice that the minimum amount of fGPU required is differed by each image. If fractional GPU is not enabled by the server, this settings has no effect. (max value: 256)
ja: CUDA対応GPU（フラクショナル）: フラクショナルGPU（fGPU）は、GPUを効率よく使用するために、1台のGPUを複数のパーティションに文字通り分割します。fGPUの最小必要量は各イメージによって異なることに注意してください。サーバーでフラクショナルGPUが有効になっていない場合、この設定は効果がありません。（最大値: 256）
ko: CUDA-capable GPU (fractional) : Backend.AI 의 Fractional GPU (fGPU) 기능이 켜져 있으면, 물리 GPU 를 분할하여 여러 사용자 세션에 나눠어 배치하고 효율적으로 사용할 수 있음. 할당 가능한 최대 분할 GPU 양은 여기서 설정합니다. 만약 서버에 GPU 분할 가상화 기능이 꺼져 있다면, 이 항목은 적용되지 않습니다. (최대 입력 값: 256)
th: GPU ที่รองรับ CUDA (ส่วนย่อย): GPU ส่วนย่อย (fGPU) คือการแบ่ง GPU เดียวออกเป็นหลายพาร์ติชั่นเพื่อใช้ GPU อย่างมีประสิทธิภาพ ควรสังเกตว่าจำนวนขั้นต่ำของ fGPU ที่ต้องการจะแตกต่างกันไปตามแต่ละภาพ หาก GPU ส่วนย่อยไม่ได้เปิดใช้งานโดยเซิร์ฟเวอร์ การตั้งค่านี้จะไม่มีผล (ค่ามากสุด: 256)

source: Sessions
ja: セッション
ko: 연산 세션
th: เซสชัน

source: Container Per Session: The maximum number of containers per session. To make a user to create a cluster session, this value should be greater than 1. (max value: 100)
ja: セッションごとのコンテナ数: セッションごとに作成できる最大コンテナ数。この値が1より大きい場合、ユーザーはクラスタセッションを作成できます。（最大値: 100）
ko: Container Per Session : 한 세션이 가질 수 있는 최대 컨테이너의 수. 사용자가 클러스터 세션을 생성할 수 있게 하려면, 이 값이 1보다 커야 함. (최대 입력 값: 100)
th: จำนวน Container ต่อเซสชัน: จำนวนสูงสุดของ containers ต่อเซสชัน เพื่อให้ผู้ใช้สามารถสร้างเซสชันคลัสเตอร์ได้ ค่า นี้ควรมีค่ามากกว่า 1 (ค่ามากสุด: 100)

source: Session Lifetime (sec.): Limits the maximum lifetime of a compute session from the reservation in the active status, including ``PENDING`` and ``RUNNING`` statuses. After this time, the session will be force-terminated even if it is fully utilized. This will be useful to prevent the session from running indefinitely.
ja: セッションの有効期間 (秒): ``PENDING`` や ``RUNNING`` のステータスを含む、アクティブな状態でのリザベーションから計算セッションの最大有効期間を制限します。この時間が経過すると、セッションは完全に利用されている場合でも強制終了されます。これにより、セッションが無制限に実行されるのを防ぐことができます。
ko: Session Lifetime (sec.): 세션이 예약 시간 이후 활성 상태로 존재할 수 있는 최대 시간. 활성 상태는 ``PENDING`` 및 ``RUNNING`` 상태를 포함함. 예약 후 설정된 시간이 지나면 세션이 사용중이라 할지라도 강제로 종료됨. 사용중이라 할지라도 강제로 종료됩니다. 연산 세션이 무한히 실행되는 것을 방지할 때 유용한 옵션.
th: ระยะเวลาเซสชัน (วินาที): จำกัดระยะเวลาสูงสุดของเซสชันการคอมพิวเตอร์จากการจองในสถานะที่ใช้งานอยู่ ซึ่งรวมถึงสถานะ ``PENDING`` และ ``RUNNING`` หลังจากเวลานี้ เซสชันจะถูกบังคับให้สิ้นสุด แม้ว่าจะถูกใช้งานอย่างเต็มที่ ซึ่งจะมีประโยชน์ในการป้องกันไม่ให้เซสชันทำงานต่อไปอย่างไม่สิ้นสุด

source: Concurrent Jobs: Maximum number of concurrent compute session per keypair. If this value is set to 3, for example, users bound to this resource policy cannot create more than 3 compute sessions simultaneously. (max value: 100)
ja: 同時実行ジョブ: キーペアごとの同時コンピュートセッションの最大数。この値が例えば3に設定されている場合、このリソースポリシーに結び付けられたユーザーは同時に3つ以上のコンピュートセッションを作成することはできません。（最大値: 100）
ko: Concurrent Jobs: 키페어를 통해 동시에 생성할 수 있는 최대 연산 세션의 개수입니다. 예를 들어, 이 값이 3 으로 지정되어 있을 경우, 해당 정책에 영향을 받는 사용자는 동시에 3개가 넘는 연산 세션을 생성할 수 없음. (최대 입력 값: 100)
th: งานขนาน: จำนวนเซสชันการคอมพิวเตอร์ขนานสูงสุดต่อคู่กุญแจ หากค่าดังกล่าวตั้งไว้ที่ 3 ตัวอย่างเช่น ผู้ใช้ที่ผูกติดกับนโยบายทรัพยากรนี้ไม่สามารถสร้างเซสชันการคอมพิวเตอร์ได้มากกว่า 3 เซสชันพร้อมกัน (ค่าสูงสุด: 100)

source: Idle timeout (sec.): Configurable period of time during which the user can leave their session untouched. If there is no activity at all on a compute session for idle timeout, the session will be garbage collected and destroyed automatically. The criteria of the "idleness" can be various and set by the administrators. (max value: 15552000 (approx. 180 days))
ja: アイドルタイムアウト (秒): ユーザーがセッションを操作せずに放置できる設定可能な時間の期間です。計算セッションでアイドルタイムアウト中に全くアクティビティがない場合、セッションはガベージコレクションされ、自動的に破棄されます。「アイドル状態」の基準は様々であり、管理者によって設定されます。（最大値：15552000（約180日））
ko: Idle timeout (sec.): 사용자가 세션에 영향을 주지 않고 비활성 상태일 수 있는 최대 시간. 유휴 제한 시간 동안 연산 세션에 활동이 감지되지 않으면, 해당 세션이 자동으로 삭제됨. 활동을 측정하는 기준은 다양하며, 관리자가 설정할 수 있음. (최대 입력 값: 15552000(초) (약 180 일))
th: เวลาเงียบสงบ (วินาที): ระยะเวลาที่สามารถตั้งค่าได้ซึ่งผู้ใช้สามารถปล่อยให้เซสชันของตนไม่ถูกแตะต้อง หากไม่มีการทำกิจกรรมใด ๆ ในเซสชันคอมพิวเตอร์เป็นเวลาที่ตั้งค่าไว้ เซสชันจะถูกเก็บขยะและถูกทำลายโดยอัตโนมัติ เกณฑ์ของ "ความเงียบสงบ" สามารถแตกต่างกันออกไปและตั้งค่าโดยผู้ดูแลระบบ (ค่าสูงสุด: 15552000 (ประมาณ 180 วัน))

source: Folders
ja: フォルダー
ko: 폴더
th: โฟลเดอร์

source: Allowed hosts: Backend.AI supports many NFS mountpoint. This field limits the accessibility to them. Even if a NFS named "data-1" is mounted on Backend.AI, users cannot access it unless it is allowed by resource policy.
ja: 許可されたホスト: Backend.AIは多くのNFSマウントポイントをサポートしています。このフィールドはそれらへのアクセス制限を行います。たとえ "data-1" という名前のNFSがBackend.AIにマウントされていても、リソースポリシーで許可されていない限り、ユーザーはアクセスできません。
ko: Allowed hosts : Backend.AI 는 여러 NFS 마운트포인트를 인식할 수 있음. 이 항목을 통해 사용자가 접근할 수 있는 마운트 위치를 지정할 수 있음. 예를 들어, “data-1” 이라는 NFS 가 Backend.AI 에서 인식되어 있는 상태일지라도, Allowed hosts 정책으로 허용되지 않은 경우 사용자는 해당 NFS 에 접근할 수 없음.
th: โฮสต์ที่อนุญาต: Backend.AI สนับสนุนหลายจุดเชื่อมต่อ NFS ฟิลด์นี้จะจำกัดการเข้าถึงไปยังพวกเขา แม้ว่า NFS ที่ชื่อว่า "data-1" จะถูกเชื่อมต่อบน Backend.AI แต่ผู้ใช้ไม่สามารถเข้าถึงได้ เว้นแต่จะได้รับอนุญาตจากนโยบายทรัพยากร

source: (Deprecated since 23.09.4) Max. #: the maximum number of storage folders that can be created/invited. (max value: 100).
ja: (23.09.4より非推奨) Max. #: 作成/招待可能なストレージフォルダーの最大数。(最大値: 100)。
ko: (23.09.4 이후로 사용 중단) Max. #: 생성 또는 공유 초대 받을 수 있는 저장 폴더의 최대 개수. (최대 입력 값: 50)
th: (เลิกใช้งานตั้งแต่ 23.09.4) สูงสุด #: จำนวนสูงสุดของโฟลเดอร์จัดเก็บที่สามารถสร้าง/เชิญได้ (ค่าที่สูงสุด: 100)

source: In the keypair resource policy list, check that the Resources value of the default policy has been updated.
ja: キーペアリソースポリシー一覧で、デフォルトポリシーのResources値が更新されていることを確認します。
ko: 키페어 자원 정책 리스트에서 default 정책의 Resources 값이 업데이트 된 것을 확인합니다.
th: ในรายการนโยบายทรัพยากร keypair ให้ตรวจสอบว่าค่า Resources ของนโยบายเริ่มต้นได้รับการอัปเดตแล้ว

source: You can create a new resource policy by clicking the Create button. Each setting value is the same as described above.
ja: 新しいリソースポリシーを作成するには、作成ボタンをクリックします。各設定値は前述の説明と同じです。
ko: Create 버튼을 클릭하여 새로운 자원 정책을 생성할 수 있습니다. 각 설정값의 의미는 상기한 설명과 동일합니다.
th: คุณสามารถสร้างนโยบายทรัพยากรใหม่ได้โดยการคลิกที่ปุ่มสร้าง ค่าในการตั้งค่าทุกค่าคือเดียวกันกับที่อธิบายไว้ข้างต้น

source: To create a resource policy and associate it with a keypair, go to the Credentials tab of the Users page, click the gear button located in the Controls column of the desired keypair, and click the Select Policy field to choose it.
ja: リソースポリシーを作成し、それをキーペアに関連付けるには、ユーザーページの認証情報タブに移動し、目的のキーペアのコントロール列にある歯車ボタンをクリックして、ポリシー選択フィールドをクリックし、選択してください。
ko: 키페어 자원 정책을 생성한 후 키페어에 연결하기 위해서는 Users 페이지의 Credentials 탭으로 가서 원하는 키페어의 Controls 열에 위치한 '설정' 버튼을 누른 후, Select Policy 필드를 클릭하여 선택합니다.
th: ในการสร้างนโยบายทรัพยากรและเชื่อมโยงกับคู่กุญแจ ให้ไปที่แท็บข้อมูลประจำตัวในหน้าผู้ใช้ คลิกปุ่มเกียร์ที่อยู่ในคอลัมน์การควบคุมของคู่กุญแจที่ต้องการ และคลิกฟิลด์เลือกนโยบายเพื่อเลือกนโยบายดังกล่าว

source: You can also delete each of resource keypairs by clicking trash can icon in the Control column. When you click the icon, the confirmation popup will appears. Click 'Delete' button to erase."
ja: リソースキー ペアのそれぞれを、[Control] 列にあるゴミ箱アイコンをクリックして削除することもできます。アイコンをクリックすると、確認ポップアップが表示されます。[Delete] ボタンをクリックして消去します。
ko: Control 열의 '휴지통' 아이콘을 클릭하여 각 리소스 키페어를 삭제할 수 있습니다. 아이콘을 클릭하면 확인 팝업이 나타납니다. 삭제하려면 'Delete' 버튼을 클릭하세요.
th: คุณยังสามารถลบคู่กุญแจทรัพยากรแต่ละคู่ได้โดยการคลิกที่ไอคอนถังขยะในคอลัมน์ควบคุม เมื่อคุณคลิกที่ไอคอน ระบบจะปรากฏหน้าต่างยืนยัน คลิกที่ปุ่ม 'ลบ' เพื่อลบข้อมูล

source: If there's any users (including inactive users) following a resource policy to be deleted, deletion may not be done. Before deleting a resource policy, please make sure that no users remain under the resource policy.
ja: 削除されるリソースポリシーをフォローしているユーザー（非アクティブなユーザーを含む）がいる場合、削除は行われない場合があります。リソースポリシーを削除する前に、そのリソースポリシーに属するユーザーがいないことを確認してください。
ko: 비활성 사용자를 포함한 어떤 유저가 삭제할 자원 정책을 따르고 있다면, 삭제가 되지 않을 수 있습니다. 자원 정책을 삭제하기 위해서는 반드시 해당 자원 정책을 선택한 사용자가 남아 있지 않아야 합니다.
th: หากมีผู้ใช้ใด ๆ (รวมถึงผู้ใช้ที่ไม่ใช้งาน) ที่ติดตามนโยบายทรัพยากรที่จะถูกลบ การลบอาจไม่สามารถทำได้ ก่อนที่จะลบนโยบายทรัพยากร กรุณาให้แน่ใจว่าไม่มีผู้ใช้คนใดเหลืออยู่ภายใต้ นโยบายทรัพยากรนั้น

source: If you want to hide or show specific columns, click the 'Setting (Gear)' at the bottom right of the table. This will bring up a dialog where you can select the columns you want to display.
ja: 特定の列を非表示または表示したい場合は、テーブルの右下にある「設定（ギア）」をクリックします。これにより、表示したい列を選択できるダイアログが表示されます。
ko: 특정 열을 숨기거나 보고 싶다면 테이블 우측 하단의 '설정' 버튼을 클릭합니다. 이후에는 아래에 다이얼로그가 표시되어 보고 싶은 열을 선택할 수 있습니다.
th: หากคุณต้องการซ่อนหรือแสดงคอลัมน์เฉพาะ ให้คลิกที่ 'การตั้งค่า (ฟันเฟือง)' ที่มุมขวาล่างของตาราง ซึ่งจะเปิดหน้าต่างที่ให้คุณเลือกคอลัมน์ที่ต้องการแสดง

source: Keypair resource policy table settings
ja: キーペアリソースポリシーテーブル設定
ko: 키페어 자원 정책 수정 다이얼로그
th: การตั้งค่าตารางนโยบายทรัพยากรคีย์พาร์ส

source: User Resource Policy
ja: ユーザーリソースポリシー
ko: 사용자 자원 정책
th: นโยบายทรัพยากรผู้ใช้

source: Starting from version 24.03, Backend.AI supports user resource policy management. While each user can have multiple keypairs, a user can only have one user resource policy. In the user resource policy page, users can set restrictions on various settings related to folders such as Max Folder Count and Max Folder Size, as well as individual resource limits like Max Session Count Per Model Session and Max Customized Image Count.
ja: バージョン24.03から、Backend.AIはユーザーリソースポリシー管理をサポートしています。各ユーザーは複数のキーペアを持つことができますが、ユーザーリソースポリシーは1つだけ持つことができます。ユーザーリソースポリシーページでは、最大フォルダー数や最大フォルダーサイズなど、フォルダーに関連するさまざまな設定の制限を設定できるほか、モデルセッションごとの最大セッション数や最大カスタマイズイメージ数といった個別のリソース制限も設定できます。
ko: 24.03 버전부터 Backend.AI는 사용자 자원 정책 관리를 지원합니다. 각 사용자는 여러 키페어를 가질 수 있지만 사용자 당 사용자 자원 정책은 하나만 가질 수 있습니다. 사용자 자원 정책 페이지에서는 Max Folder Count 및 Max Folder Size와 같은 폴더 관련 다양한 설정을 제한 할 수 있으며, Max Session Count Per Model Session 및 Max Customized Image Count와 같은 개별 리소스를 제한 할 수 있습니다.
th: เริ่มตั้งแต่เวอร์ชัน 24.03 Backend.AI รองรับการจัดการนโยบายทรัพยากรของผู้ใช้ ขณะที่ผู้ใช้แต่ละคนสามารถมีคู่กุญแจหลายคู่ แต่ผู้ใช้จะมีนโยบายทรัพยากรของผู้ใช้เพียงนโยบายเดียว ในหน้าเก็บนโยบายทรัพยากรของผู้ใช้ ผู้ใช้สามารถตั้งค่าข้อจำกัดในหลายการตั้งค่าที่เกี่ยวข้องกับโฟลเดอร์ เช่น จำนวนโฟลเดอร์สูงสุดและขนาดโฟลเดอร์สูงสุด รวมถึงข้อจำกัดทรัพยากรแต่ละรายการ เช่น จำนวนเซสชันสูงสุดต่อเซสชันโมเดลและจำนวนภาพที่กำหนดเองสูงสุด

source: User resource policy list
ja: ユーザーリソースポリシーリスト
ko: 사용자 자원 정책 리스트
th: รายการนโยบายทรัพยากรผู้ใช้

source: To create a new user resource policy, click the Create button.
ja: 新しいユーザーリソースポリシーを作成するには、作成ボタンをクリックします。
ko: 테이블 오른쪽 위에 있는 Create 버튼을 클릭하여 새로운 사용자 자원 정책을 생성할 수 있습니다.
th: ในการสร้างนโยบายทรัพยากรผู้ใช้ใหม่ ให้คลิกที่ปุ่มสร้าง

source: Create user resource policy dialog
ja: ユーザーリソースポリシーダイアログを作成
ko: 사용자 자원 정책 수정 다이얼로그
th: สร้างกล่องสนทนานโยบายทรัพยากรผู้ใช้

source: Name: The name of the user resource policy.
ja: 名前: ユーザーリソースポリシーの名前。
ko: Name: 사용자 자원 정책의 이름.
th: ชื่อ: ชื่อของนโยบายทรัพยากรผู้ใช้

source: Max Folder Count: The maximum number of folders that the user can create. If the user's folder count exceeds this value, user cannot create a new folder. If set to Unlimited, it is displayed as "∞".
ja: 最大フォルダ数: ユーザーが作成できるフォルダの最大数。この値を超えると、新しいフォルダを作成することはできません。「無制限」に設定されている場合、「∞」と表示されます。
ko: Max Folder Count: 사용자가 생성할 수 있는 최대 폴더 수. 사용자의 폴더 수가 해당 값을 초과하면 새 폴더를 생성할 수 없게 되며, 무제한으로 설정된 경우에는 “∞“로 표시됨.
th: จำนวนโฟลเดอร์สูงสุด: จำนวนโฟลเดอร์สูงสุดที่ผู้ใช้สามารถสร้างได้ หากจำนวนโฟลเดอร์ของผู้ใช้เกินค่าดังกล่าว ผู้ใช้จะไม่สามารถสร้างโฟลเดอร์ใหม่ได้ หากตั้งค่าเป็นไม่จำกัด จะปรากฏเป็น "∞"

source: Max Folder Size: The maximum size of the user's storage space. If user's storage space exceeds this value, user cannot create a new data folder. If set to Unlimited, it is displayed as "∞".
ja: 最大フォルダサイズ: ユーザのストレージスペースの最大サイズ。この値を超えた場合、ユーザは新しいデータフォルダを作成することができません。「無制限」に設定されている場合、「∞」と表示されます。
ko: Max Folder Size: 사용자의 저장 공간의 최대 크기. 사용자의 저장 공간이 해당 값을 초과하면 사용자는 새 데이터 폴더를 만들 수 없게 되며, 무제한으로 설정된 경우에는 “∞“로 표시됨.
th: ขนาดโฟลเดอร์สูงสุด: ขนาดสูงสุดของพื้นที่จัดเก็บข้อมูลของผู้ใช้ หากพื้นที่จัดเก็บข้อมูลของผู้ใช้เกินค่าดังกล่าว ผู้ใช้ไม่สามารถสร้างโฟลเดอร์ข้อมูลใหม่ได้ หากตั้งค่าเป็นไม่จำกัด จะถูกแสดงเป็น "∞"

source: Max Session Count Per Model Session: The maximum number of available sessions per model service created by a user. Increasing this value can put a heavy load on the session scheduler and potentially lead to system downtime, so please caution when adjusting this setting.
ja: モデルセッションあたりの最大セッション数: ユーザーによって作成されたモデルサービスごとの利用可能なセッションの最大数。この値を増やすとセッションスケジューラに大きな負荷がかかり、システムダウンにつながる可能性があるので、この設定を調整する際は注意してください。
ko: Max Session Count Per Model Session: 각 사용자가 생성한 모델 서비스 당 사용 가능한 세션의 최대 수. 해당 값을 증가시키면 세션 스케줄러에 부하가 가해질 수 있고, 잠재적인 시스템 다운타임으로 이어질 수 있습니다. 따라서, 이 설정을 조정할 때는 주의가 필요합니다.
th: จำนวนเซสชันสูงสุดต่อเซสชันของโมเดล: จำนวนเซสชันสูงสุดที่มีอยู่ต่อบริการโมเดลที่สร้างโดยผู้ใช้ การเพิ่มค่าตรงนี้อาจทำให้เกิดการโหลดที่หนักบนตัวจัดการเซสชันและอาจทำให้ระบบหยุดทำงานได้ ดังนั้นโปรดใช้ความระมัดระวังเมื่อปรับตั้งค่านี้

source: Max Customized Image Count: The maximum number of customized images that user can create. If user's customized image count exceeds this value, user cannot create a new customized image. If you want to know more about customized images, please refer to the :ref:`My Environments<my-environments>` section.
ja: 最大カスタマイズイメージ数: ユーザーが作成できるカスタマイズイメージの最大数です。ユーザーのカスタマイズイメージ数がこの値を超えると、新しいカスタマイズイメージを作成できません。カスタマイズイメージについて詳しく知りたい場合は、:ref:`My Environments<my-environments>` セクションを参照してください。
ko: Max Customized Image Count: 사용자가 생성할 수 있는 최대 사용자 정의 이미지 개수. 사용자의 사용자 정의 이미지 수가 이 값을 초과하면, 사용자는 새로운 사용자 정의 이미지를 만들 수 없음. 사용자 정의 이미지에 대해 더 알고 싶다면, :ref:`나의 실행 환경<my-environments>` 섹션을 참조 할 수 있음.
th: จำนวนภาพที่ปรับแต่งได้สูงสุด: จำนวนภาพที่ปรับแต่งได้สูงสุดที่ผู้ใช้สามารถสร้างได้ หากจำนวนภาพที่ปรับแต่งได้ของผู้ใช้เกินค่าดังกล่าว ผู้ใช้จะไม่สามารถสร้างภาพที่ปรับแต่งใหม่ได้ หากคุณต้องการทราบข้อมูลเพิ่มเติมเกี่ยวกับภาพที่ปรับแต่งได้ โปรดดูที่ :ref:`My Environments<my-environments>`

source: ID: The ID of the user resource policy.
ja: ID：ユーザーリソースポリシーのID。
ko: ID: 사용자 자원 정책의 ID.
th: ID: รหัสของนโยบายทรัพยากรผู้ใช้

source: Created At: The date and time when the user resource policy was created.
ja: 作成日: ユーザーリソースポリシーが作成された日時。
ko: Created At: 사용자 자원 정책이 생성된 날짜와 시간.
th: สร้างเมื่อ: วันที่และเวลาที่นโยบายทรัพยากรของผู้ใช้ถูกสร้างขึ้น

source: To update, click the 'Setting (Gear)' button in the control column. To delete, click the trash can button.
ja: 更新するには、コントロール列の「設定（ギア）」ボタンをクリックします。削除するには、ゴミ箱ボタンをクリックします。
ko: Control 열의 '설정' 버튼을 클릭합니다. 삭제하려면 '휴지통' 버튼을 클릭하세요.
th: ในการอัปเดต ให้คลิกที่ปุ่ม 'การตั้งค่า (เฟือง)' ในคอลัมน์การควบคุม สำหรับการลบ ให้คลิกที่ปุ่มถังขยะ
