Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/admin_menu/admin_menu.po
Languages: ja, ko, th

source: Changing a resource policy may affect all users who use that policy, so use it with caution.
ja: リソースポリシーを変更すると、そのポリシーを使用しているすべてのユーザーに影響を及ぼす可能性があるため、注意して使用してください。
ko: 자원 정책을 변경하면 해당 사용자 자원 정책을 사용하는 모든 사용자에게 영향을 줄 수 있습니다. 자원 정책을 변경할 때는 사용자의 주의가 필요합니다.
th: การเปลี่ยนแปลงนโยบายทรัพยากรอาจส่งผลกระทบต่อผู้ใช้ทั้งหมดที่ใช้ในนโยบายดังกล่าว ดังนั้นควรใช้ด้วยความระมัดระวัง。

source: Similar to keypair resource policy, users can select and display only columns users want by clicking the 'Setting (Gear)' button at the bottom right of the table.
ja: キーペアリソースポリシーと同様に、ユーザーはテーブルの右下にある「設定（ギア）」ボタンをクリックすることで、必要な列だけを選択して表示できます。
ko: 키페어 자원 정책과 마찬가지로, 원하는 열만 선택하여 표시하려면 테이블 오른쪽 하단의 '설정' 버튼을 클릭하세요.
th: คล้ายกับนโยบายทรัพยากร keypair ผู้ใช้สามารถเลือกและแสดงเฉพาะคอลัมน์ที่ต้องการได้โดยคลิกที่ปุ่ม 'ตั้งค่า (เกียร์)' ที่มุมขวาล่างของตาราง

source: Project Resource Policy
ja: プロジェクトリソースポリシー
ko: 프로젝트 자원 정책
th: นโยบายทรัพยากรโปรเจกต์

source: Starting from version 24.03, Backend.AI supports project resource policy management. Project resource policies manage storage space (quota) and folder-related limitations for projects.
ja: バージョン24.03から、Backend.AIはプロジェクトリソースポリシー管理をサポートしています。プロジェクトリソースポリシーは、プロジェクトのストレージスペース（クォータ）およびフォルダ関連の制限を管理します。
ko: 24.03 버전부터 Backend.AI는 프로젝트 자원 정책 관리를 지원합니다. 프로젝트 자원 정책은 프로젝트의 저장 공간(할당량) 및 폴더 관련 제한 사항을 관리합니다.
th: เริ่มตั้งแต่เวอร์ชัน 24.03, Backend.AI รองรับการจัดการนโยบายทรัพยากรโครงการ นโยบายทรัพยากรโครงการจัดการพื้นที่จัดเก็บ (โควตา) และข้อจำกัดที่เกี่ยวข้องกับโฟลเดอร์สำหรับโครงการต่างๆ

source: When clicking the Project tab of the Resource Policy page, you can see the list of project resource policy.
ja: リソースポリシーページのプロジェクトタブをクリックすると、プロジェクトリソースポリシーのリストを確認できます。
ko: Resource Policy 페이지의 'Project' 탭을 클릭하면 프로젝트 자원 정책 목록을 볼 수 있습니다.
th: เมื่อคลิกที่แท็บโครงการของหน้า นโยบายทรัพยากร คุณจะเห็นรายการนโยบายทรัพยากรของโครงการ。

source: Project resource policy list
ja: プロジェクトリソースポリシー一覧
ko: 프로젝트 자원 정책 수정 다이얼로그
th: รายการนโยบายทรัพยากรของโครงการ

source: To create a new project resource policy, click the 'Create' button at the top right of the table.
ja: 新しいプロジェクトリソースポリシーを作成するには、テーブルの右上にある「作成」ボタンをクリックします。
ko: 테이블 오른쪽 위에 있는 'Create' 버튼을 클릭하여 새로운 프로젝트 자원 정책을 생성할 수 있습니다.
th: ในการสร้างนโยบายทรัพยากรโปรเจกต์ใหม่ ให้คลิกที่ปุ่ม 'สร้าง' ที่มุมขวาบนของตาราง

source: Create project resource policy dialog
ja: プロジェクトリソースポリシーダイアログを作成
ko: 프로젝트 자원 정책 수정 다이얼로그
th: สร้างกล่องสนทนานโยบายทรัพยากรโครงการ

source: Name: The name of the project resource policy.
ja: 名前: プロジェクトリソースポリシーの名前。
ko: Name: 프로젝트 자원 정책의 이름입니다.
th: ชื่อ: ชื่อของนโยบายทรัพยากรโครงการ。

source: Max Folder Count: The maximum number of project folders that an administrator can create. If the project folder count exceeds this value, the administrator will not be able to create a new project folder. If set to Unlimited, it will be displayed as "∞".
ja: Max Folder Count: 管理者が作成できるプロジェクトフォルダーの最大数。この値を超えると、管理者は新しいプロジェクトフォルダーを作成できなくなります。「Unlimited」に設定されている場合、「∞」として表示されます。
ko: Max Folder Count: 관리자가 생성할 수 있는 프로젝트 폴더의 최대 개수. 프로젝트 폴더 수가 해당 값을 초과하면 관리자가 새 프로젝트 폴더를 생성할 수 없게 되며, 무제한으로 설정된 경우에는 “∞“로 표시됨.
th: จำนวนโฟลเดอร์สูงสุด: จำนวนโฟลเดอร์โปรเจ็กต์สูงสุดที่ผู้ดูแลระบบสามารถสร้างได้ หากจำนวนโฟลเดอร์โปรเจ็กต์เกินค่านี้ ผู้ดูแลระบบจะไม่สามารถสร้างโฟลเดอร์โปรเจ็กต์ใหม่ได้ หากตั้งค่าเป็นไม่จำกัด จะปรากฏเป็น "∞"

source: Max Folder Size: The maximum size of the project's storage space. If the project's storage space exceeds this value, the administrator cannot create a new project folder. If set to Unlimited, it is displayed as "∞".
ja: 最大フォルダーサイズ: プロジェクトのストレージスペースの最大サイズ。この値を超えると、管理者は新しいプロジェクトフォルダーを作成できません。無制限に設定されている場合は、「∞」と表示されます。
ko: Max Folder Size: 프로젝트의 저장 공간의 최대 크기. 프로젝트의 저장 공간이 이 값을 초과하면 관리자가 새 프로젝트 폴더를 생성할 수 없게 되며, 무제한으로 설정된 경우에는 “∞“로 표시됨.
th: ขนาดโฟลเดอร์สูงสุด: ขนาดสูงสุดของพื้นที่จัดเก็บของโปรเจกต์ หากพื้นที่จัดเก็บของโปรเจกต์เกินค่านี้ ผู้ดูแลระบบไม่สามารถสร้างโฟลเดอร์โปรเจกต์ใหม่ได้ หากตั้งค่าเป็นไม่ จำกัด จะปรากฏเป็น "∞"

source: The meaning of each field is similar to the user resource policy. The difference is that the project resource policy is applied to the project folders, while the user resource policy is applied to the user folders.
ja: 各フィールドの意味はユーザーリソースポリシーと類似しています。違いは、プロジェクトリソースポリシーがプロジェクトフォルダに適用されるのに対し、ユーザーリソースポリシーはユーザーフォルダに適用される点です。
ko: 각 필드의 의미는 사용자 자원 정책과 유사합니다. 차이점은 프로젝트 자원 정책이 프로젝트 폴더에 적용되는 반면 사용자 자원 정책은 사용자 폴더에 적용된다는 것입니다.
th: ความหมายของแต่ละฟิลด์มีความคล้ายคลึงกับนโยบายทรัพยากรของผู้ใช้ ความแตกต่างคือ นโยบายทรัพยากรของโครงการจะถูกนำไปใช้กับโฟลเดอร์ของโครงการ ในขณะที่นโยบายทรัพยากรของผู้ใช้จะถูกนำไปใช้กับโฟลเดอร์ของผู้ใช้

source: If you want to make changes, click the 'Setting (Gear)' button in the control column. Resource policy names cannot be edited. Deletion can be done by clicking the trash can icon button.
ja: 変更を加えたい場合は、コントロール列の「設定（ギア）」ボタンをクリックします。リソースポリシー名は編集できません。削除はゴミ箱アイコンボタンをクリックすることで行えます。
ko: 변경을 원하면 제어 열의 '설정' 버튼을 클릭하세요. 자원 정책 이름은 편집할 수 없습니다. 삭제는 '휴지통' 버튼을 클릭하여 수행할 수 있습니다.
th: หากคุณต้องการทำการเปลี่ยนแปลง ให้คลิกที่ปุ่ม 'การตั้งค่า (เกียร์)' ในคอลัมน์ควบคุม ชื่อของนโยบายทรัพยากรไม่สามารถแก้ไขได้ การลบสามารถทำได้โดยการคลิกที่ปุ่มไอคอนถังขยะ

source: You can select and display only the columns you want by clicking the 'Setting (Gear)' button at the bottom right of the table.
ja: テーブルの右下にある「設定（ギア）」ボタンをクリックすると、表示したい列を選択して表示できます。
ko: 원하는 열만 선택하여 표시하려면 테이블 오른쪽 하단의 '설정' 버튼을 클릭하세요.
th: คุณสามารถเลือกและแสดงเฉพาะคอลัมน์ที่คุณต้องการโดยคลิกที่ปุ่ม 'การตั้งค่า (เกียร์)' ที่มุมขวาล่างของตาราง

source: Exporting current resource policy as CSV
ja: 現在のリソースポリシーをCSVとしてエクスポート
th: การส่งออกนโยบายทรัพยากรปัจจุบันเป็น CSV

source: To save the current resource policy as a file, click on the 'Tools' menu located at the top left of each tab. Once you click the menu, download dialog will appear.
ja: 現在のリソースポリシーをファイルとして保存するには、各タブの左上にある「ツール」メニューをクリックします。メニューをクリックすると、ダウンロードダイアログが表示されます。
th: เพื่อบันทึกนโยบายทรัพยากรปัจจุบันเป็นไฟล์ ให้คลิกที่เมนู 'เครื่องมือ' ที่ตั้งอยู่มุมซ้ายบนของแต่ละแท็บ เมื่อตคลิกเมนูแล้ว จะมีหน้าต่างดาวน์โหลดปรากฏขึ้น

source: Keypair export
ja: キーペアのエクスポート
th: การส่งออกคีย์คู่

source: Manage Images
ja: イメージを管理
ko: 이미지 관리
th: จัดการภาพ

source: Admins can manage images, which are used in creating a compute session, in the Images tab of the Environments page. In the tab, meta information of all images currently in the Backend.AI server is displayed. You can check information such as registry, namespace, image name, image's based OS, digest, and minimum resources required for each image. For images downloaded to one or more agent nodes, there will be a ``installed`` tag in each Status column.
ja: 管理者は、環境ページの「Images」タブで計算セッションの作成に使用されるイメージを管理できます。このタブでは、現在Backend.AIサーバーにあるすべてのイメージのメタ情報が表示されます。レジストリ、ネームスペース、イメージ名、イメージのベースOS、ダイジェスト、および各イメージに必要な最小リソースなどの情報を確認できます。1つ以上のエージェントノードにダウンロードされたイメージの場合、各ステータス列に「installed」タグが表示されます。
ko: 세션 생성 시 사용할 이미지 관리는 Environments 페이지의 Images 탭에서 할 수 있습니다. 탭에 들어가면 현재 Backend.AI 서버에서 가지고 있는 모든 이미지의 메타 정보가 출력됩니다. 이미지 별로 속한 레지스트리, 네임스페이스, 이미지 이름, 이미지의 기반 OS, Digest, 요구되는 최소 자원 등의 정보를 확인할 수 있습니다. 관리되고 있는 agent 노드 중 하나 이상에 다운로드 되어 있는 이미지의 경우 ``installed`` 태그가 각 이미지의 Status 컬럼에 표시됩니다.
th: ผู้ดูแลระบบสามารถจัดการภาพที่ใช้ในการสร้างเซสชันการคอมพิวเตอร์ได้ในแท็บภาพของหน้า Environments ในแท็บนี้ ข้อมูลเมตาของภาพทั้งหมดที่มีอยู่ในเซิร์ฟเวอร์ Backend.AI จะแสดงอยู่ คุณสามารถตรวจสอบข้อมูลเช่น registry, namespace, ชื่อภาพ, ระบบปฏิบัติการที่ใช้เป็นฐานของภาพ, digest และทรัพยากรขั้นต่ำที่ต้องการสำหรับแต่ละภาพ สำหรับภาพที่ดาวน์โหลดไปยังโหนดตัวแทนหนึ่งหรือมากกว่านั้น จะมีแท็ก ``installed`` ในแต่ละคอลัมน์สถานะ

source: The feature to install images by selecting specific agents is currently under development.
ja: 特定のエージェントを選択してイメージをインストールする機能は現在開発中です。
ko: 특정 agent를 선택하여 이미지를 설치하는 기능은 현재 개발 중에 있습니다.
th: ฟีเจอร์การติดตั้งภาพโดยการเลือกตัวแทนเฉพาะกำลังอยู่ในระหว่างการพัฒนา

source: Image list page
ja: イメージリストページ
th: หน้ารายการภาพ

source: You can change the minimum resource requirements for each image by clicking the 'Setting (Gear)' in the Controls panel. Each image has hardware and resource requirements for minimal operation. (For example, for GPU-only images, there must be a minimum allocated GPU.) The default value for the minimum resource amount is provided as embedded in the image's metadata. If an attempt is made to create a compute session with a resource that is less than the amount of resources specified in each image, the request is automatically adjusted to the minimum resource requirements for the image and then generated, not cancelled.
ja: 「コントロールパネル」で「設定（歯車）」をクリックすることで、各イメージの最小リソース要件を変更できます。各イメージには最小限の操作のためのハードウェアおよびリソース要件があります。（例えば、GPUのみのイメージの場合、最小限割り当てられたGPUが必要です。）最小リソース量のデフォルト値は、イメージのメタデータに埋め込まれています。もし各イメージで指定されたリソースよりも少ないリソースでコンピュートセッションの作成が試みられた場合、リクエストは自動的にそのイメージの最小リソース要件に調整され、生成され、中止されることはありません。
th: คุณสามารถเปลี่ยนข้อกำหนดทรัพยากรขั้นต่ำสำหรับแต่ละภาพได้โดยการคลิ๊กที่ 'การตั้งค่า (เกียร์)' ในแผงควบคุม แต่ละภาพมีข้อกำหนดด้านฮาร์ดแวร์และทรัพยากรสำหรับการทำงานขั้นต่ำ (ตัวอย่างเช่น สำหรับภาพที่ใช้ GPU เท่านั้น จะต้องมีการจัดสรร GPU ขั้นต่ำ) ค่าปริยายสำหรับจำนวนทรัพยากรขั้นต่ำจะถูกกำหนดไว้ในข้อมูลเมตาดาต้าที่ฝังอยู่ในภาพ หากมีความพยายามในการสร้างเซสชันการคอมพิวเตอร์ด้วยทรัพยากรที่น้อยกว่าจำนวนทรัพยากรที่ระบุในแต่ละภาพ คำขอจะถูกปรับอัตโนมัติเพื่อให้ตรงกับข้อกำหนดทรัพยากรขั้นต่ำสำหรับภาพและจากนั้นจะถูกสร้าง ไม่ถูกยกเลิก

source: Don't change the minimum resource requirements to an amount less than the predefined value! The minimum resource requirements included in the image metadata are values that have been tested and determined. If you are not really sure about the minimum amount of resources you want to change, leave it in the default.
ja: 最小リソース要件を事前定義された値よりも少なくしないでください！イメージメタデータに含まれる最小リソース要件は、テストされ決定された値です。変更したい最小リソース量について確信がない場合は、デフォルトのままにしておいてください。
ko: 미리 지정된 값보다 작은 양으로 최소 자원 요구량을 변경하지 마세요! 이미지 메타데이터에 포함된 최소 자원 요구량은 테스트를 거쳐 결정된 값입니다. 변경하려는 최소 자원량에 대하여 정말 잘 알고 있지 않은 경우 기본값으로 남겨두시기 바랍니다.
th: อย่าเปลี่ยนข้อกำหนดทรัพยากรขั้นต่ำเป็นจำนวนที่น้อยกว่าค่าที่กำหนดไว้! ข้อกำหนดทรัพยากรขั้นต่ำที่รวมอยู่ในข้อมูลเมทาดาตาของรูปภาพเป็นค่าที่ได้ผ่านการทดสอบและกำหนดแล้ว หากคุณไม่แน่ใจเกี่ยวกับจำนวนทรัพยากรขั้นต่ำที่คุณต้องการเปลี่ยน แนะนำให้ปล่อยไว้เป็นค่าดีฟอลต์

source: Update image resource setting
ja: イメージリソース設定を更新する
ko: 이미지 자원 설정 업데이트
th: อัปเดตการตั้งค่าทรัพยากรภาพ

source: Additionally, you can add or modify the supported apps for each image by clicking the 'Apps' icon located in the Controls column. Once you click the icon, the name of the app and its corresponding port number will be displayed accordingly.
ja: さらに、コントロール欄にある「Apps」アイコンをクリックすることで、各イメージに対応するアプリを追加または変更することができます。アイコンをクリックすると、アプリの名前とそれに対応するポート番号が表示されます。
th: นอกจากนี้ คุณสามารถเพิ่มหรือแก้ไขแอพที่รองรับสำหรับแต่ละภาพได้โดยการคลิกที่ไอคอน 'แอพ' ที่ตั้งอยู่ในคอลัมน์การควบคุม เมื่อคุณคลิกที่ไอคอน ชื่อแอพและหมายเลขพอร์ตที่ สอดคล้องจะปรากฏตามลำดับ

source: Manage app dialog
ja: アプリ管理ダイアログ
th: การจัดการหน้าต่างแอป

source: In this interface, you can add supported custom applications by clicking the 'Add' button below. To delete an application, simply click the 'red trash can' button on the right side of each row.
ja: このインターフェースでは、下の「追加」ボタンをクリックしてサポートされているカスタムアプリケーションを追加できます。アプリケーションを削除するには、各行の右側にある「赤いゴミ箱」ボタンをクリックするだけです。
th: ในอินเทอร์เฟซนี้ คุณสามารถเพิ่มแอปพลิเคชันที่กำหนดเองที่รองรับได้โดยการคลิกปุ่ม 'เพิ่ม' ด้านล่าง เพื่อ ลบแอปพลิเคชัน เพียงคลิกปุ่ม 'ถังขยะสีแดง' ที่ด้านขวาของแต่ละแถว

source: You need to reinstall the image after changing the managed app.
ja: 管理されたアプリを変更した後は、イメージを再インストールする必要があります。
th: คุณต้องติดตั้งภาพใหม่หลังจากเปลี่ยนแอปที่จัดการแล้ว

source: Confirmation dialog for manage app change in image
ja: 画像の管理アプリの変更に関する確認ダイアログ
th: กล่องโต้ตอบยืนยันสำหรับการเปลี่ยนแอปการจัดการในภาพ

source: Manager docker registry
ja: マネージャードッカーレジストリ
ko: 도커 레지스트리 관리
th: จัดการ docker registry

source: You can click on the Registries tab in Environments page to see the information of the docker registry that are currently connected. ``cr.backend.ai`` is registered by default, and it is a registry provided by Harbor.
ja: EnvironmentsページのRegistriesタブをクリックすると、現在接続されているDockerレジストリの情報を確認できます。``cr.backend.ai`` はデフォルトで登録されており、Harborによって提供されるレジストリです。
ko: Environments의 'Registries' 탭을 클릭하여 현재 연결되어 있는 도커 레지스트리의 정보를 확인할 수 있습니다. ``cr.backend.ai`` 는 Harbor에서 서비스 하는 레지스트리로 기본적으로 등록되어 있습니다.
th: คุณสามารถคลิกที่แท็บ Registries ในหน้า Environments เพื่อดูข้อมูลของ docker registry ที่เชื่อมต่ออยู่ในขณะนี้ ``cr.backend.ai`` ถูกลงทะเบียนเป็นค่าเริ่มต้น และเป็น registry ที่จัดเตรียมโดย Harbor.

source: In the offline environment, the default registry is not accessible, so click the trash icon on the right to delete it.
ja: オフライン環境では、デフォルトレジストリにアクセスできないため、右側のゴミ箱アイコンをクリックして削除します。
ko: 오프라인 환경일 경우 기본 도커 레지스트리에 접근이 불가능하므로, 우측 '휴지통' 버튼을 클릭하여 삭제하면 됩니다.
th: ในสภาพแวดล้อมออฟไลน์ ไม่สามารถเข้าถึงรีจิสทรีเริ่มต้นได้ ดังนั้นให้คลิกที่ไอคอนถังขยะด้านขวาเพื่อลบมันออก

source: Click the refresh icon in Controls to update image metadata for Backend.AI from the connected registry. Image information which does not have labels for Backend.AI among the images stored in the registry is not updated.
ja: 接続されたレジストリからBackend.AIの画像メタデータを更新するには、Controlsにある更新アイコンをクリックします。レジストリに保存されている画像のうち、Backend.AI用のラベルがない画像情報は更新されません。
ko: Controls에 있는 리프레시 아이콘을 클릭하여 해당 레지스트리에 저장된 Backend.AI 용 이미지 정보를 Backend.AI에 받아올 수 있습니다. 레지스트리에 저장된 이미지 중 Backend.AI 용으로 레이블 되지 않은 이미지 정보는 따로 받아오지 않습니다.
th: คลิกที่ไอคอนรีเฟรชในส่วนควบคุมเพื่ออัปเดตข้อมูลเมตาดาต้าของรูปภาพสำหรับ Backend.AI จากทะเบียนที่เชื่อมต่อ ข้อมูลรูปภาพที่ไม่มีป้ายกำกับสำหรับ Backend.AI ในรูปภาพที่เก็บไว้ในทะเบียนจะไม่ได้รับการอัปเดต

source: Registries page
ja: レジストリーページ
th: หน้าทะเบียน

source: You can add your own private docker registry by clicking the ADD REGISTRY button. Note that Registry Hostname and Registry URL address must be set identically, and in the case of Registry URL, a scheme such as ``http://`` or ``https://`` must be explicitly attached. Also, images stored in the registry must have a name prefixed with Registry Hostname. Username and Password are optional and can be filled in if you set separate authentication settings in the registry.
ja: 「ADD REGISTRY」ボタンをクリックして自身のプライベートDockerレジストリを追加できます。Registry HostnameとRegistry URLアドレスは同一に設定する必要があり、Registry URLの場合は「http://」や「https://」などのスキームを明示的に付ける必要があります。また、レジストリに保存されているイメージはRegistry Hostnameで始まる名前を持つ必要があります。UsernameとPasswordは任意で、レジストリに別途認証設定を行っている場合に入力できます。
ko: ADD REGISTRY 버튼을 클릭하여 운영하고 있는 사설 도커 레지스트리를 추가할 수 있습니다. 이 때, Registry Hostname과 Registry URL 주소는 동일하게 설정하여야 하고, Registry URL의 경우 ``http://`` 또는 ``https://`` 와 같은 scheme을 명시적으로 붙여 주어야 합니다. 또한, 해당 레지스트리에 저장되는 이미지는 반드시 Registry Hostname을 접두어로 한 이름을 가져야 합니다. Username과 Password는 선택 사항으로, 레지스트리에서 별도 인증 설정을 한 경우에는 채워주시면 됩니다.
th: คุณสามารถเพิ่ม Docker registry ส่วนตัวของคุณโดยการคลิกที่ปุ่ม ADD REGISTRY โปรดทราบว่า Registry Hostname และ Registry URL ต้องตั้งค่าให้เหมือนกัน และในกรณีของ Registry URL จำเป็นต้องแนบสโคมเช่น ``http://`` หรือ ``https://`` อย่างชัดเจน นอกจากนี้ รูปภาพที่จัดเก็บใน registry ต้องมีชื่อขึ้นต้นด้วย Registry Hostname ชื่อผู้ใช้และรหัสผ่านเป็นตัวเลือกและสามารถกรอกได้หากคุณตั้งค่าการรับรองความถูกต้องแยกต่างหากใน registry

source: Add registry dialog
ja: レジストリ追加ダイアログ
th: เพิ่มกล่องโต้ตอบการลงทะเบียน

source: You can also update the information of an existing registry, except the hostname.
ja: 既存のレジストリの情報も更新できますが、ホスト名は除きます。
ko: Registry Hostname을 제외하고 이미 존재하는 레지스트리 정보를 수정할 수 있습니다.
th: คุณยังสามารถอัปเดตข้อมูลของรีจิสทรีที่มีอยู่ ยกเว้นชื่อโฮสต์

source: Even if you created a registry and update meta information, users cannot use the images in the registry, immediately. Just as you had to register the allowed hosts to use the storage host, you must register the registry in the allowed docker registries field at the domain or project level, after registering the registry, so that users in the domain or project can access the registry image. Allowed docker registries can be registered using the Control-Panel with domain and project management. The function to set the allowed docker registries in the keypair's resource policy is not provided yet.
ja: レジストリを作成してメタ情報を更新しても、ユーザーはすぐにはレジストリ内のイメージを使用することはできません。ストレージホストを使用するために許可されたホストを登録しなければならないのと同様に、レジストリを登録した後に、ドメインまたはプロジェクトレベルで許可されたDockerレジストリフィールドにレジストリを登録して、ドメインまたはプロジェクトのユーザーがレジストリイメージにアクセスできるようにする必要があります。許可されたDockerレジストリは、ドメインとプロジェクト管理を使ってコントロールパネルから登録できます。キーのリソースポリシーで許可されたDockerレジストリを設定する機能はまだ提供されていません。
ko: 레지스트리를 생성하고 메타 정보를 업데이트 했다고 하더라도 사용자가 바로 해당 레지스트리에 있는 이미지를 사용할 수는 없습니다. Storage 폴더 사용을 위해 allowed hosts를 등록해야 했던 것처럼, 레지스트리 등록 후 도메인 또는 프로젝트 수준에서 allowed docker registries 필드에 해당 레지스트리를 등록해야 도메인 또는 프로젝트 소속 사용자가 레지스트리 이미지에 접근할 수 있습니다. Allowed docker registries 등록은 도메인과 프로젝트 관리 기능이 있는 Control-Panel을 이용해서 할 수 있습니다. 키페어의 자원 정책에서 allowed docker registries를 설정하는 기능은 아직 제공하지 않고 있습니다.
th: แม้ว่าคุณจะสร้างรีจิสทรีและอัปเดตข้อมูลเมตาแล้ว ผู้ใช้ก็ยังไม่สามารถใช้ภาพในรีจิสทรีได้ทันที เช่นเดียวกับที่คุณต้องลงทะเบียนโฮสต์ที่อนุญาตเพื่อใช้โฮสต์ที่เก็บข้อมูล คุณต้องลงทะเบียนรีจิสทรีในฟิลด์รีจิสทรี Docker ที่อนุญาตในระดับโดเมนหรือโครงการ หลังจากลงทะเบียนรีจิสทรีแล้ว เพื่อให้ผู้ใช้ในโดเมนหรือโครงการสามารถเข้าถึงภาพในรีจิสทรีได้ รีจิสทรี Docker ที่อนุญาตสามารถลงทะเบียนได้โดยใช้แผงควบคุมพร้อมการจัดการโดเมนและโครงการ ฟังก์ชันในการตั้งค่ารีจิสทรี Docker ที่อนุญาตในนโยบายทรัพยากรของคู่คีย์ยังไม่ได้รับการจัดเตรียมไว้ในขณะนี้

source: Manage resource preset
ja: リソースプリセットを管理
ko: 자원 프리셋 설정
th: จัดการการตั้งค่าทรัพยากร

source: The following predefined resource presets are displayed in the Resource allocation panel when creating a compute session. Superadmin can manage these resource presets.
ja: コンピュートセッションを作成する際、リソース割り当てパネルに次の事前定義されたリソースプリセットが表示されます。スーパ管理者はこれらのリソースプリセットを管理できます。
ko: 연산 세션을 생성할 때 Resource allocation 패널에서 다음과 같은 사전 정의된 자원 프리셋이 출력 됩니다. Super admin에게는 이 자원 프리셋을 설정할 수 있는 기능을 제공합니다.
th: การตั้งค่าทรัพยากรที่กำหนดไว้ล่วงหน้าดังต่อไปนี้จะแสดงในแผงการจัดสรรทรัพยากรเมื่อสร้างเซสชันการประมวลผล Superadmin สามารถจัดการการตั้งค่าทรัพยากรเหล่านี้ได้

source: Resource presets in compute session launch dialog
ja: 計算セッション起動ダイアログのリソースプリセット
th: การตั้งค่าทรัพยากรในกล่องโต้ตอบการเปิดเซสชันการคำนวณ

source: Go to the Resource Presets tab on the Environment page. You can check the list of currently defined resource presets.
ja: 環境ページのリソースプリセットタブに移動します。現在定義されているリソースプリセットのリストを確認できます。
ko: Environment 페이지의 Resource Presets 탭으로 이동합니다. 현재 정의되어 있는 자원 프리셋의 리스트를 확인할 수 있습니다.
th: ไปที่แท็บ Resource Presets ในหน้าสิ่งแวดล้อม คุณสามารถตรวจสอบรายชื่อการตั้งค่าทรัพยากรที่กำหนดไว้ในปัจจุบันได้

source: Resource presets tab
ja: リソースプリセットタブ
ko: 자원 프리셋 탭
th: แท็บการตั้งค่าพื้นฐานของทรัพยากร

source: You can set resources such as CPU, RAM, fGPU, etc. to be provided by the resource preset by clicking the 'Setting (Gear)' (cogwheel) in the Controls panel. In the example below, the GPU field is disabled since the GPU provision mode of the Backend.AI server is set to "fractional". After setting the resources with the desired values, save it and check if the corresponding preset is displayed when creating a compute session. If available resources are less than the amount of resources defined in the preset, the corresponding preset would not be shown.
ja: リソースプリセットによって提供されるCPU、RAM、fGPUなどのリソースを設定するには、コントロールパネルの「設定（ギア）」(歯車)をクリックします。以下の例では、Backend.AIサーバーのGPUプロビジョンモードが「fractional」に設定されているため、GPUフィールドが無効になっています。希望する値でリソースを設定した後、それを保存し、コンピュートセッションを作成する際に対応するプリセットが表示されるか確認します。利用可能なリソースがプリセットで定義されたリソース量より少ない場合、対応するプリセットは表示されません。
ko: Controls 열의 '설정' 버튼을 클릭하여 자원 프리셋이 제공할 CPU, RAM, fGPU 등의 자원을 설정할 수 있습니다. 아래 예제의 경우 Backend.AI 서버의 GPU 제공 모드가 shares이므로 GPU 필드는 비활성화 되어 있습니다. 원하는 값으로 자원을 설정한 후 저장하고 연산 세션 생성 시 해당 프리셋이 출력되는지 확인해 봅니다. 프리셋에 정의된 자원량보다 적은 자원만 할당 가능한 경우에는 해당 프리셋이 출력되지 않습니다.
th: คุณสามารถตั้งค่าทรัพยากรเช่น CPU, RAM, fGPU, ฯลฯ ที่จะจัดเตรียมโดยการตั้งค่าล่วงหน้าทรัพยากรโดยการคลิกที่ 'การตั้งค่า (ฟันเฟือง)' (cogwheel) ในแผงควบคุม ในตัวอย่างด้านล่าง ฟิลด์ GPU จะถูกปิดใช้งานเนื่องจากโหมดการจัดเตรียม GPU ของเซิร์ฟเวอร์ Backend.AI ถูกตั้งค่าเป็น "fractional" หลังจากตั้งค่าทรัพยากรด้วยค่าที่ต้องการแล้ว ให้บันทึกและตรวจสอบว่าการตั้งค่าล่วงหน้าที่สอดคล้องกันแสดงเมื่อสร้างเซสชันการประมวลผลหรือไม่ หากทรัพยากรที่พร้อมใช้งานมีน้อยกว่าจำนวนทรัพยากรที่กำหนดในตั้งค่าล่วงหน้า การตั้งค่าล่วงหน้าที่สอดคล้องกันจะไม่แสดง

source: Modify resource preset dialog
ja: リソースプリセットダイアログを変更
ko: 자원 프리셋 수정 다이얼로그
th: แก้ไขกล่องโต้ตอบการตั้งค่ารีซอร์ส

source: Also you can create resource preset by Clicking CREATE PRESETS button in the right top of the Resource Presets tab. You cannot create the same resource preset name that already exists, since it is the key value for distinguishing each resource preset.
ja: また、リソースプリセットタブの右上にある「CREATE PRESETS」ボタンをクリックすることで、リソースプリセットを作成できます。既に存在するリソースプリセット名と同じ名前を作成することはできません。これは各リソースプリセットを区別するためのキー値だからです。
ko: 또한 Resource Presets 탭의 우측 상단의 CREATE PRESETS 버튼을 클릭하여 자원 프리셋을 생성 할 수도 있습니다. 이미 존재하는 자원 프리셋 이름으로는 생성이 불가능한데, 이는 프리셋 이름이 각 자원 프리셋을 구분하는 키 값이기 때문입니다.
th: คุณยังสามารถสร้างการตั้งค่าทรัพยากรโดยคลิกปุ่ม CREATE PRESETS ที่มุมขวาบนของแท็บ Resource Presets คุณไม่สามารถสร้างชื่อการตั้งค่าทรัพยากรเดียวกันที่มีอยู่แล้ว เนื่องจากมันเป็นคีย์ค่าที่ใช้ในการแยกความแตกต่างระหว่างการตั้งค่าทรัพยากรแต่ละรายการ

source: Create resource preset dialog
ja: リソースプリセット作成ダイアログ
ko: 자원 프리셋 생성 다이얼로그
th: สร้างกล่องสนทนาPreset ทรัพยากร

source: Manage agent nodes
ja: エージェントノードを管理
ko: Agent 노드 관리
th: จัดการโหนดตัวแทน

source: Superadmins can view the list of agent worker nodes, currently connected to Backend.AI, by visiting the Resources page. You can check agent node's IP, connecting time, actual resources currently in use, etc. The Web-UI does not provide the function to manipulate agent nodes.
ja: スーパー管理者は、Resourcesページにアクセスすることで、Backend.AIに現在接続されているエージェントワーカーノードのリストを確認できます。エージェントノードのIP、接続時間、現在使用中の実際のリソースなどを確認できます。Web-UIにはエージェントノードを操作する機能は提供されていません。
ko: Superadmin의 경우 Resources 페이지의 Connected 탭에서는 현재 Backend.AI에 연결된 agent 워커 노드를 조회할 수 있습니다. 노드의 IP와 연결된 시간, 현재 사용중인 실제 자원 등을 조회할 수 있습니다. Web-UI 앱에서는 별도로 agent 노드를 조작하는 기능은 제공하지 않습니다.
th: ซูเปอร์แอดมินสามารถดูรายชื่อโหนดตัวแทนที่เชื่อมต่อกับ Backend.AI ได้โดยไปที่หน้าทรัพยากร คุณสามารถตรวจสอบ IP ของโหนดตัวแทน เวลาการเชื่อมต่อ ทรัพยากรที่ใช้งานจริงในขณะนี้ ฯลฯ เว็บ UI ไม่ได้ให้ฟังก์ชันในการจัดการโหนดตัวแทน

source: Query agent nodes
ja: エージェントノードを照会
ko: Agent 노드 조회
th: การสอบถามโหนดตัวแทน

source: Agent node list
ja: エージェントノードリスト
ko: Agent 노드 목록
th: รายการโหนดเอเจนต์

source: Also You can see exact usage about the resources in the agent worker node by Click note icon in the Control panel.
ja: また、コントロールパネルのノートアイコンをクリックすることで、エージェントワーカーノード内のリソースに関する正確な使用量を確認できます。
ko: 또한 agent 워커 노드의 자원에 대한 정확한 사용량을 Control 패널의 노트 아이콘을 클릭하여확인할 수 있습니다.
th: คุณยังสามารถดูการใช้งานที่แน่นอนเกี่ยวกับทรัพยากรในโหนดตัวแทนแรงงานได้โดยการคลิกที่ไอคอนหมายเหตุในแผงควบคุม

source: Detailed agent node usage information
ja: 詳細なエージェントノード使用情報
ko: Agent 노드 사용 상세 정보
th: ข้อมูลการใช้งานโนดเอเย่นต์อย่างละเอียด

source: On Terminated tab, you can check the information of the agents that has been connected once and then terminated or disconnected. It can be used as a reference for node management. If the list is empty, then it means that there's no disconnection or termination occurred.
ja: 終了済みタブでは、一度接続され、その後終了または切断されたエージェントの情報を確認できます。これはノード管理の参考として使用できます。リストが空の場合、それは切断または終了が発生していないことを意味します。
ko: Terminated 탭으로 이동하면 한 번 연결되었다가 종료되거나 연결이 끊긴 에이전트의 정보를 확인할 수 있습니다. 노드 관리에 참고 자료로 활용할 수 있습니다.
th: ในแท็บที่ถูกยกเลิก คุณสามารถตรวจสอบข้อมูลของเอเจนต์ที่เคยเชื่อมต่อแล้วถูกยกเลิกหรือถูกตัดการเชื่อมต่อไปแล้ว ซึ่งสามารถใช้เป็นข้อมูลอ้างอิงสำหรับการจัดการโหนด หากรายการว่างเปล่า นั่นหมายความว่าไม่มีการตัดการเชื่อมต่อหรือการยกเลิกเกิดขึ้น

source: Terminated agent node list
ja: 終了したエージェントノードのリスト
ko: 종료된 Agent 노드 목록
th: รายการโหนดเอเจนต์ที่ถูกยกเลิก

source: Set schedulable status of agent nodes
ja: エージェントノードのスケジュール可能状態を設定する
ko: Agent 노드의 스케줄링 가능 상태 설정하기
th: ตั้งสถานะที่สามารถกำหนดตารางเวลาได้ของโหนดเอเจนต์
