Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/disclaimer.po
Languages: ja, th

source: Disclaimer
ja: 免責事項
th: คำชี้แจง

source: The information and contents in this manual are provided on an "AS IS" and "AS AVAILABLE" basis for informational and reference purposes only, without warranty of any kind, either express or implied, including, but not limited to, the implied warranties of merchantability, fitness for a particular purpose, and non-infringement. Lablup Inc. is not responsible for any damages resulting from the use of this manual, including consequential damages. Although much effort has been made to ensure the accuracy of the data provided, Lablup Inc. makes no representations, promises, or warranties with respect to the completeness, accuracy, up-to-dateness or adequacy of the information, and assumes no responsibility for outdated information or errors. Lablup Inc. makes no representations or warranties, either expressed or implied, with respect to the accuracy or completeness of the information contained in this manual.
ja: このマニュアルに含まれる情報および内容は、「現状のまま」、および「利用可能な状態で」、情報提供および参考目的のために提供されており、商品性、特定目的への適合性、および非侵害性を含むがこれらに限定されない、明示または黙示のいかなる種類の保証もありません。Lablup Inc.は、このマニュアルの使用に起因するいかなる損害にも責任を負いません（結果的損害を含む）。提供されたデータの正確性を確保するために多くの努力が払われていますが、Lablup Inc.は情報の完全性、正確性、最新性または適切性に関して、一切の表明、約束または保証を行うことなく、情報の陳腐化または誤りについても責任を負いません。Lablup Inc.は、本マニュアルに含まれる情報の正確性または完全性に関して、明示または黙示のいかなる表明または保証も行いません。
th: ข้อมูลและเนื้อหาในคู่มือนี้มีให้ในลักษณะ "ตามที่เป็น" และ "ตามที่มี" เพื่อวัตถุประสงค์ในการให้ข้อมูลและอ้างอิงเท่านั้น โดยไม่มีการรับประกันใด ๆ ทั้งแบบชัดแจ้งหรือโดยนัย รวมถึง แต่ไม่จำกัดเพียง การรับประกันที่โดยนัยเกี่ยวกับการค้า ความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ และการไม่ละเมิด Lablup Inc. ไม่มีความรับผิดชอบต่อความเสียหายใด ๆ ที่เกิดจากการใช้คู่มือนี้ รวมถึงความเสียหายที่เกิดขึ้นตามมา แม้ว่าจะมีความพยายามอย่างมากเพื่อให้แน่ใจในความถูกต้องของข้อมูลที่ให้ไว้ Lablup Inc. ไม่ได้มีการแสดงถึงหรือให้สัญญาหรือการรับประกันเกี่ยวกับความสมบูรณ์ ความถูกต้อง ความทันสมัย หรือความเหมาะสมของข้อมูล และไม่รับผิดชอบต่อข้อมูลที่ล้าสมัยหรือข้อผิดพลาด Lablup Inc. ไม่มีการแสดงถึงหรือการรับประกันทั้งแบบชัดแจ้งหรือโดยนัยเกี่ยวกับความถูกต้องหรือความสมบูรณ์ของข้อมูลที่มีอยู่ในคู่มือนี้

source: Please contact us if you believe there are errors in this document that are different from the facts. We will review it as soon as possible.
ja: 事実と異なる誤りがこの文書にあると思われる場合は、お問い合わせください。できるだけ早く確認いたします。
th: หากคุณเชื่อว่ามีข้อผิดพลาดในเอกสารนี้ที่แตกต่างจากข้อเท็จจริง โปรดติดต่อเรา เราจะตรวจสอบโดยเร็วที่สุดเท่าที่จะทำได้

source: The product in this manual may subject to change without notice due to continuous development by open source community and Lablup Inc.
ja: このマニュアルに記載されている製品は、オープンソースコミュニティとLablup Inc.による継続的な開発により、予告なく変更される場合があります。
th: ผลิตภัณฑ์ในคู่มือนี้อาจมีการเปลี่ยนแปลงโดยไม่ต้องแจ้งล่วงหน้าเนื่องจากการพัฒนาต่อเนื่องโดยชุมชนโอเพ่นซอร์สและบริษัท Lablup Inc.

source: All product and company names mentioned herein may be trademarks of their respective owners.
ja: ここに記載されているすべての製品および会社名は、それぞれの所有者の商標である可能性があります。
th: ชื่อผลิตภัณฑ์และบริษัททั้งหมดที่กล่าวถึงในที่นี้อาจเป็นเครื่องหมายการค้าของเจ้าของที่เกี่ยวข้อง

source: Backend.AI is a registered trademark of Lablup Inc.
ja: Backend.AIは、Lablup Inc.の登録商標です。
th: Backend.AI เป็นเครื่องหมายการค้าจดทะเบียนของบริษัท Lablup Inc.

source: The copyright for Backend.AI™ is owned by Lablup Inc.
ja: Backend.AI™の著作権はLablup Inc.が所有しています。
th: ลิขสิทธิ์ของ Backend.AI™ เป็นของ Lablup Inc.

source: ©2015-\ |year| Lablup Inc. All rights reserved.
ja: ©2015-\ |year| Lablup Inc. 無断転載を禁じます。
th: ©2015-\ |year| Lablup Inc. สงวนลิขสิทธิ์ทุกประการ.

source: Document Version: v\ |version|.\ |version_date|
ja: ドキュメントバージョン: v\ |version|.\ |version_date|
th: เอกสารเวอร์ชัน: v\ |version|.\ |version_date|

source: Last Updated (Year/Month/Day): |date|
ja: 最終更新日 (年/月/日): |date|
th: อัปเดตล่าสุด (ปี/เดือน/วัน): |date|
