Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: ja, ko, th

source: Quickstart
ja: クイックスタート
ko: 빠른 시작
th: เริ่มต้นอย่างรวดเร็ว

source: Welcome to Quickstart guide of Backend.AI WebUI. This tutorial will cover the essentials of using Backend.AI without any knowledge base.
ja: ようこそ、Backend.AI WebUI のクイックスタートガイドへ。このチュートリアルでは、事前知識がなくても Backend.AI を使用するための基本を説明します。
ko: Backend.AI WebUI를 사용하는 빠른 시작 가이드입니다. 이 튜토리얼에서는 다른 지식기반이 없이도 Backend.AI 를 사용할 수 있도록 꼭 필요한 내용만을 다룹니다.

source: Objectives
ja: 目的
ko: 목표
th: วัตถุประสงค์

source: Part 1. Basic guide to using Backend.AI
ja: パート1. Backend.AIの基本ガイド
ko: 파트 1. Backend.AI 기초 사용 가이드

source: :ref:`How to create a virtual folder<create_storage_folder>`
ja: :ref:`仮想フォルダーの作成方法<create_storage_folder>`
ko: :ref:`가상 폴더 만드는 방법<create_storage_folder>`
th: :ref:`วิธีการสร้างโฟลเดอร์เสมือน<create_storage_folder>`

source: :ref:`How to create a session<create_session>`
ja: :ref:`セッションの作成方法<create_session>`
ko: :ref:`세션 생성하는 방법<create_session>`
th: :ref:`วิธีการสร้างเซสชัน<create_session>`

source: :ref:`How to use a session<use_session>`
ja: :ref:`セッションの使い方<use_session>`
ko: :ref:`세션 사용하는 방법<use_session>`
th: :ref:`วิธีการใช้เซสชัน<use_session>`

source: :ref:`How to delete a session<delete_session>`
ja: :ref:`セッションの削除方法<delete_session>`
ko: :ref:`세션 종료하는 방법<delete_session>`
th: :ref:`วิธีลบเซสชัน<delete_session>`

source: Part 2. Advanced guide to using Backend.AI
ja: パート2. Backend.AIの高度な使用ガイド
ko: 파트 2. Backend.AI 고급 사용 가이드

source: :ref:`How to use terminal application with tmux<tmux_guide>`
ja: :ref:`tmuxを使用した端末アプリケーションの使い方<tmux_guide>`
ko: :ref:`tmux 를 사용한 terminal 사용법<tmux_guide>`
th: :ref:`วิธีการใช้แอปพลิเคชันเทอร์มินัลกับ tmux<tmux_guide>`

source: :ref:`How to install extra pip package using automount virtual folder<install_pip_pkg>`
ja: :ref:`仮想フォルダの自動マウントを使用して追加のpipパッケージをインストールする方法<install_pip_pkg>`
ko: :ref:`자동마운트되는 가상폴더를 사용해서 pip 패키지를 설치하는 방법<install_pip_pkg>`
th: :ref:`วิธีติดตั้งแพ็คเกจ pip เพิ่มเติมโดยใช้โฟลเดอร์เสมือนแบบอัตโนมัต<install_pip_pkg>`

source: :ref:`How to use SSH/sFTP <ssh-sftp-container>`
ja: :ref:`SSH/sFTP の使用方法 <ssh-sftp-container>`
ko: :ref:`Backend.AI에서 SSH/sFTP 을 사용하는 방법<ssh-sftp-container>`
th: :ref:`วิธีการใช้ SSH/sFTP <ssh-sftp-container>`

source: :ref:`How to install apt packages<installing_apt_pkg>`
ja: :ref:`apt パッケージをインストールする方法<installing_apt_pkg>`
ko: :ref:`APT 패키지 설치하는 방법<installing_apt_pkg>`
th: :ref:`วิธีการติดตั้งแพ็คเกจ apt<installing_apt_pkg>`

source: Welcome to Quickstart guide of GPU Platform WebUI. This tutorial will cover the essentials of using GPU Platform without any knowledge base.
th: ยินดีต้อนรับสู่คู่มือเริ่มต้นของ GPU Platform WebUI คู่มือนี้จะครอบคลุมพื้นฐานในการใช้งาน GPU Platform โดยไม่จำเป็นต้องมีความรู้พื้นฐาน

source: Part 1. Basic guide to using GPU Platform
th: ส่วนที่ 1. คู่มือเบื้องต้นในการใช้ GPU Platform

source: Part 2. Advanced guide to using GPU Platform
th: ส่วนที่ 2. คู่มือขั้นสูงในการใช้ GPU Platform
