Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/model_serving/model_serving.po
Languages: ja, th

source: Single Node: When running a session, the managed node and worker nodes are placed on a single physical node or virtual machine.
ja: シングルノード: セッションを実行する際、管理ノードとワーカーノードは単一の物理ノードまたは仮想マシン上に配置されます。
th: โหนดเดียว: เมื่อรันเซสชัน โหนดที่จัดการและโหนดทำงานจะถูกวางอยู่บนโหนดทางกายภาพเดียวหรือเครื่องเสมือนเดียว

source: Multi Node: When running a session, one managed node and one or more worker nodes are split across multiple physical nodes or virtual machines.
ja: マルチノード: セッションを実行する際、1つの管理ノードと1つ以上のワーカーノードが複数の物理ノードまたは仮想マシンに分割されます。
th: หลายโหนด: เมื่อต้องการทำงานในเซสชัน หนึ่งโหนดที่จัดการและหนึ่งโหนดทำงานหรือมากกว่านั้นจะถูกแบ่งออกเป็นหลายโหนดทางกายภาพหรือเครื่องเสมือน

source: Variable: In this section, you can set environment variable when starting a model service. It is useful when you trying to create a model service using runtime variant. some runtime variant needs certain environment variable setting before execution.
ja: 変数: このセクションでは、モデルサービスを開始する際に環境変数を設定できます。これは、ランタイムバリアントを使用してモデルサービスを作成しようとする際に便利です。いくつかのランタイムバリアントは、実行前に特定の環境変数の設定が必要です。
th: ตัวแปร: ในส่วนนี้ คุณสามารถตั้งค่าตัวแปรสภาพแวดล้อมเมื่อเริ่มต้นบริการโมเดล มีประโยชน์เมื่อคุณพยายามสร้างบริการโมเดลโดยใช้รูปแบบการทำงานบางรูปแบบต้องการการตั้งค่าตัวแปรสภาพแวดล้อมบางอย่างก่อนการดำเนินการ

source: Before creating model service, Backend.AI supports validation feature to check whether execution is available or not(due to any errors during execution). By clicking the 'Validate' button at the bottom-left of the service launcher, a new popup for listening to validation events will pop up. In the popup modal, you can check the status through the container log. When the result is set to ``Finished``, then the validation check is finished.
ja: モデルサービスを作成する前に、Backend.AIは実行が可能かどうか（実行中のエラーによる）を確認するためのバリデーション機能をサポートしています。サービスランチャーの左下にある「Validate」ボタンをクリックすると、バリデーションイベントをリスニングするための新しいポップアップが表示されます。このポップアップモーダル内で、コンテナログを通じてステータスを確認できます。結果が「Finished」に設定されると、バリデーションチェックが完了です。
th: ก่อนที่จะสร้างบริการโมเดล Backend.AI รองรับฟีเจอร์การตรวจสอบเพื่อดูว่าการดำเนินการนั้นสามารถทำได้หรือไม่ (เนื่องจากข้อผิดพลาดใด ๆ ในระหว่างการดำเนินการ) โดยการคลิกที่ปุ่ม 'Validate' ที่มุมซ้ายล่างของตัวเปิดบริการ จะปรากฏหน้าต่างป๊อปอัปใหม่เพื่อรListening to validation events ในหน้าต่างป๊อปอัป คุณสามารถตรวจสอบสถานะผ่านบันทึกของคอนเทนเนอร์ เมื่อผลลัพธ์ถูกตั้งค่าเป็น ``Finished`` หมายความว่าการตรวจสอบการตรวจสอบเสร็จสิ้นแล้ว

source: The result ``Finished`` doesn't guarantee that the execution is successfully done. Instead, please check the container log.
ja: 結果 ``Finished`` は実行が成功したことを保証するものではありません。代わりに、コンテナログを確認してください。
th: ผลลัพธ์ ``Finished`` ไม่รับประกันว่าการดำเนินการเสร็จสมบูรณ์อย่างประสบความสำเร็จ แต่อย่างใด กรุณาตรวจสอบบันทึกของคอนเทนเนอร์ด้วย

source: **Handling Failed Model Service Creation**
ja: **失敗したモデルサービスの作成の処理**
th: **การจัดการกับการสร้างบริการโมเดลที่ล้มเหลว**

source: If the status of the model service remains ``UNHEALTHY``, it indicates that the model service cannot be executed properly.
ja: モデルサービスのステータスが``UNHEALTHY``のままである場合、それはモデルサービスが正しく実行できないことを示しています。
th: หากสถานะของบริการโมเดลยังคงอยู่ในสถานะ ``UNHEALTHY`` หมายความว่าบริการโมเดลไม่สามารถถูกดำเนินการได้อย่างถูกต้อง.

source: The common reasons for creation failure and their solutions are as follows:
ja: 作成失敗の一般的な理由とその解決策は以下の通りです。
th: สาเหตุทั่วไปของการสร้างล้มเหลวและวิธีแก้ไขมีดังนี้:

source: Insufficient allocated resources for the routing when creating the model service
ja: モデルサービスを作成する際にルーティングのために割り当てられたリソースが不足しています。
th: ทรัพยากรที่จัดสรรไม่เพียงพอสำหรับการจัดการเส้นทางเมื่อสร้างบริการโมเดล

source: Solution: Terminate the problematic service and recreate it with an allocation of more sufficient resources than the previous settings.
ja: 解決策: 問題のあるサービスを終了し、前の設定よりも十分なリソースを割り当てて再作成してください。
th: วิธีแก้ไข: หยุดบริการที่มีปัญหาและสร้างใหม่โดยจัดสรรทรัพยากรที่เพียงพอกว่าการตั้งค่าเดิม

source: Incorrect format of the model definition file (``model-definition.yml``)
ja: モデル定義ファイル（``model-definition.yml``）の形式が正しくありません
th: รูปแบบของไฟล์นิยามโมเดลไม่ถูกต้อง (``model-definition.yml``)

source: Serving route error
ja: サービングルートエラー
th: ข้อผิดพลาดในการให้บริการเส้นทาง

source: Solution: Verify :ref:`the format of the model definition file <model_definition_guide>` and if any key-value pairs are incorrect, modify them and overwrite the file in the saved location. Then, click 'Clear error and Retry' button to remove all the error stacked in routes info table and ensure that the routing of the model service is set correctly.
ja: 解決策: :ref:`モデル定義ファイルの形式 <model_definition_guide>` を確認し、もしキーと値のペアに誤りがある場合はそれを修正して保存先にファイルを上書きしてください。その後、『エラーをクリアして再試行』ボタンをクリックして、ルート情報テーブルに積み重なったすべてのエラーを削除し、モデルサービスのルーティングが正しく設定されていることを確認してください。
th: วิธีแก้ไข: ตรวจสอบ :ref:`รูปแบบของไฟล์นิยามโมเดล <model_definition_guide>` และหากมีคู่คีย์-ค่าใดผิดพลาด ให้แก้ไขและเขียนทับไฟล์ในตำแหน่งที่บันทึก จากนั้นคลิกที่ปุ่ม 'ลบข้อผิดพลาดและลองใหม่' เพื่อกำจัดข้อผิดพลาดทั้งหมดที่สะสมอยู่ในตารางข้อมูลเส้นทางและตรวจสอบให้แน่ใจว่าการจัดเส้นทางบริการโมเดลนั้นถูกตั้งค่าอย่างถูกต้อง

source: Refresh button
ja: 更新ボタン
th: ปุ่มรีเฟรช

source: Generating Tokens
ja: トークンの生成
th: การสร้างโทเค็น

source: Once the model service is successfully executed, the status will be set to ``HEALTHY``. In this case, you can click on the corresponding endpoint name in the Model Service tab to view detailed information about the model service. From there, you can check the service endpoint in the routing information of the model service. If the 'Open to Public' option is enabled when the service is created, the endpoint will be publicly accessible without any separate token, and end users can access it. However, if it is disabled, you can issue a token as described below to verify that the service is running properly.
ja: モデルサービスが正常に実行されると、ステータスは ``HEALTHY`` に設定されます。この場合、モデルサービスタブで該当するエンドポイント名をクリックすると、モデルサービスに関する詳細情報を確認できます。そこから、モデルサービスのルーティング情報でサービスエンドポイントを確認できます。サービスを作成する際に「Open to Public」オプションが有効になっている場合、エンドポイントは別途トークンなしで一般にアクセス可能となり、エンドユーザーがアクセスできます。しかし、無効になっている場合は、サービスが正常に動作していることを確認するために、以下のようにトークンを発行できます。
th: เมื่อนำบริการโมเดลไปใช้งานสำเร็จ สถานะจะถูกตั้งเป็น ``HEALTHY`` ในกรณีนี้คุณสามารถคลิกที่ชื่อจุดสิ้นสุดที่ ที่เกี่ยวข้อง ในแท็บบริการโมเดลเพื่อดูข้อมูลรายละเอียดเกี่ยวกับบริการโมเดล จากที่นั่นคุณสามารถตรวจสอบจุดสิ้นสุดของบริการในข้อมูลการจัดเส้นทางของบริการโมเดล หากตัวเลือก 'เปิดให้สาธารณะ' ถูกเปิดใช้งานเมื่อสร้างบริการ จุดสิ้นสุดจะสามารถเข้าถึงได้สาธารณะโดยไม่ต้องมีโทเค็นแยกต่างหากและผู้ใช้ปลายทางสามารถเข้าถึงได้ อย่างไรก็ตาม หากถูกปิดใช้งาน คุณสามารถออกโทเค็นตามที่อธิบายไว้ด้านล่างเพื่อยืนยันว่าบริการกำลังทำงานอย่างถูกต้อง

source: Routing page
ja: ルーティングページ
th: หน้าการจัดเส้นทาง

source: Click the 'Generate Token' button located to the right of the generated token list in the routing information. In the modal that appears for token creation, enter the expiration date.
ja: ルーティング情報内の生成されたトークンリストの右側にある「トークンを生成」ボタンをクリックします。トークン作成用のモーダルが表示されたら、有効期限を入力します。
th: คลิกที่ปุ่ม 'สร้างโทเค็น' ที่อยู่ด้านขวาของรายการโทเค็นที่สร้างในข้อมูลการกำหนดเส้นทาง ในโมดัลที่ปรากฏขึ้นสำหรับการสร้างโทเค็น ให้ป้อนวันหมดอายุ

source: Token generation dialog
ja: トークン生成ダイアログ
th: กล่องโต้ตอบการสร้างโทเค็น

source: The issued token will be added to the list of generated tokens. Click the 'copy' button in the token item to copy the token, and add it as the value of the following key.
ja: 発行されたトークンは生成されたトークンのリストに追加されます。トークン項目の「コピー」ボタンをクリックしてトークンをコピーし、以下のキーの値として追加します。
th: โทเค็นที่ออกจะถูกเพิ่มลงในรายการของโทเค็นที่สร้างขึ้น คลิกที่ปุ่ม 'คัดลอก' ในรายการโทเค็นเพื่อคัดลอกโทเค็นนั้น และเพิ่มเป็นค่าในกุญแจถัดไป

source: Generated token copy
ja: 生成されたトークンをコピー
th: คัดลอกโทเค็นที่สร้างขึ้น

source: Key
ja: キー
th: กุญแจ

source: Value
ja: 値
th: ค่า

source: Content-Type
ja: コンテンツタイプ
th: ประเภทเนื้อหา

source: application/json
ja: アプリケーション/JSON
th: แอพพลิเคชัน/json

source: Authorization
ja: 認可
th: การอนุญาต

source: Accessing the Model Service Endpoint for End Users
ja: エンドユーザー向けモデルサービスエンドポイントへのアクセス
th: การเข้าถึงจุดบริการโมเดลสำหรับผู้ใช้ปลายทาง

source: To complete the model serving, you need to share information with the actual end users so that they can access the server where the model service is running. If the Open to Public option is enabled when the service is created, you can share the service endpoint value from the routing information page. If the service was created with the option disabled, you can share the service endpoint value along with the token previously generated.
ja: モデルサービングを完了するには、実際のエンドユーザーに情報を共有し、モデルサービスが実行されているサーバーにアクセスできるようにする必要があります。サービス作成時に公開するオプションが有効になっている場合は、ルーティング情報ページからサービスエンドポイントの値を共有できます。オプションが無効で作成されたサービスの場合は、以前に生成されたトークンとともにサービスエンドポイントの値を共有することができます。
th: ในการเสร็จสิ้นการให้บริการโมเดล คุณจำเป็นต้องแบ่งปันข้อมูลกับผู้ใช้ปลายทางจริงเพื่อให้พวกเขาสามารถเข้าถึงเซิร์ฟเวอร์ที่ให้บริการโมเดลได้ หากเปิดตัวเลือก Open to Public ขณะสร้างบริการ คุณสามารถแบ่งปันค่า endpoint ของบริการจากหน้าข้อมูลการจัดเส้นทาง หากบริการถูกสร้างขึ้นด้วยตัวเลือกที่ปิดใช้งาน คุณสามารถแบ่งปันค่า endpoint ของบริการพร้อมกับโทเค็นที่สร้างขึ้นก่อนหน้านี้ได้

source: Here's the simple command using ``curl`` command whether to check sending any requests to model serving endpoint working properly or not.
ja: モデル提供エンドポイントにリクエストを送信することが適切に機能しているかどうかを確認するための、``curl`` コマンドを使用した簡単なコマンドはこちらです。
th: นี่คือคำสั่งง่ายๆ ที่ใช้คำสั่ง ``curl`` เพื่อตรวจสอบว่าการส่งคำขอไปยังจุดสิ้นสุดการให้บริการโมเดลทำงานได้อย่างถูกต้องหรือไม่

source: By default, end users must be on a network that can access the endpoint. If the service was created in a closed network, only end users who have access within that closed network can access the service.
ja: デフォルトでは、エンドユーザーはエンドポイントにアクセスできるネットワーク上になければなりません。サービスが閉じたネットワークで作成された場合、その閉じたネットワーク内にアクセスできるエンドユーザーのみがサービスにアクセスできます。
th: โดยเริ่มต้น ผู้ใช้งานปลายทางต้องอยู่บนเครือข่ายที่สามารถเข้าถึงจุดสิ้นสุดได้ หากบริการถูกสร้างขึ้นในเครือข่ายที่ปิด การเข้าถึงบริการจะเฉพาะสำหรับผู้ใช้งานปลายทางที่มีการเข้าถึงภายในเครือข่ายที่ปิดนั้นเท่านั้น

source: Using the Large Language Model
ja: 大規模言語モデルの使用

source: If you've created a Large Language Model (LLM) service, you can test the LLM in real-time. Simply click the 'LLM Chat Test' button located in the Service Endpoint column.
ja: 大規模言語モデル (LLM) サービスを作成した場合、リアルタイムで LLM をテストできます。サービスエンドポイント列にある 'LLM チャットテスト' ボタンをクリックするだけです。

source: LLM Chat Test
ja: LLMチャットテスト

source: Then, a modal for chatting will appear as shown below. You can input the text you want to chat with the LLM model and click the 'Send' button or press 'Enter'. The LLM model will respond to the text you entered.
ja: その後、下記のようにチャット用のモーダルが表示されます。 LLMモデルとチャットしたいテキストを入力し、『送信』ボタンをクリックするか、『Enter』キーを押してください。 LLMモデルは、あなたが入力したテキストに応答します。

source: LLM Chat Dialog
ja: LLMチャットダイアログ

source: If you encounter issues connecting to the API, a custom modal will appear allowing you to manually specify model settings. To use the model, you will need the following information:
ja: APIに接続する際に問題が発生した場合、カスタムモーダルが表示され、モデル設定を手動で指定できるようになります。モデルを使用するには、次の情報が必要です。

source: baseURL: Base URL of the server where the model is located. Make sure to include the version information. For instance, when utilizing the OpenAI API, you should enter https://api.openai.com/v1.
ja: baseURL: モデルが配置されているサーバーのベースURL。バージョン情報を含めることを忘れないでください。例えば、OpenAI APIを利用する場合は、 https://api.openai.com/v1 を入力してください。

source: Model ID: Unique identifier of the model. To specify the model you wish to use, you would provide its unique identifier. For instance, for GPT-4, you would input 'gpt-4o'.
ja: モデルID: モデルのユニークな識別子。使用したいモデルを指定するには、そのユニークな識別子を提供します。例えば、GPT-4の場合は、 'gpt-4o' を入力します。

source: Token (optional): An authentication key to access the model service. Tokens can be generated from various services, not just Backend.AI. The format and generation process may vary depending on the service. Always refer to the specific service's guide for details. For instance, when using the service generated by Backend.AI, please refer to the :ref:`Generating Tokens<generating-tokens>` section for instructions on how to generate tokens.
ja: トークン（オプション）: モデルサービスにアクセスするための認証キー。トークンは、Backend.AI だけでなく様々なサービスから生成することができます。フォーマットや生成プロセスはサービスによって異なる場合があります。詳細については常に特定のサービスのガイドを参照してください。例えば、Backend.AI によって生成されるサービスを使用する場合、トークンの生成方法については :ref:`Generating Tokens<generating-tokens>` のセクションを参照してください。

source: LLM Chat Dialog Custom
ja: LLMチャットダイアログカスタム

source: Click the 'More' button in the upper left corner to access additional features. Compare with other LLM models, delete chat history, and more. For more information on 'Compare with other models', please refer to the :ref:`LLM Playground<LLM-playground>` section.
ja: 左上の「その他」ボタンをクリックして追加機能にアクセスします。他のLLMモデルと比較したり、チャット履歴を削除したりすることができます。「他のモデルと比較」の詳細については、 :ref:`LLM Playground<LLM-playground>` セクションを参照してください。

source: LLM Chat Dialog extra features
ja: LLM チャットダイアログ追加機能

source: Modifying Model Service
ja: モデルサービスの修正
th: การแก้ไขบริการโมเดล

source: Click on the wrench icon in the Control tab to open a modal where you can change the model service. The format is identical to the model service start modal, with previously entered fields already filled in. You can optionally modify only the fields you wish to change. After modifying the fields, click the 'confirm' button. The changes will be adjusted accordingly.
ja: Controlタブのレンチアイコンをクリックすると、モデルサービスを変更できるモーダルが開きます。フォーマットはモデルサービス開始モーダルと同一で、以前に入力したフィールドはすでに入力済みです。変更したいフィールドのみをオプションで修正することができます。フィールドを修正した後、'confirm'ボタンをクリックします。変更はそれに応じて調整されます。
th: คลิกที่ไอคอนประแจในแท็บการควบคุมเพื่อเปิดแบบฟอร์มโมดัลที่คุณสามารถเปลี่ยนบริการโมเดลได้ รูปแบบจะเหมือนกับโมดัลเริ่มบริการโมเดล โดยมีช่องข้อมูลที่กรอกไว้ก่อนหน้านี้ถูกกรอกเรียบร้อยแล้ว คุณสามารถเลือกที่จะปรับเปลี่ยนเฉพาะช่องข้อมูลที่ต้องการเปลี่ยนแปลง หลังจากปรับเปลี่ยนช่องข้อมูลแล้วให้คลิกที่ปุ่ม 'ยืนยัน' การเปลี่ยนแปลงจะถูกปรับตามที่ได้ทำการแก้ไข.

source: Edit model service dialog
ja: モデルサービス編集ダイアログ
th: แก้ไขกล่องโต้ตอบบริการโมเดล

source: Terminating Model Service
ja: モデルサービスの終了
th: การยุติบริการโมเดล

source: The model service periodically runs a scheduler to adjust the routing count to match the desired session count. However, this puts a burden on the Backend.AI scheduler. Therefore, it is recommended to terminate the model service if it is no longer needed. To terminate the model service, click on the 'trash' button in the Control column. A modal will appear asking for confirmation to terminate the model service. Clicking ``OK`` will terminate the model service. The terminated model service will be removed from the list of model services.
ja: モデルサービスは、必要なセッション数に合わせてルーティング数を調整するために、定期的にスケジューラを実行します。しかし、これはBackend.AIのスケジューラに負担をかけます。したがって、モデルサービスが不要になった場合は終了することをお勧めします。モデルサービスを終了するには、コントロール欄の「ゴミ箱」ボタンをクリックします。モデルサービスを終了するかどうかの確認を求めるモーダルが表示されます。「OK」をクリックすると、モデルサービスは終了します。終了したモデルサービスは、モデルサービスのリストから削除されます。
th: บริการโมเดลจะทำการรันตัวกำหนดเวลาเป็นระยะ ๆ เพื่อปรับจำนวนการจัดเส้นทางให้ตรงกับจำนวนเซสชันที่ต้องการ อย่างไรก็ตาม สิ่งนี้สร้างภาระให้กับตัวกำหนดเวลา Backend.AI ดังนั้นจึงแนะนำให้ยกเลิกบริการโมเดลหากไม่จำเป็นอีกต่อไป เพื่อยกเลิกบริการโมเดล ให้คลิกที่ปุ่ม 'ถังขยะ' ในคอลัมน์การควบคุม จะมีหน้าต่างป๊อปอัปขึ้นมาเพื่อขอการยืนยันในการยกเลิกบริการโมเดล การคลิก ตกลง จะยกเลิกบริการโมเดล โดยบริการโมเดลที่ถูกยกเลิกจะถูกลบออกจากรายการบริการโมเดล

source: Terminate model service dialog
ja: モデルサービス終了ダイアログ
th: กล่องโต้ตอบการสิ้นสุดบริการโมเดล

source: After creating the folder, select the 'MODELS' tab in the Data & Folders page, click on the recently created model type folder icon to open the folder explorer, and upload the model definition file.
th: หลังจากสร้างโฟลเดอร์แล้ว ให้เลือกแท็บ 'MODELS' ในหน้าข้อมูลและโฟลเดอร์ คลิกที่ไอคอนโฟลเดอร์ประเภทแบบจำลองที่สร้างขึ้นใหม่เพื่อเปิดตัวสำรวจโฟลเดอร์ และอัปโหลดไฟล์การกำหนดแบบจำลอง

source: For example, if you choose ``vLLM`` or ``NVIDIA NIM`` or ``Predefined Image Command`` as a runtime variant of model service,
th: ตัวอย่างเช่น หากคุณเลือก ``vLLM`` หรือ ``NVIDIA NIM`` หรือ ``Predefined Image Command`` เป็นประเภทการทำงานของบริการโมเดล

source: there's no need to configure a ``model-definition`` file in your model folder to mount. Instead, you might have to set an additional environment variable.
th: ไม่มีความจำเป็นต้องกำหนดไฟล์ ``model-definition`` ในโฟลเดอร์โมเดลของคุณเพื่อทำการติดตั้ง แทนที่นั้น คุณอาจต้องตั้งค่าตัวแปรสภาพแวดล้อมเพิ่มเติม

source: For more information, please take a look at `Model Variant: Easily Serving Various Model Services <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_.
th: สำหรับข้อมูลเพิ่มเติม โปรดดูที่ `Model Variant: Easily Serving Various Model Services <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_.

source: BackendAI
th: แบ็คเอนด์เอไอ
