Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/model_serving/model_serving.po
Languages: ja, th

source: Model Serving
ja: モデルサービング
th: การให้บริการโมเดล

source: Model Service
ja: モデルサービス
th: บริการโมเดล

source: This feature is supported in Enterprise version only.
ja: この機能はエンタープライズ版でのみサポートされています。
th: ฟีเจอร์นี้รองรับเฉพาะในเวอร์ชัน Enterprise เท่านั้น

source: Backend.AI not only facilitates the construction of development environments and resource management during the model training phase, but also supports the model service feature from version 23.09 onwards. This feature allows end-users (such as AI-based mobile apps and web service backends) to make inference API calls when they want to deploy the completed model as an inference service.
ja: Backend.AI は、モデルトレーニングの段階での開発環境の構築およびリソース管理を容易にするだけでなく、バージョン23.09以降からモデルサービス機能もサポートしています。この機能により、エンドユーザー（AIベースのモバイルアプリやウェブサービスのバックエンドなど）は、完成したモデルを推論サービスとしてデプロイしたいときに推論APIコールを行うことができます。
th: Backend.AI ไม่เพียงแต่ช่วยในการสร้างสภาพแวดล้อมการพัฒนาและการจัดการทรัพยากรในระหว่างขั้นตอนการฝึกโมเดลเท่านั้น แต่ยังรองรับฟีเจอร์บริการโมเดลตั้งแต่เวอร์ชัน 23.09 เป็นต้นไป ฟีเจอร์นี้ช่วยให้ผู้ใช้ปลายทาง (เช่น แอปพลิเคชันมือถือที่ใช้ AI และแบ็กเอนด์บริการเว็บ) สามารถทำการเรียก API การอนุมานเมื่อพวกเขาต้องการนำโมเดลที่เสร็จสมบูรณ์ไปใช้งานเป็นบริการการอนุมาน

source: Model serving diagram
ja: モデル提供図
th: แผนภาพการให้บริการโมเดล

source: The Model Service extends the functionality of the existing training compute sessions, enabling automated maintenance, scaling, and permanent port and endpoint address mapping for production services. Developers or administrators only need to specify the scaling parameters required for the Model Service, without the need to manually create or delete compute sessions.
ja: モデルサービスは、既存のトレーニングコンピュートセッションの機能を拡張し、自動メンテナンス、スケーリング、および本番サービスのための永続的なポートとエンドポイントアドレスのマッピングを可能にします。開発者または管理者は、モデルサービスに必要なスケーリングパラメータを指定するだけでよく、コンピュートセッションを手動で作成または削除する必要はありません。
th: บริการโมเดลขยายฟังก์ชันการทำงานของเซสชันการคอมพิวเตอร์การฝึกอบรมที่มีอยู่ โดยช่วยให้การบำรุงรักษา การปรับขนาดอัตโนมัติ และการแมพตำแหน่งพอร์ตและที่อยู่เอ็นด์พอยต์ถาวรสำหรับบริการการผลิต ทำให้ผู้พัฒนาหรือผู้ดูแลระบบจำเป็นต้องระบุพารามิเตอร์การปรับขนาดที่จำเป็นสำหรับบริการโมเดล โดยไม่จำเป็นต้องสร้างหรือลบเซสชันการคอมพิวเตอร์ด้วยตนเอง

source: Configuring and limitations of model service in version 23.03 and earlier
ja: バージョン23.03以前のモデルサービスの設定と制限事項
th: การตั้งค่าและข้อจำกัดของบริการโมเดลในเวอร์ชัน 23.03 และก่อนหน้า

source: Although the model serving-specific feature is officially supported from version 23.09, you can still use model service in earlier versions.
ja: モデル・サービング特有の機能はバージョン23.09から公式にサポートされていますが、以前のバージョンでもモデルサービスを使用することができます。
th: แม้ว่าเราจะรองรับฟีเจอร์เฉพาะการให้บริการโมเดลอย่างเป็นทางการตั้งแต่เวอร์ชัน 23.09 แต่คุณยังสามารถใช้บริการโมเดลในเวอร์ชันก่อนหน้าได้

source: For example, in version 23.03, you can configure a model service by modifying the compute session for training in the following way:
ja: たとえば、バージョン23.03では、次の方法でトレーニング用のコンピュートセッションを変更することにより、モデルサービスを構成できます。
th: ตัวอย่างเช่น ในเวอร์ชัน 23.03 คุณสามารถกำหนดค่าโมเดลเซอร์วิสโดยการปรับเปลี่ยนเซสชันการคำนวณสำหรับการฝึกอบรมในลักษณะดังนี้:

source: Add pre-opened ports during session creation to map the running server port inside the session for model serving. (For instructions on how to use preopen ports, refer to this :ref:`Set Preopen Ports <set_preopen_ports>`.)
ja: モデル提供のためにセッション作成時に事前に開かれたポートを追加して、セッション内の実行中のサーバーポートをマッピングします。（事前に開かれたポートの使用方法については、こちらの :ref:`Set Preopen Ports <set_preopen_ports>` を参照してください。）
th: เพิ่มพอร์ตที่เปิดอยู่ล่วงหน้าในระหว่างการสร้างเซสชันเพื่อแมปพอร์ตเซิร์ฟเวอร์ที่ทำงานอยู่ภายในเซสชันสำหรับการให้บริการโมเดล (สำหรับคำแนะนำเกี่ยวกับการใช้พอร์ตที่เปิดอยู่ล่วงหน้า โปรดดูที่ :ref:`Set Preopen Ports <set_preopen_ports>`.)

source: Check 'Open app to public' to allow the service mapped to the pre-opened port to be publicly accessible. (For detailed information about "Open app to public," refer to this :ref:`Open app to public <open_app_to_public>`.)
ja: 「アプリを公開する」をチェックして、事前に開いたポートにマッピングされたサービスを公開可能にします。（「アプリを公開する」の詳細については、こちらを参照してください :ref:`Open app to public <open_app_to_public>`。）
th: ตรวจสอบ 'เปิดแอปให้สาธารณะ' เพื่ออนุญาตให้บริการที่แมพกับพอร์ตที่เปิดไว้ล่วงหน้าสามารถเข้าถึงได้สาธารณะ (สำหรับข้อมูลรายละเอียดเกี่ยวกับ "เปิดแอปให้สาธารณะ" โปรดดูที่ :ref:`เปิดแอปให้สาธารณะ <open_app_to_public>`.)

source: However, there are certain limitations in version 23.03:
ja: しかし、バージョン23.03にはいくつかの制限があります:
th: อย่างไรก็ตาม มีข้อจำกัดบางประการในเวอร์ชัน 23.03:

source: Sessions do not automatically recover if they are terminated due to external factors such as idle timeout or system errors.
ja: セッションは、アイドルタイムアウトやシステムエラーなどの外部要因で終了した場合、自動的に復旧しません。
th: เซสชันจะไม่ฟื้นคืนโดยอัตโนมัติหากถูกยกเลิกเนื่องจากปัจจัยภายนอกเช่นเวลาไม่ทำงานหรือตัวบกพร่องของระบบ

source: The app port changes every time a session is restarted.
ja: セッションが再起動されるたびにアプリのポートが変更されます。
th: พอร์ตของแอปจะเปลี่ยนทุกครั้งที่เริ่มเซสชันใหม่

source: If sessions are repeatedly restarted, the idle ports may be exhausted.
ja: セッションが繰り返し再起動されると、アイドルポートが枯渇する可能性があります。
th: หากเซสชันถูกรีสตาร์ทซ้ำๆ พอร์ตที่ไม่ได้ใช้งานอาจหมดลง

source: The official Model Service feature in version 23.09 resolves these limitations. Therefore, starting from version 23.09, it is recommended to create/manage Model Services through the model serving menu whenever possible. The use of pre-opened ports is recommended only for development and testing purposes.
ja: バージョン23.09の公式モデルサービス機能は、これらの制限を解決します。したがって、バージョン23.09以降では、可能な限りモデルサービングメニューを通じてモデルサービスを作成/管理することをお勧めします。事前に開放されたポートの使用は、開発およびテスト目的にのみ推奨されます。
th: ฟีเจอร์ Model Service อย่างเป็นทางการในเวอร์ชัน 23.09 แก้ไขข้อจำกัดเหล่านี้ ดังนั้นเริ่มตั้งแต่เวอร์ชัน 23.09 จึงแนะนำให้สร้าง/จัดการ Model Services ผ่านเมนูการให้บริการโมเดลเมื่อเป็นไปได้ การใช้พอร์ตที่เปิดใช้งานล่วงหน้าจะแนะนำเฉพาะสำหรับการพัฒนาและการทดสอบเท่านั้น

source: Guide to Steps for Using Model Service
ja: モデルサービスの使用手順ガイド
th: คู่มือสำหรับขั้นตอนการใช้งานบริการโมเดล

source: To use the Model Service, you need to follow the steps below:
ja: Model Service を使用するには、以下の手順に従う必要があります。
th: เพื่อใช้บริการโมเดล คุณต้องปฏิบัติตามขั้นตอนด้านล่างนี้:

source: Create a model definition file.
ja: モデル定義ファイルを作成します。
th: สร้างไฟล์นิยามโมเดล。

source: Upload the model definition file to the model type folder.
ja: モデル定義ファイルをモデルタイプフォルダーにアップロードします。
th: อัปโหลดไฟล์นิยามโมเดลไปยังโฟลเดอร์ประเภทโมเดล.

source: Create/Validate the Model Service.
ja: モデルサービスを作成/検証する。
th: สร้าง/ตรวจสอบบริการโมเดล

source: (If the Model Service is not public) Obtain a token.
ja: （モデルサービスが公開されていない場合）トークンを取得します。
th: (ถ้าบริการโมเดลไม่เป็นสาธารณะ) รับโทเค็น

source: (For end users) Access the endpoint corresponding to the Model Service to verify the service.
ja: (エンドユーザー向け) モデルサービスに対応するエンドポイントにアクセスして、サービスを確認します。
th: (สำหรับผู้ใช้ปลายทาง) เข้าถึงจุดสุดท้ายที่สอดคล้องกับบริการโมเดลเพื่อตรวจสอบบริการ

source: (If needed) Modify the Model Service.
ja: （必要に応じて）モデルサービスを変更する。
th: (ถ้าจำเป็น) ปรับเปลี่ยนบริการโมเดล

source: (If needed) Terminate the Model Service.
ja: （必要に応じて）モデルサービスを終了します。
th: (ถ้าจำเป็น) ยกเลิกบริการโมเดล

source: Creating a Model Definition File
ja: モデル定義ファイルの作成
th: การสร้างไฟล์กำหนดรูปแบบโมเดล

source: From 24.03, you can configure model definition file name. But if you don't input any other input field in model definition file path, then the system will regard it as ``model-definition.yml`` or ``model-definition.yaml``.
ja: 24.03から、モデル定義ファイル名を設定することができます。しかし、モデル定義ファイルパスの他の入力フィールドに何も入力しない場合、システムはそれを ``model-definition.yml`` または ``model-definition.yaml`` と見なします。
th: ตั้งแต่วันที่ 24.03 คุณสามารถกำหนดชื่อไฟล์การกำหนดโมเดลได้ แต่หากคุณไม่กรอกฟิลด์การป้อนข้อมูลอื่นในเส้นทางไฟล์การกำหนดโมเดล ระบบจะถือว่ามันเป็น ``model-definition.yml`` หรือ ``model-definition.yaml``

source: The model definition file contains the configuration information required by the Backend.AI system to automatically start, initialize, and scale the inference session. It is stored in the model type folder independently from the container image that contains the inference service engine. This allows the engine to serve different models based on specific requirements and eliminates the need to build and deploy a new container image every time the model changes. By loading the model definition and model data from the network storage, the deployment process can be simplified and optimized during automatic scaling.
ja: モデル定義ファイルには、推論セッションを自動的に開始、初期化、およびスケーリングするためにBackend.AIシステムで必要な構成情報が含まれています。これは推論サービスエンジンを含むコンテナイメージとは独立して、モデルタイプフォルダーに保存されます。これにより、特定の要件に基づいて異なるモデルをエンジンが提供できるようになり、モデルが変更されるたびに新しいコンテナイメージを構築してデプロイする必要がなくなります。ネットワークストレージからモデル定義とモデルデータをロードすることで、自動スケーリング中にデプロイメントプロセスを簡素化し、最適化できます。
th: ไฟล์การกำหนดโมเดลประกอบด้วยข้อมูลการกำหนดค่าที่ระบบ Backend.AI ต้องการเพื่อเริ่มต้น อ初始化 และปรับขนาดเซสชันการสรุปผลโดยอัตโนมัติ มันถูกเก็บในโฟลเดอร์ประเภทโมเดลแยกต่างหากจากภาพคอนเทนเนอร์ที่มีเอนจินการบริการการสรุปผล ซึ่งอนุญาตให้เอนจินให้บริการโมเดลที่แตกต่างกันตามความต้องการเฉพาะและกำจัดความจำเป็นในการสร้างและปรับใช้ภาพคอนเทนเนอร์ใหม่ทุกครั้งที่โมเดลเปลี่ยน โดยการโหลดการกำหนดโมเดลและข้อมูลโมเดลจากที่เก็บข้อมูลบนเครือข่าย กระบวนการปรับใช้สามารถทำให้เรียบง่ายและถูกปรับปรุงในระหว่างการปรับขนาดอัตโนมัติ

source: The model definition file follows the following format:
ja: モデル定義ファイルは次の形式に従います：
th: ไฟล์นิยามโมเดลมีรูปแบบดังนี้:

source: **Key-Value Descriptions for Model Definition File**
ja: **モデル定義ファイルのキーと値の説明**
th: **คำอธิบายคู่คีย์-ค่า สำหรับไฟล์กำหนดแบบจำลอง**

source: Fields without "(Required)" mark is optional
ja: 「（必須）」マークがないフィールドはオプションです。
th: ฟิลด์ที่ไม่มีเครื่องหมาย "(Required)" เป็นฟิลด์ที่ไม่บังคับ

source: ``name`` (Required): Defines the name of the model.
ja: ``name`` (必須): モデルの名前を定義します。
th: ``name`` (จำเป็น): กำหนดชื่อของโมเดล

source: ``model_path`` (Required): Addresses the path of where model is defined.
ja: ``model_path`` (必須): モデルが定義されている場所のパスを指定します。
th: ``model_path`` (จำเป็น): ระบุที่อยู่ของที่ที่โมเดลถูกกำหนดไว้.

source: ``service``: Item for organizing information about the files to be served (includes command scripts and code).
ja: ``service``: 提供されるファイルに関する情報を整理するための項目（コマンドスクリプトやコードを含む）。
th: ``service``: รายการสำหรับจัดระเบียบข้อมูลเกี่ยวกับไฟล์ที่จะให้บริการ (รวมถึงสคริปต์คำสั่งและโค้ด)

source: ``pre_start_actions`` : Item for organizing preceding commands or actions to be executed before the ``start_command``.
ja: ``pre_start_actions`` : ``start_command`` の前に実行されるコマンドやアクションを整理するための項目です。
th: ``pre_start_actions`` : รายการสำหรับจัดระเบียบคำสั่งหรือการกระทำก่อนที่จะทำการดำเนินการ ``start_command``.

source: ``action``: Further information and description is in :ref:`here <prestart_actions>`.
ja: ``action``: 詳細情報と説明は :ref:`こちら <prestart_actions>` にあります。
th: ``action``: ข้อมูลและคำอธิบายเพิ่มเติมอยู่ที่ :ref:`ที่นี่ <prestart_actions>`.

source: ``args/*``: Further information and description is in :ref:`here <prestart_actions>`.
ja: ``args/*``: 詳細な情報と説明は :ref:`こちら <prestart_actions>` にあります。
th: ``args/*``: ข้อมูลเพิ่มเติมและคำอธิบายอยู่ที่ :ref:`ที่นี่ <prestart_actions>`

source: ``start_command`` (Required): Specify the command to be executed in model serving.
ja: ``start_command`` （必須）: モデルサービングで実行されるコマンドを指定します。
th: ``start_command`` (จำเป็น): ระบุคำสั่งที่จะดำเนินการในบริการโมเดล.

source: ``port`` (Required): Specify the ports to be opened in accordance with the commands executed during model serving at the container.
ja: ``port`` (必須): コンテナでのモデル提供中に実行されるコマンドに従って開くポートを指定します。
th: ``port`` (จำเป็น): ระบุพอร์ตที่ต้องการเปิดตามคำสั่งที่ดำเนินการระหว่างการให้บริการโมเดลที่คอนเทนเนอร์

source: ``health_check``: Item for checking whether service is running without any error according to defined period.
ja: ``health_check``: 定義された期間に従ってサービスがエラーなく実行されているかどうかを確認するための項目です。
th: ``health_check``: รายการสำหรับตรวจสอบว่าบริการทำงานโดยไม่มีข้อผิดพลาดตามช่วงเวลาที่กำหนด

source: ``path``: Specify the path for verifying that the service is running properly in model serving.
ja: ``path``: モデルサービングにおいてサービスが適切に動作していることを確認するためのパスを指定します。
th: ``path``: ระบุเส้นทางเพื่อยืนยันว่าบริการทำงานได้อย่างถูกต้องในโมเดลเซิร์ฟวิ่ง

source: ``max_retries``: Specify the number of retries to be made if there is no response after a request is sent to the service during model serving.
ja: ``max_retries``: モデルサービング中にサービスへリクエストを送信した後、応答がない場合の再試行回数を指定します。
th: ``max_retries``: กำหนดจำนวนครั้งในการลองใหม่ที่ต้องทำหากไม่มีการตอบกลับหลังจากที่มีการส่งคำขอไปยังบริการระหว่างการให้บริการโมเดล

source: **Description for service action supported in Backend.AI Model serving**
ja: **Backend.AIモデル提供でサポートされるサービスアクションの説明**
th: **คำอธิบายสำหรับการกระทำบริการที่รองรับใน Backend.AI Model serving**

source: ``write_file``: This is an action to create a file with the given file name and append control to it. the default access permission is ``644``.
ja: ``write_file``: これは、指定されたファイル名でファイルを作成し、そのファイルに制御を追加するアクションです。デフォルトのアクセス権限は ``644`` です。
th: ``write_file``: นี่คือการทำงานเพื่อสร้างไฟล์ด้วยชื่อไฟล์ที่กำหนดและทำการเพิ่มควบคุมไปยังไฟล์นั้น โดยค่าการเข้าถึงเริ่มต้นคือ ``644``.

source: ``arg/filename``: Specify the file name
ja: ``arg/filename``: ファイル名を指定します
th: ``args/filename``: ระบุชื่อไฟล์

source: ``body``: Specify the content to be added to the file.
ja: ``body``：ファイルに追加するコンテンツを指定します。
th: ``body``: ระบุเนื้อหาที่จะถูกเพิ่มลงในไฟล์

source: ``mode``: Specify the file's access permissions.
ja: ``mode``: ファイルのアクセス権限を指定します。
th: ``mode``: กำหนดสิทธิ์การเข้าถึงไฟล์.

source: ``append``: Set whether to overwrite or append content to the file as ``True`` or ``False`` .
ja: ``append``: ファイルにコンテンツを上書きするか追記するかを ``True`` または ``False`` で設定します。
th: ``append``: ตั้งค่าให้เขียนทับหรือเพิ่มเนื้อหาลงในไฟล์เป็น ``True`` หรือ ``False`` .

source: ``write_tempfile``: This is an action to create a file with a temporary file name (``.py``) and append content to it. If no value is specified for the mode, the default access permission is ``644``.
ja: ``write_tempfile``: これは、一時的なファイル名（``.py``）でファイルを作成し、その内容を追加するアクションです。モードに値が指定されていない場合、デフォルトのアクセス許可は ``644`` です。
th: ``write_tempfile``: นี่คือการดำเนินการสร้างไฟล์ด้วยชื่อไฟล์ชั่วคราว (``.py``) และเพิ่มเนื้อหาลงในนั้น หากไม่ระบุค่าใด ๆ สำหรับโหมด การอนุญาตการเข้าถึงเริ่มต้นจะเป็น ``644``.

source: ``run_command``: The result of executing a command, including any errors, will be returned in following format ( ``out``: Output of the command execution, ``err``: Error message if an error occurs during command execution)
ja: ``run_command``: コマンドを実行した結果は以下の形式で返されます（ ``out``: コマンド実行の出力、 ``err``: コマンド実行中にエラーが発生した場合のエラーメッセージ）
th: ``run_command``: ผลลัพธ์ของการดำเนินการคำสั่ง รวมถึงข้อผิดพลาดใด ๆ จะถูกส่งคืนในรูปแบบดังต่อไปนี้ ( ``out``: ผลลัพธ์ของการดำเนินการคำสั่ง, ``err``: ข้อความข้อผิดพลาดถ้าหากมีข้อผิดพลาดเกิดขึ้นระหว่างการดำเนินการคำสั่ง)

source: ``args/command``: Specify the command to executed as an array. (e.g. ``python3 -m http.server 8080`` command goes to ["python3", "-m", "http.server", "8080"] )
ja: ``args/command``: 実行されるコマンドを配列として指定します。（例: ``python3 -m http.server 8080`` コマンドは ["python3", "-m", "http.server", "8080"] となります）
th: ``args/command``: ระบุคำสั่งที่จะดำเนินการเป็นอาร์เรย์ (เช่น ``python3 -m http.server 8080`` คำสั่งจะไปที่ ["python3", "-m", "http.server", "8080"])

source: ``mkdir``: This is an action to create a directory by input path
ja: ``mkdir``: これは入力パスによってディレクトリを作成するアクションです。
th: ``mkdir``: นี่คือการกระทำในการสร้างไดเรกทอรีโดยการป้อนเส้นทาง

source: ``args/path``: Specify the path to create a directory
ja: ``args/path``: ディレクトリを作成するパスを指定します
th: ``args/path``: ระบุเส้นทางเพื่อสร้างไดเรกทอรี

source: ``log``: This is an action to print out log by input message
ja: ``log``: これは入力メッセージによってログを出力するアクションです。
th: ``log``: นี่คือการกระทำในการพิมพ์บันทึกโดยการป้อนข้อความ

source: ``args/message``: Specify the message to be displayed in the logs.
ja: ``args/message``: ログに表示されるメッセージを指定します。
th: ``args/message``: ระบุข้อความที่จะปรากฏในบันทึก.

source: ``debug``: Set to ``True`` if it is in debug mode, otherwise set to ``False``.
ja: ``debug``: デバッグモードの場合は ``True`` に設定し、それ以外の場合は ``False`` に設定します。
th: ``debug``: ตั้งค่าเป็น ``True`` หากอยู่ในโหมดดีบัก มิฉะนั้นตั้งค่าเป็น ``False``.

source: Uploading Model Definition File to Model Type Folder
ja: モデルタイプフォルダーへのモデル定義ファイルのアップロード
th: การอัปโหลดไฟล์กำหนดโมเดลไปยังโฟลเดอร์ประเภทโมเดล

source: To upload the model definition file (``model-definition.yml``) to the model type folder, you need to create a virtual folder. When creating the virtual folder, select the ``model`` type instead of the default ``general`` type. Refer to the section on :ref:`creating a storage folder<create_storage_folder>` in the Data & Folders page for instructions on how to create a folder.
ja: モデル定義ファイル（``model-definition.yml``）をモデルタイプフォルダにアップロードするには、仮想フォルダを作成する必要があります。仮想フォルダを作成する際、デフォルトの ``general`` タイプではなく、``model`` タイプを選択します。フォルダの作成方法については、データ & フォルダーページの :ref:`ストレージフォルダの作成<create_storage_folder>` セクションを参照してください。
th: ในการอัปโหลดไฟล์ที่กำหนดแบบจำลอง (``model-definition.yml``) ไปยังโฟลเดอร์ประเภทแบบจำลอง คุณต้องสร้างโฟลเดอร์เสมือน เมื่อทำการสร้างโฟลเดอร์เสมือน ให้เลือกประเภท ``model`` แทนประเภทเริ่มต้น ``general`` โปรดดูที่หัวข้อ :ref:`การสร้างโฟลเดอร์เก็บข้อมูล<create_storage_folder>` ในหน้าข้อมูลและโฟลเดอร์เพื่อดูคำแนะนำในการสร้างโฟลเดอร์

source: Model type folder creation
ja: モデルタイプフォルダの作成
th: การสร้างโฟลเดอร์ประเภทโมเดล

source: Model definition file upload
ja: モデル定義ファイルのアップロード
th: อัปโหลดไฟล์นิยามโมเดล

source: Creating/Validating Model Service
ja: モデルサービスの作成/検証
th: การสร้าง/การตรวจสอบบริการโมเดล

source: Once the model definition file is uploaded to the virtual folder of the model type, you are ready to create the model service.
ja: モデル定義ファイルがモデルタイプの仮想フォルダにアップロードされると、モデルサービスを作成する準備が整います。
th: เมื่อไฟล์นิยามโมเดลถูกอัปโหลดไปยังโฟลเดอร์เสมือนของประเภทโมเดล คุณก็พร้อมที่จะสร้างบริการโมเดลแล้ว

source: Click the 'Start Service' button on the Model Serving page. This will bring up a page where you can enter the required settings for creating the service.
ja: モデル サービング ページで「サービス開始」ボタンをクリックします。これにより、サービスを作成するために必要な設定を入力できるページが表示されます。
th: คลิกที่ปุ่ม 'เริ่มบริการ' บนหน้า Model Serving จะนำคุณไปยังหน้าที่คุณสามารถกรอกการตั้งค่าที่จำเป็นสำหรับการสร้างบริการได้

source: Service launcher
ja: サービスランチャー
th: ตัวเรียกบริการ

source: First, provide a service name. For detailed explanations of each item, please refer to the following:
ja: まず、サービス名を提供します。それぞれの項目の詳細については、以下を参照してください。
th: แรกเริ่มให้ระบุชื่อบริการ สำหรับคำอธิบายรายละเอียดของแต่ละรายการ กรุณาอ้างอิงจากต่อไปนี้:

source: Open To Public: This option allows access to the model service without any separate token on the server where the service is to be hosted. By default, it is disabled.
ja: パブリックに公開: このオプションを使用すると、サービスをホストするサーバー上で、個別のトークンなしにモデルサービスへのアクセスが可能になります。デフォルトでは無効化されています。
th: เปิดให้สาธารณะ: ตัวเลือกนี้อนุญาตให้เข้าถึงบริการโมเดลโดยไม่ต้องมีโทเค็นแยกบนเซิร์ฟเวอร์ที่บริการจะถูกโฮสต์ โดยค่าเริ่มต้นจะถูกปิดใช้งาน

source: Model Storage To Mount: This is model folder to mount, which contains model definition file inside the directory.
ja: マウントするモデルストレージ: これはディレクトリ内にモデル定義ファイルを含むモデルフォルダーです。
th: ที่เก็บโมเดลสำหรับเมาท์: นี่คือโฟลเดอร์โมเดลที่จะเมาท์ซึ่งมีไฟล์นิยามโมเดลอยู่ภายในไดเรกทอรี

source: Inference Runtime Variant: This categorizes the type of models into four: ``vLLM``, ``NVIDIA NIM``, ``Predefined Image Command``, ``Custom``.
ja: 推論ランタイムバリアント: これはモデルのタイプを4つに分類します: ``vLLM``, ``NVIDIA NIM``, ``Predefined Image Command``, ``Custom``。
th: ประเภทของรันไทม์การอนุมาน: หมวดหมู่ของประเภทโมเดลแบ่งออกเป็นสี่ประเภท: ``vLLM``, ``NVIDIA NIM``, ``Predefined Image Command``, ``Custom``.

source: Runtime Variant
ja: ランタイムバリアント
th: ตัวแปรขณะทำงาน

source: For example, if you choose ``vLLM`` or ``NVIDIA NIM`` or ``Predefined Image Command`` as a runtime variant of model service, there's no need to configure a ``model-definition`` file in your model folder to mount. Instead, you might have to set an additional environment variable. For more information, please take a look at `Model Variant: Easily Serving Various Model Services <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_.
ja: 例えば、モデルサービスの実行時のバリアントとして ``vLLM`` や ``NVIDIA NIM`` または ``Predefined Image Command`` を選択した場合、マウントするためのモデルフォルダ内に ``model-definition`` ファイルを設定する必要はありません。その代わりに、追加の環境変数を設定する必要があるかもしれません。詳細については、`Model Variant: Easily Serving Various Model Services <https://www.backend.ai/blog/2024-07-10-various-ways-of-model-serving>`_ をご覧ください。

source: Model Destination For Model Folder: This option allows aliasing path of model storage path to session corresponding to routing, which represents the service. default value is ``/models``.
ja: モデルフォルダーのモデルの保存先: このオプションにより、サービスを表すルーティングに対応するセッションへのモデルストレージパスのエイリアスを設定できます。デフォルト値は``/models``です。
th: ปลายทางโมเดลสำหรับโฟลเดอร์โมเดล: ตัวเลือกนี้อนุญาตให้กำหนดชื่อทางเข้าสำหรับเส้นทางการจัดเก็บโมเดลไปยังเซสชันที่ตรงกับการกำหนดเส้นทาง ซึ่งแสดงถึงบริการ ค่าเริ่มต้นคือ ``/models``.

source: Model Definition File Path: You can also set model definition file as you uploaded in model storage path. The default value is ``model-definition.yaml``.
ja: モデル定義ファイルパス: モデルストレージパスにアップロードしたモデル定義ファイルを設定することもできます。デフォルトの値は ``model-definition.yaml`` です。
th: เส้นทางไฟล์การกำหนดโมเดล: คุณยังสามารถตั้งค่าไฟล์การกำหนดโมเดลตามที่คุณอัปโหลดในเส้นทางที่เก็บโมเดลได้ ค่าเริ่มต้นคือ ``model-definition.yaml``.

source: Additional Mounts: Likewise session, service provides additional mounts. Please make sure that only you can mount general/data usage mode folder, not additional model folder.
ja: 追加マウント: 同様にセッション、サービスは追加のマウントを提供します。一般/データ使用モードフォルダのみをマウントできるようにし、追加モデルフォルダをマウントできないようにしてください。
th: การเชื่อมต่อเพิ่มเติม: เช่นเดียวกับเซสชัน บริการให้การเชื่อมต่อเพิ่มเติม โปรดตรวจสอบให้แน่ใจว่าคุณสามารถเชื่อมต่อโฟลเดอร์โหมดการใช้งานทั่วไป/ข้อมูลเท่านั้น ไม่ใช่โฟลเดอร์โมเดลเพิ่มเติม

source: Desired Routing Count: This setting serves as the basis for determining the number of routing sessions to maintain for the current service. If you change the value of this setting, the manager can create a new replica session or terminate a running session by referring to the number of existing replica sessions.
ja: 希望ルーティング数: この設定は現在のサービスのために維持するルーティングセッションの数を決定する基準となります。この設定値を変更すると、マネージャーは既存のレプリカセッションの数を参照して新しいレプリカセッションを作成したり、実行中のセッションを終了したりできます。
th: จำนวนการกำหนดเส้นทางที่ต้องการ: การตั้งค่านี้เป็นพื้นฐานในการกำหนดจำนวนเซสชันการกำหนดเส้นทางที่ต้องรักษาสำหรับบริการปัจจุบัน หากคุณเปลี่ยนค่าของการตั้งค่านี้ ผู้จัดการสามารถสร้างเซสชันสำเนาใหม่หรือยุติเซสชันที่กำลังทำงานโดยการอ้างอิงถึงจำนวนเซสชันสำเนาที่มีอยู่

source: Then select a resource group. The resource group is a collection of resources that can be allocated to the model service.
ja: 次にリソースグループを選択します。リソースグループとは、モデルサービスに割り当てることができるリソースの集合です。
th: จากนั้นให้เลือกกลุ่มทรัพยากร กลุ่มทรัพยากรเป็นกลุ่มของทรัพยากรที่สามารถจัดสรรให้กับบริการโมเดลได้

source: Environment / Version: You can configure the execution environment for the dedicated server of the model service. Currently, even if the service has multiple routings, it will be executed in a single environment only. (Support for multiple execution environments will be added in a future update)
ja: 環境 / バージョン: モデルサービスの専用サーバーの実行環境を設定することができます。現在、サービスが複数のルーティングを持っていても、単一の環境でのみ実行されます。（複数の実行環境のサポートは、今後のアップデートで追加される予定です）
th: สภาพแวดล้อม / เวอร์ชัน: คุณสามารถกำหนดค่าบริการโมเดลสำหรับเซิร์ฟเวอร์ที่ทุ่มเทได้ ขณะนี้ แม้ว่าบริการจะมีเส้นทางหลายเส้นทาง แต่ก็จะถูกดำเนินการในสภาพแวดล้อมเดียวเท่านั้น (การสนับสนุนสำหรับสภาพแวดล้อมการดำเนินการหลายสภาพแวดล้อมจะถูกเพิ่มในอัปเดตในอนาคต)

source: Resource Presets: Allows you to select the amount of resources to allocate from the model service. Resource contains CPU, RAM, and AI accelerator, as known as GPU.
ja: リソースプリセット: モデルサービスから割り当てるリソースの量を選択できます。リソースには、CPU、RAM、AIアクセラレータ（GPUとして知られる）が含まれます。
th: การตั้งค่าค่าเฉลี่ยของทรัพยากร: ช่วยให้คุณเลือกจำนวนทรัพยากรที่จะจัดสรรจากบริการโมเดล ทรัพยากรประกอบด้วย CPU, RAM และตัวเร่งความเร็ว AI ซึ่งเรียกว่า GPU
