Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/statistics/statistics.po
Languages: ja, ko_kr, th

source: Statistics Page
ja: 統計ページ
ko_kr: Statistics 페이지
th: หน้าสถิติ

source: On the Statistics page, under the Allocation History tab, you can check simple statistics related to the use of compute sessions via a graph. You can check the statistics for a day or a week by selecting the usage period from the select period menu on the upper left. Displayed items are as follows.
ko_kr: 통계 페이지의 할당 기록 탭에서는 연산 세션 사용과 관련된 간단한 통계를 그래프로 확인할 수 있습니다. 좌측 상단의 기간 선택 메뉴에서 이용 기간을 선택하여 하루 또는 일주일 동안의 통계를 확인할 수 있습니다. 표시되는 항목은 다음과 같습니다.

source: Sessions: The number of compute sessions created.
ja: セッション: 作成されたコンピュートセッションの数。
ko_kr: Sessions: 생성된 연산 세션의 수입니다.
th: เซสชัน: จำนวนเซสชันการประมวลผลที่สร้างขึ้น。

source: CPU: The number of CPU cores allocated to the compute sessions.
ja: CPU: コンピュートセッションに割り当てられたCPUコアの数。
ko_kr: CPU: 연산 세션이 생성되면서 할당한 CPU 코어의 수입니다.
th: CPU: จำนวนของคอร์ CPU ที่จัดสรรให้กับเซสชันการคำนวณ

source: Memory: The amount of memory allocated to the compute sessions.
ja: メモリ: コンピュートセッションに割り当てられたメモリの量。
ko_kr: Memory: 연산 세션이 생성되면서 할당한 메모리의 양입니다.
th: หน่วยความจำ: ปริมาณหน่วยความจำที่จัดสรรให้กับเซสชันการประมวลผล。

source: GPU: The number of GPU units allocated to the compute sessions. If the Fractional GPU feature is enabled, it may not match the physics GPU.
ja: GPU: コンピュートセッションに割り当てられたGPUユニットの数。Fractional GPU機能が有効になっている場合、物理的なGPUと一致しないことがあります。
ko_kr: GPU: 연산 세션이 생성되면서 할당한 GPU 단위의 수입니다. Fractional GPU 기능이 작동하고 있을 경우, 물리 GPU 와 일치하지 않을 수 있습니다.
th: GPU: จำนวนหน่วย GPU ที่จัดสรรให้กับเซสชันการประมวลผล หากคุณสมบัติ GPU แบบเศษเสี้ยวถูกเปิดใช้งาน อาจไม่ตรงกับ GPU ทางฟิสิกส์

source: IO-Read: The amount of data read from the storage.
ja: IO-Read: ストレージから読み取られたデータの量。
ko_kr: IO-Read: 스토리지로부터 읽은 데이터의 양입니다.
th: IO-อ่าน: ปริมาณข้อมูลที่อ่านจากที่เก็บข้อมูล

source: IO-Write: The amount of data written to the storage.
ja: IO-Write: ストレージに書き込まれたデータの量。
ko_kr: IO-Write: 스토리지에 기록된 데이터의 양입니다.
th: IO-Write: ปริมาณข้อมูลที่เขียนลงในพื้นที่เก็บข้อมูล.

source: Note that the statistics shown here are based on terminated compute sessions. Also, one week statistics may not be shown for the users whose account is created no longer than a week.
ja: ここに表示されている統計は、終了したコンピュートセッションに基づいていることに注意してください。また、アカウントが作成されてから1週間以内のユーザーについては、1週間の統計が表示されない場合があります。
ko_kr: 여기에 나타나는 통계는 종료된 연산 세션을 기준으로 합니다. 또한, 가입 일주일 미만의 사용 자에게는 주간 통계 조회 메뉴가 출력되지 않을 수 있습니다.
th: โปรดทราบว่าสถิติที่แสดงที่นี่มีพื้นฐานมาจากเซสชันการคอมพิวเตอร์ที่สิ้นสุดแล้ว นอกจากนี้ สถิติหนึ่งสัปดาห์อาจไม่แสดงสำหรับผู้ใช้ที่บัญชีของพวกเขาถูกสร้างขึ้นไม่เกินหนึ่งสัปดาห์

source: In the User Session History tab of the Statistics page, users can view statistics on various resources used by sessions through graphs. Users can check the statistics for a selected period using the Select Period menu at the upper left. The displayed items are as follows.
ko_kr: 통계페이지의 사용자 세션 기록 탭에서는 세션이 사용한 다양한 자원에 대한 통계를 그래프로 확인할 수 있습니다.좌측 상단의 기간 선택 메뉴를 통해 선택한 기간 동안의 통계를 확인할 수 있습니다. 표시되는 항목은 다음과 같습니다.

source: CPU Util: The amount of CPU time used by the sessions.
ko_kr: CPU Util: 세션이 사용한 CPU 시간입니다.

source: Memory: The amount of memory used by the sessions.
ko_kr: Memory: 세션이 사용한 메모리의 양입니다.

source: Net Rx: The rate at which the container is receiving network data.
ko_kr: Net Rx: 컨테이너가 수신하고 있는 네트워크 데이터의 속도입니다.

source: Net Tx: The rate at which the container is sending network data.
ko_kr: Net Tx: 컨테이너가 전송하고 있는 네트워크 데이터의 속도입니다.

source: IO Read: The amount of data read from the storage by the sessions.
ko_kr: IO Read: 세션에 의해 스토리지로부터 읽은 데이터의 양입니다.

source: IO Write: The amount of data written to the storage by the sessions.
ko_kr: IO Write: 세션에 의해 스토리지로부터 기록된 데이터의 양입니다.

source: In addition, depending on the available resources, additional items such as CUDA-capable GPU Util and CUDA-capable GPU Mem may be displayed.
ko_kr: 사용가능한 자원에 따라 CUDA-capable GPU Util, CUDA-capable GPU Mem 와 같은 값들도 보여집니다.

source: More detailed statistics are shown in the admin-only Control-Panel.
ja: より詳細な統計情報は、管理者専用のコントロールパネルに表示されます。
ko_kr: 보다 자세한 통계 기능은 관리자 전용 Control-Panel에서 제공합니다.
th: ข้อมูลสถิติที่ละเอียดกว่านั้นจะแสดงในแผงควบคุมที่เฉพาะสำหรับผู้ดูแลระบบเท่านั้น

source: User Session History
ko_kr: 사용자 세션 기록

source: On the Statistics page, you can check simple statistics related to the use of compute sessions via a graph. You can check the statistics for a day or a week by selecting the usage period from the select period menu on the upper left. Displayed items are as follows.
ja: [統計]ページでは、グラフを通じてコンピュートセッションの使用に関連する簡単な統計を確認できます。左上の選択期間メニューから使用期間を選択することで、一日または一週間の統計を確認できます。表示される項目は以下の通りです。
th: ในหน้า สถิติ คุณสามารถตรวจสอบสถิติที่เกี่ยวข้องกับการใช้เซสชันการคอมพิวเตอร์ผ่านกราฟได้ คุณสามารถตรวจสอบสถิติสำหรับวันหนึ่งหรือสัปดาห์หนึ่งโดยการเลือกช่วงเวลาการใช้งานจากเมนูเลือกช่วงเวลาที่มุมซ้ายบน รายการที่แสดงมีดังนี้
