Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sftp_to_container/sftp_to_container.po
Languages: ja, ko, th

source: Selecting the host name will lead you to access the remote compute session. After you are connected, you will see an empty window. You can always refer to the Status bar to see which host you are connected to.
ja: ホスト名を選択すると、リモートコンピュートセッションにアクセスすることができます。接続後、空のウィンドウが表示されます。接続しているホストを確認するには、常にステータスバーを参照できます。
ko: 연결이 된 후 빈 창이 표시됩니다. 상태 표시 줄을 참조하면 연결된 호스트를 확인할 수 있습니다. 연결이 된 후 빈 창이 표시됩니다. 상태 표시 줄을 참조하면 연결된 호스트를 확인할 수 있습니다.
th: การเลือกชื่อโฮสต์จะนำคุณไปสู่การเข้าถึงเซสชันคอมพิวเตอร์ระยะไกล หลังจากที่คุณเชื่อมต่อแล้ว คุณจะเห็นหน้าต่างว่าง คุณสามารถอ้างอิงแถบสถานะเพื่อดูว่าเชื่อมต่อกับโฮสต์ใดอยู่เสมอ

source: Finished remote ssh connection
ja: リモートSSH接続が完了しました
th: เชื่อมต่อ SSH ระยะไกลเสร็จสิ้น

source: You can then open any folder or workspace on the remote host by accessing `File > Open...` or `File > Open Workspace...` menu just as you usually would do!
ja: その後、通常通りに `ファイル > 開く...` または `ファイル > ワークスペースを開く...` メニューにアクセスして、リモートホスト上の任意のフォルダまたはワークスペースを開くことができます！
ko: 로컬에서와 마찬가지로 `파일 > 열기...` 또는 `파일 > 워크스페이스 열기...` 메뉴를 통해 원격 호스트에서 폴더나 워크스페이스를 열 수 있습니다!
th: คุณสามารถเปิดโฟลเดอร์หรือพื้นที่ทำงานใด ๆ บนโฮสต์ระยะไกลได้โดยการเข้าถึงเมนู `File > Open...` หรือ `File > Open Workspace...` เช่นเดียวกับที่คุณทำตามปกติ!

source: open remote host file directory
ja: リモートホストのファイルディレクトリを開く
th: เปิดไดเรกทอรีไฟล์ของโฮสต์ระยะไกล

source: Establish SSH connection with Backend.AI client package
ja: Backend.AI クライアントパッケージを使用してSSH接続を確立する
ko: Backend.AI Client 패키지를 통해 SSH 접속하는 방법
th: ตั้งค่าการเชื่อมต่อ SSH กับแพ็คเกจลูกค้า Backend.AI

source: This document describes how to establish an SSH connection to a compute session in environments where a graphical user interface (GUI) cannot be used.
ja: このドキュメントでは、グラフィカルユーザーインターフェース (GUI) を使用できない環境で、計算セッションへのSSH接続を確立する方法について説明します。
ko: 이 문서에서는 GUI 환경 사용이 불가능한 곳에서 연산 세션으로 SSH를 접속하는 방법에 관해 설명합니다.
th: เอกสารนี้อธิบายวิธีการสร้างการเชื่อมต่อ SSH ไปยังเซสชันการคำนวณในสภาพแวดล้อมที่ไม่สามารถใช้ส่วนติดต่อผู้ใช้แบบกราฟิก (GUI) ได้

source: Typically, GPU nodes that runs compute sessions (containers) cannot be accessed directly from the outside. Therefore, in order to establish an SSH or sFTP connection to a compute session, a local proxy that creates a tunnel needs to be launched to relay the connection between the user and the session. Using the Backend.AI Client package, this process is relatively simple to configure.
ja: 通常、計算セッション（コンテナ）を実行するGPUノードは外部から直接アクセスすることはできません。したがって、計算セッションにSSHまたはsFTP接続を確立するためには、ユーザーとセッションの間で接続を中継するトンネルを作成するローカルプロキシを起動する必要があります。Backend.AI Clientパッケージを使用すれば、このプロセスは比較的簡単に設定できます。
ko: 일반적으로 연산 세션이 생성된 GPU 노드는 외부에서 직접 접속이 불가능합니다. 따라서 연산 세션에 SSH 또는 sFTP 접속을 하기 위해서는 사용자 머신과 GPU 노드에 생성된 연산 세션 사이의 터널을 중계하는 로컬 프록시가 필요합니다. Backend.AI Client 패키지를 활용하면 이 과정을 비교적 간단하게 설정할 수 있습니다.
th: โดยทั่วไปแล้ว โหนด GPU ที่เรียกใช้เซสชันการประมวลผล (คอนเทนเนอร์) จะไม่สามารถเข้าถึงได้โดยตรงจากภายนอก ดังนั้นเพื่อที่จะสร้างการเชื่อมต่อ SSH หรือ sFTP กับเซสชันการคอมพิวเตอร์ จะต้องเปิดใช้งานพร็อกซี่ท้องถิ่นที่สร้างอุโมงค์เพื่อส่งต่อการเชื่อมต่อระหว่างผู้ใช้และเซสชัน โดยใช้แพ็คเกจ Backend.AI Client ขั้นตอนนี้ค่อนข้างง่ายต่อการกำหนดค่า

source: Prepare Backend.AI Client package
ja: Backend.AI クライアントパッケージを準備します
ko: Backend.AI Client 패키지 사용 환경 구성
th: เตรียมแพ็คเกจ Backend.AI Client

source: Prepare with Docker image
ja: Dockerイメージで準備する
ko: Docker image를 이용한 구성
th: เตรียมพร้อมด้วย Docker image

source: The Backend.AI Client package is available as a Docker image. You can pull the image from the Docker Hub with the following command:
ja: Backend.AI クライアントパッケージは、Docker イメージとして利用できます。次のコマンドで Docker Hub からイメージをプルできます。
ko: Backend.AI Client 패키지를 도커 이미지로 다운로드할 수 있습니다. 다음 명령을 실행하여 Docker Hub에서 이미지를 다운로드할 수 있습니다:
th: แพ็คเกจ Backend.AI Client มีให้บริการในรูปแบบของภาพ Docker คุณสามารถดึงภาพจาก Docker Hub ด้วยคำสั่งต่อไปนี้:

source: The version of Backend.AI server can be found in "About Backend.AI" menu that appears when you click on the person icon on the top right corner of the Web UI.
ja: Backend.AIサーバーのバージョンは、Web UIの右上隅にある人のアイコンをクリックすると表示される「About Backend.AI」メニューで確認できます。
ko: Backend.AI 서버 버전은 Web UI의 우상단 사람 아이콘을 클릭하면 나오는 “Backend.AI에 대하여”에서 확인할 수 있습니다.
th: คุณสามารถค้นหาเวอร์ชันของเซิร์ฟเวอร์ Backend.AI ได้ในเมนู "เกี่ยวกับ Backend.AI" ที่ปรากฏเมื่อคุณคลิกที่ไอคอนคนที่มุมขวาบนของ Web UI

source: Run the Docker image with the following command:
ja: 次のコマンドでDockerイメージを実行します。
ko: 다운 받은 이미지를 다음 명령으로 실행합니다.
th: เรียกใช้ภาพ Docker ด้วยคำสั่งต่อไปนี้:

source: Check if ``backend.ai`` command is available in the container. If it is available, the help message will be displayed.
ja: コンテナ内で ``backend.ai`` コマンドが利用可能かどうかを確認します。利用可能な場合、ヘルプメッセージが表示されます。
ko: ``backend.ai`` 명령이 존재하는지 확인합니다. 정상적으로 진행되었다면 도움말이 출력됩니다.
th: ตรวจสอบว่าเคอร์เนลคำสั่ง ``backend.ai`` พร้อมใช้งานในคอนเทนเนอร์หรือไม่ ถ้ามี คำแนะนำจะถูกแสดงขึ้น

source: Prepare directly from host with a Python virtual environment
ja: ホストから直接Python仮想環境で準備する
ko: Python 가상환경을 통해 호스트에서 사용 환경 구성하기
th: เตรียมจากโฮสต์โดยตรงด้วยสภาพแวดล้อมเสมือน Python

source: If you cannot or do not want to use Docker, you can install the Backend.AI Client package directly on your host machine. Prerequisites are:
ja: Dockerを使用できない、または使用したくない場合は、ホストマシンにBackend.AIクライアントパッケージを直接インストールできます。必要条件は次のとおりです。
ko: Docker를 사용할 수 없거나 사용하고 싶지 않다면, 호스트 머신에 Backend.AI Client 패키지를 직접 설치할 수도 있습니다. 사전 요구 사항은 다음과 같습니다:
th: หากคุณไม่สามารถหรือไม่ต้องการใช้ Docker คุณสามารถติดตั้งแพ็คเกจ Backend.AI Client โดยตรงบนเครื่องโฮสต์ของคุณ ข้อกำหนดเบื้องต้นคือ:

source: The required version of Python may vary depending on the Backend.AI Client version. You can check the compability matrix at https://github.com/lablup/backend.ai#python-version-compatibility.
ja: 必要なPythonのバージョンは、Backend.AI Clientのバージョンによって異なる場合があります。互換性マトリックスは、https://github.com/lablup/backend.ai#python-version-compatibility で確認できます。
ko: Python 버전은 Backend.AI Client 버전에 따라 바뀝니다. https://github.com/lablup/backend.ai#python-version-compatibility 페이지에서 호환 매트릭스를 확일할 수 있습니다.
th: เวอร์ชันของ Python ที่ต้องการอาจแตกต่างกันไปขึ้นอยู่กับเวอร์ชันของ Backend.AI Client คุณสามารถตรวจสอบตารางความเข้ากันได้ได้ที่ https://github.com/lablup/backend.ai#python-version-compatibility.

source: ``clang`` compiler might be needed
ja: ``clang`` コンパイラが必要になる場合があります
ko: ``clang`` 컴파일러 설치가 필요할 수 있습니다
th: อาจต้องใช้คอมไพเลอร์ ``clang``

source: ``zstd`` package might be needed if you are using ``indygreg`` Python binary.
ja: ``indygreg`` Python バイナリを使用している場合、``zstd`` パッケージが必要になるかもしれません。
ko: ``indygred`` Python 바이너리를 사용하는 경우 ``zstd`` 패키지를 미리 설치해야합니다.
th: แพ็คเกจ ``zstd`` อาจจะจำเป็นถ้าคุณกำลังใช้ไบนารี Python ``indygreg``

source: It is recommended to use a Python virtual environment to install the packages. One way is to use the statically-built Python binary from the ``indygreg`` repository. Download the binary that matches your local machine architecture from the following page and unzip it.
ja: パッケージをインストールするためには、Python仮想環境を使用することをお勧めします。1つの方法としては、``indygreg`` リポジトリーの静的にビルドされたPythonバイナリを使用することです。以下のページから、ローカルマシンのアーキテクチャに合ったバイナリをダウンロードし、解凍します。
ko: Client 패키지 설치를 위해 별도의 Python 가상 환경 사용을 권장합니다. 한 가지 방법은 ``indygreg`` 저장소에 있는 정적 빌드된 Python 바이너리를 사용하는 것입니다. 다음 사이트에서 Client 패키지를 설치할 머신 아키텍처에 맞는 Python 바이너리를 다운로드한 후 압축을 해제합니다.
th: แนะนำให้ใช้สภาพแวดล้อมเสมือน Python เพื่อติดตั้งแพ็คเกจ วิธีหนึ่งคือการใช้ไบนารี Python ที่สร้างขึ้นแบบนิ่งจากที่เก็บ ``indygreg`` ดาวน์โหลดไบนารีที่ตรงกับสถาปัตยกรรมเครื่องท้องถิ่นของคุณจากหน้าต่อไปนี้และทำการแตกไฟล์ออก

source: If you are using a popular x86-based Ubuntu environment, you can download and extract it as follows:
ja: 人気のあるx86ベースのUbuntu環境を使用している場合は、次のようにダウンロードして抽出できます。
ko: 대중적으로 많이 사용되는 x86 기반 Ubuntu 환경이라면 다음과 같이 다운로드 할 수 있습니다:
th: หากคุณกำลังใช้สภาพแวดล้อม Ubuntu ที่ใช้สถาปัตยกรรม x86 ที่นิยม คุณสามารถดาวน์โหลดและแตกไฟล์ได้ดังนี้:

source: After unarchiving the binary, ``python`` directory will be created under the current directory. You can check the version of the downloaded Python by running the following command.
ja: バイナリを解凍すると、カレントディレクトリの下に ``python`` ディレクトリが作成されます。次のコマンドを実行して、ダウンロードされたPythonのバージョンを確認できます。
ko: 압축을 풀면 현재 디렉토리 하위에 ``python`` 디렉토리가 생길 것입니다. 다음 명령을 실행하여 다운로드 한 파이썬의 버전을 확인할 수 있습니다.
th: หลังจากที่คุณทำการแตกไฟล์ไบนารีแล้ว จะมีไดเรกทอรี ``python`` ถูกสร้างขึ้นภายใต้ไดเรกทอรีปัจจุบัน คุณสามารถตรวจสอบเวอร์ชันของ Python ที่ดาวน์โหลดได้โดยการรันคำสั่งต่อไปนี้

source: To avoid affecting other Python environments on the system, it is recommended to create a separate Python virtual environment. When you run the following command, a Python virtual environment will be created under the directory ``.venv.``.
ja: システム上の他のPython環境に影響を与えないようにするため、別のPython仮想環境を作成することをお勧めします。次のコマンドを実行すると、ディレクトリ ``.venv`` の下にPython仮想環境が作成されます。
ko: 시스템의 다른 파이썬 환경에 영향을 주지 않기 위해 사용자 머신에 독립적인 Python 3.10 가상 환경을 생성합니다. 다음 명령 실행 시 ``.venv`` 디렉토리에 Python 가상 환경이 생성됩니다.
th: เพื่อหลีกเลี่ยงการกระทบต่อสภาพแวดล้อม Python อื่น ๆ ในระบบ แนะนำให้สร้างสภาพแวดล้อม Python แยกต่างหาก เมื่อคุณรันคำสั่งต่อไปนี้ สภาพแวดล้อม Python จะถูกสร้างขึ้นในไดเรกทอรี ``.venv.``

source: Activate the virtual environment. Since a new virtual environment has been activated, only the ``pip`` and ``setuptools`` packages will be installed when you run the ``pip list`` command.
ja: 仮想環境をアクティブにします。新しい仮想環境がアクティブになったため、``pip list`` コマンドを実行すると、``pip`` および ``setuptools`` パッケージのみがインストールされます。
ko: 생성한 Python 가상환경을 활성화 합니다. 새로운 가상 환경을 활성화한 것이므로, ``pip list`` 명령 실행 시 ``pip`` 과 ``setuptools`` 패키지만 설치되어 있을 것입니다.
th: เปิดใช้งานสภาพแวดล้อมเสมือน เนื่องจากสภาพแวดล้อมเสมือนใหม่ได้ถูกเปิดใช้งานแล้ว แพ็คเกจ ``pip`` และ ``setuptools`` เท่านั้นที่จะถูกติดตั้งเมื่อคุณรันคำสั่ง ``pip list``

source: Now, install the Backend.AI Client package. Install the client package according to the server version. Here, we assume that the version is 23.09. If an installation-related error occurs with the ``netifaces`` package, you may need to lower the versions of ``pip`` and ``setuptools``. Check if the ``backend.ai`` command is available.
ja: 次に、Backend.AI クライアントパッケージをインストールします。クライアントパッケージはサーバーバージョンに応じてインストールしてください。ここでは、バージョンが23.09であると仮定します。``netifaces`` パッケージに関連するインストールエラーが発生した場合、``pip`` と ``setuptools`` のバージョンを下げる必要があるかもしれません。``backend.ai`` コマンドが利用可能かどうか確認してください。
ko: Backend.AI Client 패키지를 설치합니다. 서버팜에 설치된 서버 버전에 맞추어 클라이언트 패키지를 설치합니다. 여기서는 23.09 버전이라고 가정합니다. 만약, ``netifaces`` 라는 패키지 설치 관련 오류가 발생하는 경우, ``pip`` 과 ``setuptools`` 의 버전을 낮추어야할 수도 있습니다.
th: ตอนนี้ติดตั้งแพ็คเกจ Backend.AI Client ติดตั้งแพ็คเกจลูกค้าตามเวอร์ชันของเซิร์ฟเวอร์ ที่นี่เราคาดว่าเวอร์ชันคือ 23.09 หากเกิดข้อผิดพลาดที่เกี่ยวข้องกับการติดตั้งกับแพ็คเกจ ``netifaces`` คุณอาจต้องลดเวอร์ชันของ ``pip`` และ ``setuptools`` ตรวจสอบว่าคำสั่ง ``backend.ai`` ใช้งานได้หรือไม่

source: Setting up server connection for CLI
ja: CLIのためのサーバー接続の設定
ko: CLI 클라이언트에서 서버 접속 설정
th: การตั้งค่าเชื่อมต่อเซิร์ฟเวอร์สำหรับ CLI

source: Create a ``.env`` file and add the following content. Use the same address for ``webserver-url`` that you use to connect to the Web UI service from your browser.
ja: `.env` ファイルを作成し、次の内容を追加します。ブラウザから Web UI サービスに接続するために使用するのと同じアドレスを `webserver-url` で使用してください。
ko: ``.env`` 파일을 만들고 다음과 같이 내용을 추가합니다. ``webserver-url`` 에는 브라우저에서 Web UI 서비스로 접속할 때 사용하는 주소를 동일하게 씁니다.
th: สร้างไฟล์ ``.env`` และเพิ่มเนื้อหาดังต่อไปนี้ ใช้ที่อยู่เดียวกันสำหรับ ``webserver-url`` ที่คุณใช้เชื่อมต่อกับบริการ Web UI จากเว็บเบราว์เซอร์ของคุณ

source: Run the following CLI command to connect to the server. Enter the email and password that you use to log in from your browser. If everything goes well, you will see the message ``Login succeeded``.
ja: 以下のCLIコマンドを実行してサーバーに接続します。ブラウザからログインする際に使用するメールアドレスとパスワードを入力してください。すべてが正常に行われると、``Login succeeded`` というメッセージが表示されます。
ko: 다음 CLI 명령을 실행하여 서버에 연결합니다. 브라우저에서 로그인할 때 사용하는 이메일과 비밀번호를 입력합니다. 정상적으로 실행된 경우 ``Login succeeded.`` 메시지가 뜹니다.
th: รันคำสั่ง CLI ต่อไปนี้เพื่อเชื่อมต่อกับเซิร์ฟเวอร์ ป้อนอีเมลและรหัสผ่านที่คุณใช้ในการเข้าสู่ระบบจากเบราว์เซอร์ของคุณ หากทุกอย่างเป็นไปด้วยดี คุณจะเห็นข้อความ ``Login succeeded``

source: SSH/SCP Connection to Computation Session
ja: SSH/SCP接続による計算セッション
ko: 연산 세션에 SSH/SCP 접속
th: การเชื่อมต่อ SSH/SCP กับเซสชันการคำนวณ

source: Create a compute session from the browser by mounting the folder where you want to copy the data. You can create the session using CLI as well, but for convenience, let's assume that you have created it from the browser. Remember the name of the created compute session. Here, we assume it is ``ibnFmWim-session``.
ja: データをコピーしたいフォルダーをマウントして、ブラウザからコンピュートセッションを作成します。CLIを使ってセッションを作成することもできますが、ここでは便宜上、ブラウザから作成したと仮定します。作成したコンピュートセッションの名前を覚えておいてください。ここでは、``ibnFmWim-session`` と仮定します。
ko: 브라우저에서 데이터를 복사할 폴더를 마운트 한 후 연산 세션을 생성합니다. CLI로도 생성 가능하지만 편의를 위해 브라우저에서 생성한다고 하겠습니다. 생성된 연산 세션의 이름을 알아둡니다. 여기서는 ``ibnFmWim-session`` 라고 가정합니다.
th: สร้างเซสชันการประมวลผลจากเบราว์เซอร์โดยการเพิ่มไดเรกทอรีที่คุณต้องการคัดลอกข้อมูล คุณสามารถสร้างเซสชันโดยใช้ CLI ได้เช่นกัน แต่เพื่อความสะดวก ให้สมมติว่าคุณได้สร้างจากเบราว์เซอร์ จำชื่อเซสชันการประมวลผลที่สร้างขึ้น ที่นี่เราสมมติว่าเป็น ``ibnFmWim-session``.

source: If you simply want to SSH, execute the following command:
ja: 単にSSHを実行したい場合は、次のコマンドを実行します。
ko: 단순히 SSH 접속을 하고자 하는 경우에는 다음과 같은 명령을 실행하면 됩니다.
th: หากคุณต้องการใช้ SSH เพียงแค่รันคำสั่งต่อไปนี้:

source: If you want to download the SSH key file and explicitly run the ssh command, you need to first run the following command to launch a local proxy service that relays connection from the local machine to the computation session. You can specify the port (9922) to use on the local machine with the b option.
ja: SSHキーファイルをダウンロードしてsshコマンドを明示的に実行したい場合、最初に次のコマンドを実行して、ローカルマシンから計算セッションへの接続を中継するローカルプロキシサービスを起動する必要があります。ローカルマシンで使用するポート(9922)はbオプションで指定できます。
ko: SSH 키 파일을 받아 ``ssh`` 명령을 명시적으로 실행하고자 하는 경우에는 먼저 다음과 같은 명령을 실행하여 로컬 머신에서 연산 세션으로 접속을 중계하는 로컬 프록시 서비스를 띄워야 합니다. ``-b`` 옵션으로 로컬 머신에서 사용할 포트(9922)를 지정할 수 있습니다.
th: หากคุณต้องการดาวน์โหลดไฟล์คีย์ SSH และเรียกใช้คำสั่ง ssh อย่างชัดเจน คุณต้องรันคำสั่งต่อไปนี้ก่อนเพื่อเปิดบริการพร็อกซี่ในเครื่องที่ช่วยส่งต่อการเชื่อมต่อจากเครื่องท้องถิ่นไปยังเซสชันการคำนวณ คุณสามารถกำหนดพอร์ต (9922) ที่จะใช้ในเครื่องท้องถิ่นด้วยตัวเลือก b ได้

source: Open another terminal window on your local machine. Move to the working directory where the ``.env`` file is located, and download the SSH key automatically generated in the compute session.
ja: ローカルマシンで別のターミナルウィンドウを開きます。``.env`` ファイルがある作業ディレクトリに移動し、計算セッションで自動生成されたSSHキーをダウンロードします。
ko: 로컬 머신에서 다른 터미널 창을 띄웁니다. ``.env`` 파일이 있는 작업 디렉토리로 이동한 후 연산 세션에서 자동 생성된 SSH 키를 다운로드 합니다.
th: เปิดหน้าต่างเทอร์มินัลอีกอันบนเครื่องของคุณ ย้ายไปยังไดเรกทอรีที่เก็บไฟล์ ``.env`` และดาวน์โหลดคีย์ SSH ที่ถูกสร้างขึ้นโดยอัตโนมัติในเซสชันการคอมพิวเตอร์

source: You can use the downloaded key to SSH as follows. Since you launched the local proxy on port 9922, the connection address should be 127.0.0.1 and the port should be 9922. Use the user account ``work`` for the connection.
ja: ダウンロードしたキーを使用してSSHするには、以下の通りです。ローカルプロキシをポート9922で起動したので、接続アドレスは127.0.0.1、ポートは9922にする必要があります。接続にはユーザーアカウント ``work`` を使用します。
ko: 다운로드 한 키를 이용해서 SSH 접속을 다음과 같이 할 수 있습니다. 9922번에 로컬 프록시 포트를 띄웠으므로 접속 주소는 ``127.0.0.1``, 포트는 ``9922`` 를 지정해야 합니다. 접속 사용자 계정은 ``work`` 로 사용하십시오.
th: คุณสามารถใช้กุญแจที่ดาวน์โหลดมาเพื่อ SSH ได้ตามนี้ เนื่องจากคุณได้เปิดพร็อกซี่ท้องถิ่นที่พอร์ต 9922 ที่อยู่การเชื่อมต่อควรเป็น 127.0.0.1 และพอร์ตควรเป็น 9922 ใช้บัญชีผู้ใช้ ``work`` สำหรับการเชื่อมต่อ

source: Similarly, you can use the ``scp`` command to copy files. In this case, you should copy the files to the mounted folder within the compute session to preserve them even after the session has been terminated.
ja: 同様に、ファイルをコピーするために ``scp`` コマンドを使用することができます。この場合、コンピュートセッションが終了した後でもファイルを保持するために、ファイルをマウントされたフォルダにコピーする必要があります。
ko: 마찬가지로 ``scp`` 명령을 사용하여 파일을 복사할 수 있습니다. 이 때, 연산 세션 내 마운트 된 폴더로 파일을 복사해야 연산 세션이 종료되었을 때에도 파일을 보존할 수 있습니다.
th: เช่นเดียวกัน คุณสามารถใช้คำสั่ง ``scp`` เพื่อคัดลอกไฟล์ ในกรณีนี้ คุณควรคัดลอกไฟล์ไปยังโฟลเดอร์ที่เชื่อมต่อภายในเซสชันการคอมพิวเตอร์เพื่อรักษาไฟล์ไว้แม้หลังจากเซสชันนั้นสิ้นสุดลง

source: When all the tasks are completed, press ``Ctrl-C`` on the first terminal to cancel the local proxy service.
ja: すべてのタスクが完了したら、最初のターミナルで ``Ctrl-C`` を押してローカルプロキシサービスをキャンセルします。
ko: 모든 작업이 끝난 경우에는 첫 번째 터미널에서 ``Ctrl-C`` 를 눌러 로컬 프록시 서비스를 종료합니다.
th: เมื่อทำงานทั้งหมดเสร็จสิ้นแล้ว ให้กด ``Ctrl-C`` บนเทอร์มินัลแรกเพื่อตัดบริการพร็อกซีในเครื่องออก
