Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sftp_to_container/sftp_to_container.po
Languages: ja, ko, th

source: SSH/SFTP Connection to a Compute Session
ja: SSH/SFTP によるコンピュートセッションへの接続
ko: 연산 세션에 SSH/SFTP 접속하기 (Linux/Mac/Visual Studio Code)
th: การเชื่อมต่อ SSH/SFTP ไปยังเซสชันการคอมพิวเตอร์

source: Backend.AI supports SSH/SFTP connection to the created compute sessions (containers). In this section, we will learn how to do it.
ja: Backend.AIは、作成したコンピュートセッション（コンテナ）へのSSH/SFTP接続をサポートしています。このセクションでは、その方法を学びます。
ko: Backend.AI는 생성된 연산 세션(컨테이너)에 SSH/SFTP 접속을 지원하고 있습니다. 이번 절에서는 그 방법에 관해 알아봅니다.
th: Backend.AI สนับสนุนการเชื่อมต่อ SSH/SFTP ไปยังเซสชันการคอมพิวเตอร์ที่สร้างขึ้น (คอนเทนเนอร์) ในส่วนนี้เราจะเรียนรู้วิธีทำเช่นนั้น

source: From 24.03 SSH/SFTP connection feature is available in both Web browser and WebUI Desktop application. When the version is 23.09 or lower version, you need to use WebUI Desktop app. Desktop app can be downloaded a panel from the Summary page. Using this panel, the compatible version will be downloaded automatically.
ja: 24.03からSSH/SFTP接続機能がウェブブラウザとWebUIデスクトップアプリケーションの両方で利用可能です。バージョンが23.09以下の場合、WebUIデスクトップアプリを使用する必要があります。デスクトップアプリはサマリーページのパネルからダウンロードできます。このパネルを使用すると、互換性のあるバージョンが自動的にダウンロードされます。
ko: 24.03 버전부터 연산세션에 SSH/sFTP 접속하는 기능을 웹 기반 Web UI와 데스크탑 앱에서 모두 지원합니다.현재 버전이 23.09 이거나 그 이전 버전일 경우, 데스크탑 앱에서만 해당 기능을 지원합니다.데스크탑 앱은 Summary 페이지의 별도 다운로드 패널에서 다운로드할 수 있습니다. 이 패널에서 다운로드하는 경우에는 호환 버전을 자동으로 다운로드 합니다.
th: ตั้งแต่ 24.03 ฟีเจอร์การเชื่อมต่อ SSH/SFTP มีให้ใช้งานทั้งในเบราว์เซอร์และแอปพลิเคชัน WebUI บนเดสก์ท็อป เมื่อตัวเวอร์ชันคือ 23.09 หรือต่ำกว่า คุณจำเป็นต้องใช้แอปพลิเคชัน WebUI บนเดสก์ท็อป แอปพลิเคชันเดสก์ท็อปสามารถดาวน์โหลดได้จากแผงในหน้าสรุป โดยใช้แผงนี้จะดาวน์โหลดเวอร์ชันที่เข้ากันได้โดยอัตโนมัติ

source: You can also download the app from https://github.com/lablup/backend.ai-webui/releases. Make sure to download the compatible version of the Web-UI in this case. You can check the Web-UI version by clicking on the "About Backend.AI" sub-menu located in the preference menu on the upper-right side of the GUI.
ja: https://github.com/lablup/backend.ai-webui/releases からアプリをダウンロードすることもできます。この場合、互換性のあるバージョンのWeb-UIをダウンロードするようにしてください。GUIの右上にある設定メニューの「About Backend.AI」サブメニューをクリックして、Web-UIのバージョンを確認できます。
ko: 데스크탑 앱은 https://github.com/lablup/backend.ai-webui/releases 에서도 수동 다운로드 할 수 있습니다. 이 경우에는 Backend.AI 클러스터 서버 버전과 호환되는 Web-UI 앱을 받아야 최상의 호환성을 유지할 수 있습니다. Backend.AI 클러스터의 버전은 GUI 우측 상단에 있는 설정 아이콘을 클릭하면 나오는 “About Backend.AI” 메뉴를 클릭하여 확인할 수 있습니다.
th: คุณยังสามารถดาวน์โหลดแอปได้ที่ https://github.com/lablup/backend.ai-webui/releases โปรดตรวจสอบให้แน่ใจว่าดาวน์โหลดเวอร์ชันที่เข้ากันได้ของ Web-UI ในกรณีนี้ คุณสามารถตรวจสอบเวอร์ชันของ Web-UI ได้โดยการคลิกที่เมนูย่อย "เกี่ยวกับ Backend.AI" ที่อยู่ในเมนูการตั้งค่าที่มุมขวาบนของ GUI

source: For Linux / Mac
ja: Linux / Mac 用
ko: Linux / Mac 환경
th: สำหรับ Linux / Mac

source: First, create a compute session, then click the app icon (first button) in Control, followed by SSH / SFTP icon. Then, a daemon that allows SSH/SFTP access from inside the container will be initiated, and the Web-UI app interacts with the daemon through a local proxy service.
ja: まず、計算セッションを作成し、コントロール内のアプリアイコン（最初のボタン）をクリックし、その後にSSH/SFTPアイコンをクリックします。すると、コンテナ内部からのSSH/SFTPアクセスを許可するデーモンが起動し、Web-UIアプリはローカルプロキシサービスを通じてデーモンと対話します。
ko: 먼저 연산 세션을 하나 생성한 후 Control의 앱 아이콘(첫 번째 버튼)을 클릭하고 SSH / SFTP 아이콘을 클릭합니다. 그러면 해당 컨테이너 내부에서 SSH/SFTP 접속을 할 수 있도록 해주는 데몬(demon)이 뜨게 되고, 로컬 proxy를 통해 Web-UI 앱과 컨테이너 내부의 데몬이 연결됩니다.
th: ก่อนอื่น สร้างเซสชันการคอมพิวเตอร์ จากนั้นคลิกที่ไอคอนแอป (ปุ่มแรก) ใน Control ตามด้วยไอคอน SSH / SFTP หลังจากนั้นจะมีการเริ่มต้น daemon ที่อนุญาตให้เข้าถึง SSH/SFTP จากภายในคอนเทนเนอร์ และแอป Web-UI จะทำงานร่วมกับ daemon ผ่านบริการพร็อกซีภายในท้องถิ่น

source: You cannot establish a SSH/SFTP connection to the session until you click the SSH/SFTP icon. When you close the Web-UI app and launch it again, the connection between the local proxy and the Web-UI app is initialized, so the SSH/SFTP icon must be clicked again.
ja: SSH/SFTP接続は、SSH/SFTPアイコンをクリックするまで、セッションに対して確立できません。Web-UIアプリを閉じて再度起動すると、ローカルプロキシとWeb-UIアプリ間の接続が初期化されるため、再度SSH/SFTPアイコンをクリックする必要があります。
ko: 이 아이콘을 클릭하기 전에는 해당 세션에 SSH/SFTP 접속을 할 수가 없습니다. 만약, Web-UI 앱을 껐다가 다시 켜게 되면 로컬 proxy와 Web-UI 앱 사이의 연결이 초기화 되므로 SSH/SFTP 아이콘을 다시 한 번 클릭해주어야 합니다.
th: คุณไม่สามารถสร้างการเชื่อมต่อ SSH/SFTP ไปยังเซสชันจนกว่าคุณจะคลิกที่ไอคอน SSH/SFTP เมื่อคุณปิดแอป Web-UI และเปิดใหม่อีกครั้ง การเชื่อมต่อระหว่างพร็อกซีท้องถิ่นและแอป Web-UI จะถูกสร้างขึ้นใหม่ ดังนั้นจึงต้องคลิกที่ไอคอน SSH/SFTP อีกครั้ง

source: Next, a dialog containing SSH/SFTP connection information will be pop up. Remember the address (especially the assigned port) written in the SFTP URL and click the download link to save the ``id_container`` file on the local machine. This file is an automatically generated SSH private key. Instead of using the link, you can also download the ``id_container`` file located under ``/home/work/`` with your web terminal or Jupyter Notebook. The auto-generated SSH key may change when new session is created. In that case, it must be downloaded again.
ja: 次に、SSH/SFTP接続情報を含むダイアログが表示されます。SFTP URLに書かれているアドレス（特に割り当てられたポート）を覚えておいて、ダウンロードリンクをクリックし、``id_container`` ファイルをローカルマシンに保存します。このファイルは自動生成されたSSH秘密鍵です。このリンクを使用する代わりに、WebターミナルやJupyter Notebookを使用して、``/home/work/`` にある ``id_container`` ファイルをダウンロードすることもできます。新しいセッションが作成されると、自動生成されたSSHキーは変更される場合があります。その場合、再度ダウンロードする必要があります。
ko: 이어 SSH/SFTP connection 정보를 담고 있는 다이얼로그가 뜨는데, SSH URL에 적힌 접속 주소(특히 할당 받은 포트)를 기억한 뒤 ``id_container`` 파일 다운로드 링크를 클릭하여 로컬 머신에 받아 둡니다. 이 파일은 자동으로 생성된 SSH private key입니다. 링크를 통해 다운로드하는 대신 터미널 또는 Jupyter Notebook으로 ``/home/work/`` 하위에 위치하고 있는 ``id_container`` 파일을 다운로드 할 수도 있습니다. 자동 생성된 SSH key는 세션이 새로 생성될 때마다 변할 수도 있는데, 이럴 경우 다시 다운로드 받아야 합니다.
th: ถัดไปจะมีหน้าต่างแสดงข้อมูลการเชื่อมต่อ SSH/SFTP ปรากฏขึ้น จำที่อยู่ (โดยเฉพาะพอร์ตที่กำหนด) ที่เขียนใน URL SFTP และคลิกที่ลิงก์ดาวน์โหลดเพื่อบันทึกไฟล์ ``id_container`` บนเครื่องท้องถิ่น ไฟล์นี้เป็นคีย์ส่วนตัว SSH ที่สร้างขึ้นโดยอัตโนมัติ แทนที่จะใช้ลิงก์ คุณยังสามารถดาวน์โหลดไฟล์ ``id_container`` ที่อยู่ภายใต้ ``/home/work/`` ด้วยเทอร์มินัลเว็บหรือ Jupyter Notebook คีย์ SSH ที่สร้างขึ้นโดยอัตโนมัติอาจเปลี่ยนแปลงเมื่อมีการสร้างเซสชันใหม่ ในกรณีนั้นจะต้องดาวน์โหลดอีกครั้ง

source: Starting SSH/SFTP daemon inside a compute session (container)
ja: コンピュートセッション（コンテナ）内でSSH/SFTPデーモンを起動
ko: 연산 세션에 SSH/SFTP 접속하기 (Linux/Mac/Visual Studio Code)
th: เริ่มต้น SSH/SFTP daemon ภายในเซสชันคอมพิวเตอร์ (คอนเทนเนอร์)

source: To SSH connect to the compute session with the downloaded SSH private key, you run the following command in the shell environment. You should write the path to the downloaded ``id_container`` file after ``-i`` option and the assigned port number after ``-p`` option. The user inside the compute session is usually set to ``work``, but if your session uses other account, the ``work`` part in ``work@127.0.0.1`` should be changed to the actual session account. If you run the command correctly, you can see that SSH connection is made to the compute session and you are welcomed by the container's shell environment.
ja: ダウンロードしたSSH秘密鍵を使ってコンピュートセッションにSSH接続するには、シェル環境で以下のコマンドを実行します。``-i`` オプションの後にダウンロードした ``id_container`` ファイルへのパスを、``-p`` オプションの後に割り当てられたポート番号を記述します。コンピュートセッション内のユーザーは通常 ``work`` に設定されていますが、セッションが他のアカウントを使用している場合、``work@127.0.0.1`` の ``work`` 部分を実際のセッションアカウントに変更する必要があります。コマンドを正しく実行すると、SSH接続がコンピュートセッションに対して行われ、コンテナのシェル環境に歓迎されていることが確認できます。
ko: 다운로드 받은 SSH private key로 연산 세션에 SSH 접속을 하려면 쉘 환경에서 다음과 같은 명령을 내릴 수 있습니다. 이 때 ``-i`` 옵션에 다운로드 받은 ``id_container`` 파일의 위치를, ``-p`` 옵션에 연산 세션이 할당 받은 포트 번호를 적어주어야 합니다. 연산 세션 내의 사용자는 보통 ``work`` 로 설정되는데, 만약 ``work`` 가 아닌 다른 계정을 사용하는 경우라면 ``work@127.0.0.1`` 에서 ``work`` 부분을 실제 접속되는 계정으로 바꾸어 주어야 합니다. 정상적으로 명령을 내렸다면 연산 세션에 SSH 접속이 이루어지고 컨테이너 내부의 쉘 환경에 접속되는 것을 확인할 수 있습니다.
th: ในการเชื่อมต่อ SSH กับเซสชันการคอมพิวเตอร์ด้วยคีย์ส่วนตัว SSH ที่ดาวน์โหลดมา คุณจะต้องรันคำสั่งต่อไปนี้ในสภาพแวดล้อมของเชลล์ คุณควรเขียนเส้นทางไปยังไฟล์ ``id_container`` ที่ดาวน์โหลดมาไว้หลังตัวเลือก ``-i`` และหมายเลขพอร์ตที่กำหนดไว้หลังตัวเลือก ``-p`` ผู้ใช้ภายในเซสชันการคอมพิวเตอร์มักจะถูกตั้งค่าเป็น ``work`` แต่หากเซสชันของคุณใช้บัญชีอื่น ส่วน ``work`` ใน ``work@127.0.0.1`` จะต้องเปลี่ยนเป็นบัญชีเซสชันจริง ถ้าคุณรันคำสั่งได้ถูกต้อง คุณจะเห็นว่าการเชื่อมต่อ SSH ถูกสร้างขึ้นกับเซสชันการคอมพิวเตอร์และคุณจะถูกต้อนรับโดยสภาพแวดล้อมเชลล์ของคอนเทนเนอร์

source: Connecting by SFTP would almost be the same. After running the SFTP client and setting public key-based connection method, simply specify ``id_container`` as the SSH private key. Each FTP client may adopt different way, so refer to each FTP client manual for details.
ja: SFTPによる接続もほとんど同じです。SFTPクライアントを実行し、公用鍵ベースの接続方法を設定した後、単純にSSHプライベートキーとして ``id_container`` を指定します。それぞれのFTPクライアントは異なる方法を採用する場合があるので、各FTPクライアントのマニュアルを参照してください。
ko: SFTP 접속을 하는 방법도 거의 같습니다. SFTP 클라이언트를 실행하고 public key 기반의 접속 설정을 한 후 ``id_container`` 를 SSH private key로 지정하면 됩니다. FTP 클라이언트 별로 사용 방법은 상이할 수 있으므로, 자세한 방법은 각 FTP 클라이언트 매뉴얼을 참고 하십시오.
th: การเชื่อมต่อโดยใช้ SFTP จะมีลักษณะคล้ายกันเกือบทั้งหมด หลังจากที่รัน SFTP client และตั้งค่าที่ใช้วิธีการเชื่อมต่อโดยใช้กุญแจสาธารณะแล้ว ให้ระบุ ``id_container`` เป็นกุญแจ SSH ส่วนตัว เพียงแต่ FTP client แต่ละตัวอาจมีวิธีการที่แตกต่างกัน ดังนั้นให้ดูคู่มือของแต่ละ FTP client สำหรับรายละเอียดเพิ่มเติม

source: The SSH/SFTP connection port number is randomly assigned each time when a session is created. If you want to use a specific SSH/SFTP port number, you can input the port number in the "Preferred SSH Port" field in the user settings menu. To avoid possible collisions with other services within the compute session, it is recommended to specify a port number between 10000-65000. However, if SSH/SFTP connections are made by two or more compute sessions at the same time, the second SSH/SFTP connection cannot use the designated port (since the first SSH/SFTP connection has already taken it), so a random port number will be assigned.
ja: SSH/SFTP接続のポート番号は、セッションが作成されるたびにランダムに割り当てられます。特定のSSH/SFTPポート番号を使用したい場合は、ユーザー設定メニューの「Preferred SSH Port」フィールドにポート番号を入力できます。計算セッション内の他のサービスとの衝突を避けるために、10000-65000の間のポート番号を指定することをお勧めします。ただし、2つ以上の計算セッションで同時にSSH/SFTP接続が行われた場合、2番目のSSH/SFTP接続は指定されたポートを使用できません（最初のSSH/SFTP接続がすでに使用しているため）、そのためランダムなポート番号が割り当てられます。
ko: SSH/SFTP 접속 포트 번호는 연산 세션을 생성할 때마다 임의의 값이 할당됩니다. 만약, SSH/SFTP 접속 포트를 특정한 값으로 고정하고 싶다면, 사용자 설정 메뉴에서 “Preferred SSH Port” 항목에 포트 번호를 기입할 수 있습니다. 세션 내의 다른 서비스와의 충돌을 가능한 방지하기 위해 포트 번호는 10000-65000 사이의 값을 지정하는 것을 권장합니다. 다만, 두 개 이상의 연산 세션에서 동시에 SSH/SFTP 연결을 맺게되는 경우, 두 번째 SSH/SFTP 연결은 지정된 포트를 사용할 수 없으므로 (첫 번째 SSH/SFTP 연결이 이미 점유) 임의의 포트 번호를 할당받게 됩니다.
th: หมายเลขพอร์ตการเชื่อมต่อ SSH/SFTP จะถูกกำหนดแบบสุ่มในทุกครั้งที่มีการสร้างเซสชัน หากคุณต้องการใช้หมายเลขพอร์ต SSH/SFTP ที่เฉพาะเจาะจง คุณสามารถกรอกหมายเลขพอร์ตในช่อง "Preferred SSH Port" ในเมนูการตั้งค่าผู้ใช้ เพื่อหลีกเลี่ยงการชนกับบริการอื่น ๆ ภายในเซสชันการคอมพิวเตอร์ แนะนำให้กำหนดหมายเลขพอร์ตในช่วง 10000-65000 อย่างไรก็ตาม หากการเชื่อมต่อ SSH/SFTP ถูกสร้างโดยเซสชันการคอมพิวเตอร์สองเซสชันหรือมากกว่านั้นในเวลาเดียวกัน การเชื่อมต่อ SSH/SFTP แรกจะไม่สามารถใช้พอร์ตที่กำหนดได้ (เนื่องจากการเชื่อมต่อ SSH/SFTP แรกได้ถูกใช้ไปแล้ว) ดังนั้นจะมีการกำหนดหมายเลขพอร์ตแบบสุ่มแทน

source: If you want to use your own SSH keypair instead of ``id_container``, create a user-type folder named ``.ssh``. If you create ``authorized_keys`` file in that folder and append it with the contents of your SSH public key, you can connect by SSH/SFTP through your own SSH private key without having to download the ``id_container`` after creating a compute session.
ja: ``id_container`` の代わりに独自の SSH キーペアを使用したい場合は、``.ssh`` というユーザータイプのフォルダを作成します。そのフォルダに ``authorized_keys`` ファイルを作成し、SSH 公開鍵の内容を追記すると、計算セッションを作成した後に ``id_container`` をダウンロードせずに、独自の SSH 秘密鍵を使って SSH/SFTP で接続できます。
ko: 만약 ``id_container`` 대신 사용자 자신의 SSH keypair를 사용하고 싶다면, ``.ssh`` 라는 이름의 사용자 폴더를 하나 만듭니다. 그 폴더 안에 ``authorized_keys`` 파일을 만든 후 사용할 SSH public key를 파일 내용으로 추가하면, 연산 세션 생성 후 ``id_container`` 파일을 다운로드 할 필요없이 자신의 SSH private key를 통해 SSH/SFTP 접속할 수 있습니다.
th: หากคุณต้องการใช้คู่กุญแจ SSH ของคุณเองแทน ``id_container`` ให้สร้างโฟลประเภทผู้ใช้ชื่อว่า ``.ssh`` หากคุณสร้างไฟล์ ``authorized_keys`` ในโฟลเดอร์นั้นและเพิ่มเนื้อหาของกุญแจสาธารณะ SSH ของคุณเข้าไป คุณสามารถเชื่อมต่อผ่าน SSH/SFTP โดยใช้กุญแจส่วนตัว SSH ของคุณเองโดยไม่จำเป็นต้องดาวน์โหลด ``id_container`` หลังจากสร้างเซสชันคอมพิวเตอร์

source: If you receive the following warning message, try again after changing the permission of the ``id_container`` to 600. (``chmod 600 <id_container path>``)
ja: 次の警告メッセージを受け取った場合は、``id_container`` の権限を 600 に変更した後、再試行してください。（``chmod 600 <id_container path>``）
ko: 만약 다음과 같은 경고 메시지가 뜨면, ``id_container`` 의 권한을 600으로 설정한 후 재시도 합니다. (``chmod 600 <id_container 경로>``)
th: หากคุณได้รับข้อความเตือนต่อไปนี้ ให้ลองอีกครั้งหลังจากเปลี่ยนสิทธิ์ของ ``id_container`` เป็น 600 (``chmod 600 <id_container path>``)

source: Permissions Warning Message
ja: 権限警告メッセージ
th: ข้อความเตือนการอนุญาต

source: For Windows / FileZilla
ja: Windowsの場合 / FileZilla
ko: Windows / FileZilla 사용 환경
th: สำหรับ Windows / FileZilla

source: Backend.AI Web-UI app supports OpenSSH-based public key connection (RSA2048). To access with a client such as PuTTY on Windows, a private key must be converted into a ``ppk`` file through a program such as PuTTYgen. You can refer to the following link for the conversion method: https://wiki.filezilla-project.org/Howto. For easier explanation, this section will describe how to connect to SFTP through FileZilla client on Windows.
ja: Backend.AI Web-UIアプリは、OpenSSHベースの公開鍵接続（RSA2048）をサポートしています。Windows上でPuTTYなどのクライアントを使用してアクセスするには、PuTTYgenなどのプログラムを通じて秘密鍵を ``ppk`` ファイルに変換する必要があります。変換方法については、以下のリンクを参照してください: https://wiki.filezilla-project.org/Howto。より簡単に説明するために、このセクションではWindows上でFileZillaクライアントを使用してSFTPに接続する方法を説明します。
ko: Backend.AI Web-UI 앱에서 지원하는 SSH/SFTP 접속 방법은 OpenSSH 기반 public key 접속(RSA2048)입니다. 윈도우즈의 PuTTY 등 클라이언트를 통해 접속하려면 PuTTYgen 등과 같은 프로그램으로 SSH private key를 ppk 파일로 변환하는 작업이 추가로 합니다. 변환 방법은 다음 링크를 참조 할 수 있습니다: https://wiki.filezilla-project.org/Howto. 보다 쉬운 설명을 위해 이번 절에서는 Windows에서 FileZilla 클라이언트를 통해 SFTP 접속하는 방법에 관해 알아보겠습니다.
th: แอป Backend.AI Web-UI รองรับการเชื่อมต่อด้วยคีย์สาธารณะแบบ OpenSSH (RSA2048) เพื่อเข้าถึงด้วยไคลเอนต์เช่น PuTTY บน Windows คีย์ส่วนตัวต้องถูกแปลงเป็นไฟล์ ``ppk`` ผ่านโปรแกรมเช่น PuTTYgen คุณสามารถดูวิธีการแปลงได้ที่ลิงก์ต่อไปนี้: https://wiki.filezilla-project.org/Howto เพื่อให้เข้าใจง่ายยิ่งขึ้น ในส่วนนี้จะอธิบายวิธีการเชื่อมต่อกับ SFTP ผ่านไคลเอนต์ FileZilla บน Windows

source: Refer to the connection method on Linux/Mac, create a compute session, check the connection port and download ``id_container``. ``id_container`` is an OpenSSH-based key, so if you use a client that supports only Windows or ppk type keys, you must convert it. Here, we will convert through the PuTTYgen program installed with PuTTY. After running the PuTTYgen, click on the import key in the Conversions menu. Select the downloaded ``id_container`` file from the file open dialog. Click the Save private key button of PuTTYGen and save the file with the name ``id_container.ppk``.
ja: Linux/Macでの接続方法を参照し、計算セッションを作成し、接続ポートを確認して ``id_container`` をダウンロードします。 ``id_container`` はOpenSSHベースのキーであるため、Windowsのみまたはppkタイプのキーをサポートするクライアントを使用する場合は、変換する必要があります。ここでは、PuTTYと一緒にインストールされるPuTTYgenプログラムを介して変換します。 PuTTYgenを実行した後、コンバージョンメニューのインポートキーをクリックします。ファイルオープンダイアログからダウンロードした ``id_container`` ファイルを選択します。PuTTYGenの「Save private key」ボタンをクリックし、ファイルを ``id_container.ppk`` という名前で保存します。
ko: Linux/Mac에서의 접속 방법을 참고하여 연산 세션을 생성하고 접속 포트 확인과 ``id_container`` 다운로드를 수행합니다. ``id_container`` 는 OpenSSH 기반의 키이므로, 윈도우 또는 ppk 형태의 키만 지원하는 클라이언트를 사용할 경우 변환을 해야 합니다. 여기서는 PuTTY와 함께 설치되는 PuTTYgen 프로그램을 통해 변환을 해보겠습니다. PuTTYgen 프로그램을 실행한 후 Conversions 메뉴의 import key를 클릭합니다. 이어 뜨는 파일 선택 다이얼로그에서 다운로드 한 id_container 파일을 선택합니다. PuTTYGen의 Save private key 버튼을 클릭하여 ``id_container.ppk`` 라는 이름으로 파일을 저장합시다.
th: อ้างอิงถึงวิธีการเชื่อมต่อบน Linux/Mac สร้างเซสชันการคอมพิวเตอร์ ตรวจสอบพอร์ตการเชื่อมต่อและดาวน์โหลด ``id_container`` ``id_container`` เป็นกุญแจที่อิงจาก OpenSSH ดังนั้นหากคุณใช้ไคลเอ็นต์ที่รองรับเฉพาะ Windows หรือกุญแจชนิด ppk คุณจำเป็นต้องแปลงมัน ที่นี่เราจะแปลงผ่านโปรแกรม PuTTYgen ที่ติดตั้งมาพร้อมกับ PuTTY หลังจากรัน PuTTYgen แล้วให้คลิกที่นำเข้ากุญแจในเมนู Conversions เลือกไฟล์ ``id_container`` ที่ดาวน์โหลดมาจากกล่องโต้ตอบเปิดไฟล์ คลิกปุ่มบันทึกกุญแจส่วนตัวของ PuTTYGen และบันทึกไฟล์ด้วยชื่อ ``id_container.ppk``

source: SSH key conversion with PuttyGen
ja: PuttyGenによるSSHキーの変換
th: การแปลงคีย์ SSH ด้วย PuttyGen

source: After launching the FileZilla client, go to the Settings-Connection-SFTP and register the key file ``id_container.ppk`` (``id_container`` for clients supporting OpenSSH).
ja: FileZillaクライアントを起動した後、設定-接続-SFTPに移動し、キー ファイル ``id_container.ppk`` （OpenSSHをサポートしているクライアントの場合は ``id_container``）を登録します。
ko: 이제 FileZilla 클라이언트 앱을 실행한 후 설정-연결-SFTP 페이지로 들어가 생성한 ``id_container.ppk`` (OpenSSH를 지원하는 클라이언트의 경우 ``id_container``) 키 파일을 등록해 줍니다.
th: หลังจากเปิดโปรแกรม FileZilla ให้ไปที่ การตั้งค่า-การเชื่อมต่อ-SFTP และลงทะเบียนไฟล์คีย์ ``id_container.ppk`` (``id_container`` สำหรับลูกค้าที่รองรับ OpenSSH)

source: Filezilla settings to connect to compute session
ja: コンピュートセッションに接続するためのFilezilla設定
th: การตั้งค่า Filezilla เพื่อติดต่อกับเซสชันการคอมพิวเตอร์

source: Open Site Manager, create a new site, and enter the connection information as follows.
ja: Site Managerを開き、新しいサイトを作成し、以下の接続情報を入力します。
ko: 사이트 관리자를 열고 새 사이트를 하나 만든 후 다음과 같이 접속 정보를 적어 줍니다.
th: เปิด Site Manager สร้างไซต์ใหม่ และกรอกข้อมูลการเชื่อมต่อดังต่อไปนี้

source: Filezilla site setting
ja: Filezilla サイト設定
th: การตั้งค่าไซต์ Filezilla

source: When connecting to a container for the first time, the following confirmation popup may appear. Click the OK button to save the host key.
ja: コンテナに初めて接続するとき、次の確認ポップアップが表示されることがあります。ホストキーを保存するには、[OK] ボタンをクリックしてください。
ko: 해당 컨테이너에 처음 접속하는 경우 다음과 같은 확인 창이 뜰 수 있습니다. 확인 버튼을 눌러 호스트 키를 저장합시다.
th: เมื่อเชื่อมต่อกับคอนเทนเนอร์เป็นครั้งแรก อาจมีหน้าต่างยืนยันขึ้นมา กดปุ่มตกลงเพื่อบันทึกโฮสต์คีย์

source: Unknown Host Key dialog
ja: 不明なホストキー ダイアログ
th: กล่องโต้ตอบโฮสต์กุญแจที่ไม่รู้จัก

source: After a while, you can see that the connection is established as follows. You can now transfer large files to ``/home/work/`` or other mounted storage folder with this SFTP connection.
ja: しばらくすると、次のように接続が確立されていることが確認できます。このSFTP接続を使用して、大きなファイルを ``/home/work/`` または他のマウントされたストレージフォルダーに転送できるようになりました。
ko: 잠시 기다린 후 다음과 같이 접속이 되는 것을 확인할 수 있습니다. SFTP 접속을 통해 ``/home/work/`` 및 마운트 된 Storage 폴더에 대용량 파일을 전송하는 등의 작업을 수행할 수 있습니다.
th: หลังจากนั้นสักพัก คุณจะเห็นว่าการเชื่อมต่อถูกสร้างขึ้นดังนี้ ขณะนี้คุณสามารถโอนย้ายไฟล์ขนาดใหญ่ไปยัง ``/home/work/`` หรือโฟลเดอร์ที่มีการติดตั้งที่จัดเก็บข้อมูลอื่น ๆ ผ่านการเชื่อมต่อ SFTP นี้ได้แล้ว

source: Filezilla connection established
ja: Filezilla 接続確立
th: การเชื่อมต่อกับ Filezilla ถูกตั้งค่าเรียบร้อยแล้ว

source: For Visual Studio Code
ja: Visual Studio Code用
th: สำหรับ Visual Studio Code

source: Backend.AI supports to develop with the local Visual Studio Code through SSH/SFTP connection to a compute session. Once connected, you can interact with files and folders anywhere on the compute session. In this section, we will learn how to do it.
ja: Backend.AIは、SSH/SFTP接続を介してコンピュートセッションに接続し、ローカルのVisual Studio Codeで開発することをサポートしています。一度接続されると、コンピュートセッション内のどこにでもあるファイルやフォルダとやり取りできます。このセクションでは、その方法を学びます。
ko: 로컬 Visual Studio Code에서 SSH/SFTP를 통해 Backend.AI 연산 세션에 접속하여 원격 개발할 수도 있습니다. 한번 연결을 하면, 연산 세션 상에 존재하는 모든 파일과 폴더를 활용하여 작업할 수 있습니다. 이번 절에서는 그 방법에 관해 알아봅니다.
th: Backend.AI รองรับการพัฒนาด้วย Visual Studio Code ภายในเครื่องผ่านการเชื่อมต่อ SSH/SFTP ไปยังเซสชันการคอมพิวเตอร์ เมื่อต่อเชื่อมเรียบร้อยแล้ว คุณสามารถโต้ตอบกับไฟล์และโฟลเดอร์ได้ทุกที่ในเซสชันการคอมพิวเตอร์ นี้ในส่วนนี้เราจะแสดงให้เห็นว่าทำอย่างไร

source: First, you should install Visual Studio Code and the Remote Development extension pack.
ja: まず、Visual Studio Codeとリモート開発拡張パックをインストールする必要があります。
ko: 우선, Visual Studio Code와 원격 개발(Remote Development) 확장팩을 설치해야 합니다.
th: ก่อนอื่น คุณควรติดตั้ง Visual Studio Code และชุดส่วนขยาย Remote Development

source: Link: https://aka.ms/vscode-remote/download/extension
ja: リンク: https://aka.ms/vscode-remote/download/extension
ko: 링크: https://aka.ms/vscode-remote/download/extension
th: ลิงก์: https://aka.ms/vscode-remote/download/extension

source: Install remote ssh plugin on Visual Studio Code
ja: Visual Studio CodeにリモートSSHプラグインをインストールする
th: ติดตั้งปลั๊กอิน SSH ระยะไกลบน Visual Studio Code

source: After installing the extension, you should configure the SSH connection for the compute session. In the VSCode Remote Connection dialog, click the copy icon button to copy the Visual Studio Code remote SSH password. Also, remember the port number.
ja: 拡張機能をインストールした後、コンピュートセッションのためのSSH接続を設定する必要があります。VSCodeのリモート接続ダイアログで、コピーアイコンボタンをクリックしてVisual Studio CodeのリモートSSHパスワードをコピーします。また、ポート番号も忘れずにメモしておいてください。
ko: 확장팩 설치 후 연산 세션 접속을 위한 SSH 연결 설정을 진행합니다. VSCode Remote Connection 다이얼로그에서 복사 아이콘 버튼을 클릭하여 Visual Studio Code 원격 비밀번호를 복사 합니다. 포트 번호도 기억해 두십시오.
th: หลังจากติดตั้งส่วนขยายแล้ว คุณควรกำหนดค่าการเชื่อมต่อ SSH สำหรับเซสชันการประมวลผล ในกล่องสนทนาเชื่อมต่อระยะไกลของ VSCode ให้คลิกที่ปุ่มไอคอนคัดลอกเพื่อคัดลอก รหัสผ่าน SSH ระยะไกลของ Visual Studio Code นอกจากนี้ โปรดจดหมายเลขพอร์ตไว้ด้วย

source: Download SSH Key
ja: SSHキーをダウンロード
th: ดาวน์โหลด SSH Key

source: Then, set the SSH config file. Edit the ``~/.ssh/config`` file (for Linux/Mac) or ``C:\Users\[user name]\.ssh\config`` (for Windows) and add the following block. For convenience, we set the hostname to ``bai-vscode``. It can be changed to any alias.
ja: 次に、SSH設定ファイルを設定します。 ``~/.ssh/config`` ファイル（Linux/Macの場合）または ``C:\Users\[user name]\.ssh\config`` ファイル（Windowsの場合）を編集し、次のブロックを追加します。便宜上、ホスト名を ``bai-vscode`` に設定します。これは任意のエイリアスに変更可能です。
ko: 다음으로 SSH 설정 파일을 수정합니다. ``~/.ssh/config`` 파일(Linux/Mac) 또는 ``C:\Users\[user name]\.ssh/config`` (Windows) 파일을 텍스트 편집기로 열고 다음 블록을 추가합니다. 편의를 위해 호스트 이름을 ``bai-vscode`` 로 설정했지만, 이는 원하는 대로 바꾸셔도 됩니다.
th: จากนั้น ให้ตั้งค่าไฟล์กำหนดค่า SSH แก้ไขไฟล์ ``~/.ssh/config`` (สำหรับ Linux/Mac) หรือ ``C:\Users\[user name]\.ssh\config`` (สำหรับ Windows) และเพิ่มบล็อกดังต่อไปนี้ เพื่อความสะดวก เราจะตั้งชื่อโฮสต์เป็น ``bai-vscode`` สามารถเปลี่ยนเป็นนามแฝงใดก็ได้

source: Now in the Visual Studio Code, select the `Command Palette...` from `View` menu.
ja: 次にVisual Studio Codeで、`View` メニューから `Command Palette...` を選択します。
ko: 이제 Visual Studio Code의 `View` - `Command Palette…` 메뉴를 선택합니다.
th: ตอนนี้ใน Visual Studio Code ให้เลือก `Command Palette...` จากเมนู `View`

source: View > comma
ja: 表示 > カンマ
th: ดู > จุลภาค

source: Visual Studio Code can automatically detect the type of host you are connecting to. Let's choose `Remote-SSH: Connect to Host...`.
ja: Visual Studio Code は、接続しているホストのタイプを自動的に検出できます。`Remote-SSH: Connect to Host...` を選択しましょう。
ko: Visual Studio Code는 연결할 호스트의 타입을 자동으로 탐지합니다. `Remote-SSH: Connect to Host...` 를 선택해봅시다.
th: Visual Studio Code สามารถตรวจจับประเภทของโฮสต์ที่คุณเชื่อมต่อได้โดยอัตโนมัติ มาเลือก `Remote-SSH: Connect to Host...` กันเถอะ

source: SSH connect
ja: SSH接続
th: เชื่อมต่อ SSH

source: You will see the list of hosts in ``.ssh/config``. Please select the host to connect, in this case, ``vscode``.
ja: ``.ssh/config`` にホストのリストが表示されます。接続するホストを選択してください。この場合、「vscode」です。
ko: 여기서는 ``.ssh/config`` 의 호스트 목록을 볼 수 있습니다. 연결할 호스트(``vscode``)를 선택합니다.
th: คุณจะเห็นรายชื่อโฮสต์ใน ``.ssh/config`` กรุณาเลือกโฮสต์ที่ต้องการเชื่อมต่อ ในกรณีนี้คือ ``vscode``

source: Select remote ssh select Host
ja: リモートSSHを選択してホストを選択
th: เลือก SSH ระยะไกล เลือกโฮสต์
