Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/share_vfolder/share_vfolder.po
Languages: ja, ko_kr, th

source: Sharing Storage Folders and Access Control
ja: ストレージフォルダの共有とアクセス制御
ko_kr: 저장 폴더 공유 및 접근 제어
th: การแชร์โฟลเดอร์จัดเก็บข้อมูลและการควบคุมการเข้าถึง

source: You may need to share the contents of storage folders with other users or project members to collaborate. For this purpose, Backend.AI provides flexible folder sharing feature.
ja: ストレージフォルダの内容を他のユーザーやプロジェクトメンバーと共有して共同作業を行う必要があるかもしれません。この目的のために、Backend.AIは柔軟なフォルダ共有機能を提供します。
th: คุณอาจต้องการแชร์เนื้อหาของโฟลเดอร์เก็บข้อมูลกับผู้ใช้หรือสมาชิกในโครงการคนอื่นเพื่อการทำงานร่วมกัน สำหรับวัตถุประสงค์นี้ Backend.AI จึงมีฟีเจอร์การแชร์โฟลเดอร์ที่ยืดหยุ่น

source: Share storage folders with other users
ja: 他のユーザーとストレージフォルダーを共有する
ko_kr: 개인 Storage 폴더를 다른 사용자와 공유하기
th: แชร์โฟลเดอร์สตอเรจกับผู้ใช้อื่น

source: Let's learn how to share your personal Storage folder with other users. First, log in to User A's account and go to the Data & Storage page. There are several folders, and we want to share a folder named ``tests`` to User B.
ja: 他のユーザーと個人用ストレージフォルダを共有する方法を学びましょう。まず、ユーザーAのアカウントにログインし、「データとストレージ」ページに移動します。いくつかのフォルダがありますが、ユーザーBに「tests」という名前のフォルダを共有したいと思います。
ko_kr: 개인의 Storage 폴더를 다른 사용자와 공유하는 방법에 관해 알아보겠습니다. 먼저 사용자 A의 계정으로 로그인한 뒤 Data & Storage 페이지로 이동합니다. 여러 폴더가 보이는데 이 중 ``tests`` 라는 폴더를 사용자B에게 공유하려고 합니다.
th: มาศึกษาวิธีการแชร์โฟลเดอร์จัดเก็บข้อมูลส่วนตัวของคุณให้กับผู้ใช้อื่นกันเถอะ ก่อนอื่นให้เข้าสู่ระบบด้วยบัญชีของผู้ใช้ A และไปที่หน้า Data & Storage ที่มีโฟลเดอร์หลายโฟลเดอร์ และเราต้องการแชร์โฟลเดอร์ที่มีชื่อว่า ``tests`` ให้กับผู้ใช้ B

source: Inside the ``tests`` folder you can see files and directories like ``hello.txt`` and ``myfolder``.
ja: ``tests`` フォルダーの中に ``hello.txt`` や ``myfolder`` のようなファイルとディレクトリーを見ることができます。
ko_kr: ``tests`` 폴더 안에는 ``hello.txt``, ``myfolder`` 와 같은 파일 및 디렉토리가 있는 것을 볼 수 있습니다.
th: ในโฟลเดอร์ ``tests`` คุณสามารถเห็นไฟล์และไดเรกทอรีเช่น ``hello.txt`` และ ``myfolder`` ได้

source: Confirm that the ``tests`` folder is not listed when logging in with User B's account.
ja: ユーザーBのアカウントでログインしたときに ``tests`` フォルダーが表示されていないことを確認します。
ko_kr: 사용자B의 계정으로 로그인 했을 때 ``tests`` 폴더가 조회되지 않는 것을 확인합니다.
th: ยืนยันว่าโฟลเดอร์ ``tests`` ไม่ปรากฏเมื่อเข้าสู่ระบบด้วยบัญชีผู้ใช้ B

source: If a folder named ``tests`` already exists in User B's account, User A's ``tests`` folder cannot be shared with User B.
ja: User B のアカウントに ``tests`` という名前のフォルダーが既に存在する場合、User A の ``tests`` フォルダーを User B と共有することはできません。
ko_kr: 만약 사용자B 계정에 ``tests`` 라는 이름의 폴더가 이미 존재한다면 사용자A의 ``tests`` 폴더는 사용자B에게 공유할 수 없습니다.
th: หากโฟลเดอร์ที่ชื่อว่า ``tests`` มีอยู่แล้วในบัญชีของผู้ใช้ B โฟลเดอร์ ``tests`` ของผู้ใช้ A จะไม่สามารถแชร์กับผู้ใช้ B ได้

source: Back to User A's account and click the share icon (third icon) in the Control panel on the right of the ``tests`` folder. Enter User B's email in the email input field and click the SHARE button to send a sharing invitation. No actual email is sent, and invitations are generated through the Backend.AI database. In the case of Permissions, if you check View, it is shared as read-only, and if you check Edit together, even writing is allowed to User B. If you want to share with multiple users, you can also click the + button to enter additional emails.
ja: ユーザーAのアカウントに戻り、``tests`` フォルダの右側にあるコントロールパネルで共有アイコン（3番目のアイコン）をクリックします。メール入力フィールドにユーザーBのメールアドレスを入力し、SHAREボタンをクリックして共有招待を送信します。実際のメールは送信されず、招待はBackend.AIデータベースを介して生成されます。権限の場合、Viewをチェックすると読み取り専用で共有され、EditもチェックするとユーザーBが書き込みも許可されます。複数のユーザーと共有する場合は、+ボタンをクリックして追加のメールアドレスを入力することもできます。
th: กลับไปที่บัญชีผู้ใช้ A และคลิกที่ไอคอนแชร์ (ไอคอนที่สาม) ในแผงควบคุมที่ด้านขวาของโฟลเดอร์ ``tests`` ใส่อีเมลของผู้ใช้ B ในช่องป้อนอีเมลและคลิกปุ่ม SHARE เพื่อส่งคำเชิญแชร์ ไม่มีอีเมลจริงส่งออก และคำเชิญจะถูกสร้างขึ้นผ่านฐานข้อมูลของ Backend.AI ในกรณีของสิทธิ์การเข้าถึง หากคุณตรวจสอบดู มันจะถูกแชร์เป็นอ่านอย่างเดียว และหากคุณตรวจสอบแก้ไขร่วมกัน การเขียนก็จะถูกอนุญาตให้กับผู้ใช้ B หากคุณต้องการแชร์กับผู้ใช้หลายคน คุณยังสามารถคลิกที่ปุ่ม + เพื่อตั้งค่าอีเมลเพิ่มเติมได้อีกด้วย

source: Back to User B's account and go to the Summary page. At the bottom of the page, you can see the invitation arrived. Click the ACCEPT button to accept the invitation. If you don't see the invitation, go to another page once and then come back to the Summary page again.
ja: ユーザーBのアカウントに戻って、サマリーページに移動します。ページの下部に招待が届いているのが見えます。ACCEPTボタンをクリックして招待を受け入れます。招待が表示されない場合は、一度別のページに移動してから再度サマリーページに戻ってください。
ko_kr: 사용자 B 계정으로 접속해서 Summary 페이지로 이동합니다. 페이지 하단에 Invitation 이라는 제목의 초대장이 도착한 것을 확인할 수 있습니다. ACCEPT 버튼을 클릭하여 초대를 수락합니다.
th: กลับไปที่บัญชีของผู้ใช้ B และไปที่หน้า สรุป ที่ด้านล่างของหน้า คุณจะเห็นคำเชิญที่เข้ามา คลิกที่ปุ่ม ยอมรับ เพื่อรับคำเชิญ หากคุณไม่เห็นคำเชิญ ให้ไปอีกหน้าหนึ่งแล้วกลับมาที่หน้า สรุป อีกครั้ง

source: Go to the Data & Storage page and check that the ``tests`` folder is displayed in the list. If you don't see it on the list, try refreshing your browser page. Since you have accepted the invitation, you can now view the contents of User A's ``tests`` folder in User B account. Compared to the other folders created by User B, the ``tests`` folder has no management icon in the Control panel. You can also see only the R (read-only) mark displayed in the Permission panel.
ja: Data & Storageページに移動し、リストに「tests」フォルダが表示されていることを確認します。リストに表示されていない場合は、ブラウザページを更新してみてください。招待を受け入れたため、現在はUser BアカウントでUser Aの「tests」フォルダの内容を閲覧できます。User Bによって作成された他のフォルダと比較すると、「tests」フォルダにはコントロールパネルに管理アイコンがありません。また、PermissionパネルにはR（読み取り専用）マークのみが表示されています。
ko_kr: Data & Storage 페이지로 이동한 뒤 ``tests`` 폴더가 리스트에 출력되는 것을 확인하세요. 만약 리스트에 보이지 않는다면 브라우저 페이지 갱신을 해보시기 바랍니다. 초대를 수락했기 때문에 이제 사용자B 계정에서 사용자A의 test 폴더 내용을 조회할 수 있습니다. 사용자B가 생성한 다른 폴더와 비교해 ``tests`` 폴더는 Control 열에 관리 아이콘이 빠진 것을 확인할 수 있습니다. Permission 열에는 R(읽기전용) 표시만 떠 있는 것도 볼 수 있습니다.
th: ไปที่หน้าข้อมูลและพื้นที่จัดเก็บ และตรวจสอบว่าหมายเลข ``tests`` ปรากฏในรายการ หากคุณไม่เห็นในรายการ ให้ลองรีเฟรชหน้าบราวเซอร์ของคุณ เนื่องจากคุณได้ตอบรับคำเชิญแล้ว คุณจึงสามารถดูเนื้อหาของหมายเลข ``tests`` ในบัญชีของผู้ใช้ B ได้ เมื่อเปรียบเทียบกับโฟลเดอร์อื่น ๆ ที่สร้างโดยผู้ใช้ B หมายเลข ``tests`` ไม่มีไอคอนการจัดการในแผงควบคุม คุณยังสามารถเห็นเพียงเครื่องหมาย R (อ่านอย่างเดียว) ที่แสดงในแผงสิทธิ์.

source: Let's navigate inside the ``tests`` folder by clicking the folder icon in the Control panel of ``tests``. You can check the ``hello.txt`` and ``myfolder`` that you checked in the User A's account again. Let's create a compute session by mounting this storge folder with the User B's account.
ja: ``tests`` フォルダのコントロールパネルでフォルダアイコンをクリックして、``tests`` フォルダの中に移動しましょう。User Aのアカウントで確認した ``hello.txt`` と ``myfolder`` を再度チェックすることができます。このストレージフォルダをUser Bのアカウントでマウントして、コンピュートセッションを作成してみましょう。
ko_kr: ``tests`` 의 Control 패널에서 폴더 아이콘을 클릭하여 ``tests`` 폴더 내부를 탐색 해 보겠습니다. 사용자 A의 계정에서 확인한 ``hello.txt`` 와 ``myfolder`` 를 다시 확인할 수 있습니다. 이 저장소 폴더를 사용자 B의 계정으로 마운트하여 컴퓨팅 세션을 생성 해 보겠습니다.
th: เรามาเข้าสู่โฟลเดอร์ ``tests`` โดยการคลิกที่ไอคอนโฟลเดอร์ในแผงควบคุมของ ``tests`` คุณสามารถตรวจสอบ ``hello.txt`` และ ``myfolder`` ที่คุณตรวจสอบในบัญชีผู้ใช้ A อีกครั้ง มาสร้างเซสชันการคำนวณโดยการเชื่อมต่อโฟลเดอร์จัดเก็บนี้กับบัญชีผู้ใช้ B กันเถอะ

source: After creating a session, open the web terminal and check that the ``tests`` folder is mounted in the home folder. The contents of the ``tests`` folder are displayed, but attempts to create or delete files are not allowed. This is because User A shared it as read-only. User B can create a file in the ``tests`` folder if it has been shared including write access.
ja: セッションを作成した後、ウェブターミナルを開き、``tests`` フォルダーがホームフォルダーにマウントされていることを確認します。``tests`` フォルダーの内容は表示されますが、ファイルの作成や削除を試みることは許可されていません。これは、ユーザーAがそれを読み取り専用として共有したためです。ユーザーBは、書き込みアクセスを含めて共有されている場合、``tests`` フォルダーにファイルを作成することができます。
ko_kr: 세션 생성 후 웹 터미널을 띄워 ``tests`` 폴더가 홈폴더에 마운트 된 것을 확인합니다. ``tests`` 폴더 내용은 조회가 되지만, 파일을 생성하거나 삭제하려는 시도는 허용되지 않습니다. 사용자A가 읽기 전용으로 공유했기 때문입니다. 만약 쓰기 권한까지 포함하여 공유했다면 사용자B도 ``tests`` 폴더에 파일을 생성할 수 있습니다.
th: หลังจากสร้างเซสชันแล้ว ให้เปิดเทอร์มินัลเว็บและตรวจสอบว่าโฟลเดอร์ ``tests`` ถูกเมานต์ในโฟลเดอร์โฮม เนื้อหาของโฟลเดอร์ ``tests`` จะแสดง แต่การพยายามสร้างหรือลบไฟล์จะไม่ถูกอนุญาต นี่เป็นเพราะผู้ใช้ A แบ่งปันในรูปแบบอ่านอย่างเดียว ผู้ใช้ B สามารถสร้างไฟล์ในโฟลเดอร์ ``tests`` ได้หากมีการแบ่งปันรวมถึงสิทธิ์ในการเขียน

source: If you click the folder icon in the Control panel, you may notice that UPLOAD FILES button and NEW FOLDER button disappears and READ-ONLY FOLDER message is shown on that spot. Also modify icon and delete icon in the Action panel are also disabled since the folder is read-only. User B can create a file in the ``tests`` folder if it has been shared including write access.
ja: コントロールパネルでフォルダーアイコンをクリックすると、UPLOAD FILESボタンとNEW FOLDERボタンが消え、その場所にREAD-ONLY FOLDERメッセージが表示されることに気付くでしょう。また、アクションパネルの修正アイコンと削除アイコンも、フォルダーが読み取り専用のため無効になっています。ユーザーBは、書き込みアクセスを含めて共有されている場合、「tests」フォルダーにファイルを作成することができます。
ko_kr: 제어판에서 폴더 아이콘을 클릭하면 파일 업로드 버튼과 새 폴더 버튼이 사라지고 그 자리에 READ-ONLY FOLDER 메시지가 표시되는 것을 볼 수 있습니다. 또한 폴더가 읽기 전용이므로 액션 패널의 아이콘 수정 및 삭제 아이콘도 비활성화됩니다. 사용자 B는 쓰기 권한을 포함하여 공유된 경우 ``tests`` 폴더에 파일을 만들 수 있습니다.
th: ถ้าคุณคลิกที่ไอคอนโฟลเดอร์ในแผงควบคุม คุณอาจสังเกตเห็นว่าปุ่ม UPLOAD FILES และปุ่ม NEW FOLDER จะหายไปและแสดงข้อความว่า READ-ONLY FOLDER ในจุดนั้น นอกจากนี้ ไอคอนแก้ไขและไอคอนลบในแผงการดำเนินการก็จะถูกปิดใช้งานเช่นกัน เนื่องจากโฟลเดอร์เป็นแบบอ่านอย่างเดียว ผู้ใช้ B สามารถสร้างไฟล์ในโฟลเดอร์ ``tests`` ได้หากได้มีการแชร์รวมทั้งการเข้าถึงการเขียน

source: This way, you can share your personal storage folders with other users based on your Backend.AI email account.
ja: この方法では、Backend.AIのメールアカウントに基づいて他のユーザーと個人のストレージフォルダを共有することができます。
th: วิธีนี้ คุณสามารถแบ่งปันโฟลเดอร์พื้นที่เก็บข้อมูลส่วนตัวของคุณกับผู้ใช้อื่นได้ตามบัญชีอีเมลของ Backend.AI ของคุณ

source: Backend.AI also provides sharing project folder to project members. To See the detail, go to :ref:`sharing a project storage folder with project members <sharing-a-group-storage>`.
ja: Backend.AIはプロジェクトメンバーへのプロジェクトフォルダの共有も提供しています。詳細は、:ref:`プロジェクトメンバーとのプロジェクトストレージフォルダの共有 <sharing-a-group-storage>` を参照してください。
th: Backend.AI ยังมีฟีเจอร์การแบ่งปันโฟลเดอร์โปรเจกต์ให้กับสมาชิกโปรเจกต์ สำหรับรายละเอียดเพิ่มเติมโปรดไปที่ :ref:`การแบ่งปันโฟลเดอร์ที่จัดเก็บโปรเจกต์กับสมาชิกโปรเจกต์ <sharing-a-group-storage>`

source: Adjust permission for shared folders
ja: 共有フォルダーの権限を調整する
ko_kr: 공유 폴더 권한 조정
th: ปรับแต่งสิทธิ์สำหรับโฟลเดอร์ที่แชร์

source: If you click the fourth person icon in the Control panel, you can see a list of users who have shared the folder. Click Select permission to set the sharing permission.
ja: コントロールパネルの4番目の人のアイコンをクリックすると、フォルダーを共有しているユーザーの一覧が表示されます。共有権限を設定するには、権限を選択をクリックします。
ko_kr: Control 패널에서 4번째 아이콘을 클릭하면 폴더를 공유한 사용자 목록을 볼 수 있습니다. 공유 권한을 설정하려면 권한 선택을 클릭합니다.
th: หากคุณคลิกที่ไอคอนคนที่สี่ในแผงควบคุม คุณจะเห็นรายชื่อผู้ใช้ที่ได้แชร์โฟลเดอร์ คลิกที่เลือกสิทธิ์เพื่อกำหนดสิทธิ์การแชร์

source: View: The invited user has read-only access to the folder.
ja: 閲覧: 招待されたユーザーはフォルダーへの読み取り専用アクセス権を持っています。
ko_kr: View: 초대된 사용자는 폴더에 대한 읽기 전용 접근 권한을 갖습니다.
th: ดู: ผู้ใช้ที่ได้รับเชิญมีสิทธิ์เข้าถึงโฟลเดอร์แบบอ่านอย่างเดียว

source: Edit: The invited user has read and write access to the folder. The user cannot delete folders or files.
ja: 編集: 招待されたユーザーはフォルダーへの読み書き権限を持っています。ユーザーはフォルダーやファイルを削除することはできません。
ko_kr: Edit: 초대된 사용자에게 폴더에 대한 읽기 및 쓰기 권한이 있습니다. 사용자는 폴더나 파일을 삭제할 수 없습니다.
th: แก้ไข: ผู้ใช้ที่ได้รับเชิญมีสิทธิ์ในการอ่านและเขียนเข้าถึงโฟลเดอร์ ผู้ใช้ไม่สามารถลบโฟลเดอร์หรือไฟล์ได้

source: Edit+Delete: The invited user has full access to the folder and can delete files or folders.
ja: 編集+削除: 招待されたユーザーはフォルダーへのフルアクセス権を持ち、ファイルやフォルダーを削除できます。
ko_kr: Edit+Delete: 초대된 사용자는 폴더에 대한 모든 접근 권한을 가지며 파일 또는 폴더를 삭제할 수 있습니다.
th: แก้ไข+ลบ: ผู้ใช้ที่ได้รับเชิญมีการเข้าถึงเต็มรูปแบบในโฟลเดอร์และสามารถลบไฟล์หรือโฟลเดอร์ได้

source: Kick out user: Retrieves the user's invitation. The user cannot view or use the folder any more.
ja: ユーザーを追い出す: ユーザーの招待状を取得します。ユーザーはこのフォルダーを表示したり使用したりすることができなくなります。
ko_kr: Kick out user: 사용자의 초대를 취소합니다. 기존에 초대된 사용자는 더 이상 폴더를 보거나 사용할 수 없습니다.
th: ขับไล่ผู้ใช้: ดึงคำเชิญของผู้ใช้มา ผู้ใช้งานไม่สามารถดูหรือใช้โฟลเดอร์ได้อีกต่อไป

source: Renaming folder itself is available only for the owner, even if the user has granted Edit or Edit+Delete permission. Please note that Edit permission does not provide renaming folder.
ja: フォルダーの名前変更は、たとえユーザーに編集または編集＋削除の権限が与えられていても、所有者にのみ可能です。編集権限ではフォルダーの名前変更はできないことに注意してください。
ko_kr: 사용자가 Edit 또는 Edit+Delete 권한을 부여한 경우에도 폴더 자체 이름 변경은 소유자만 사용할 수 있습니다. 편집 권한은 폴더 이름 변경을 제공하지 않습니다.
th: การเปลี่ยนชื่อโฟลเดอร์นั้นสามารถทำได้เฉพาะเจ้าของเท่านั้น แม้ว่าผู้ใช้จะได้รับสิทธิ์ในการแก้ไขหรือสิทธิ์ในการแก้ไข + ลบก็ตาม โปรดทราบว่าสิทธิ์ในการแก้ไขไม่ได้หมายความว่ามีสิทธิ์ในการเปลี่ยนชื่อโฟลเดอร์

source: You may need to share the contents of storage folders with other users or project members to collaborate. For this purpose, GPU Platform provides flexible folder sharing feature.
ko_kr: Storage 폴더의 내용을 다른 사용자 또는 프로젝트 멤버와 공유하여 공동 작업이나 학습을 수행할 필요가 있을 수 있습니다. 이를 위해 GPU Platform에서는 GUI를 통해 Storage 폴더를 손쉽게 공유할 수 있습니다.

source: Back to User A's account and click the share icon (third icon) in the Control panel on the right of the ``tests`` folder. Enter User B's email in the email input field and click the SHARE button to send a sharing invitation. No actual email is sent, and invitations are generated through the GPU Platform database. In the case of Permissions, if you check View, it is shared as read-only, and if you check Edit together, even writing is allowed to User B. If you want to share with multiple users, you can also click the + button to enter additional emails.
ko_kr: 사용자A 계정으로 이동한 뒤 ``tests`` 폴더의 우측 Control 열에 있는 세 번째 공유 아이콘을 클릭합니다. 이메일 입력 필드에 사용자B의 이메일을 입력하고 SHARE 버튼을 클릭해서 공유 초대장을 발송합니다. 실제 이메일이 발송되는 것은 아니며, GPU Platform 데이터베이스를 통해 초대장이 생성됩니다. Permissions의 경우, View를 체크하면 읽기 전용으로 공유하게 되고, Edit까지 같이 체크하면 쓰기 작업까지도 사용자B에게 허용합니다. 만약 여러 사용자에게 공유하고 싶다면 + 버튼을 클릭하여 이메일을 추가로 입력할 수도 있습니다.

source: This way, you can share your personal storage folders with other users based on your GPU Platform email account.
ko_kr: 이렇게 개인 폴더를 GPU Platform 이메일 계정 기반으로 다른 사용자에게 공유할 수 있습니다.

source: GPU Platform also provides sharing project folder to project members. To See the detail, go to :ref:`sharing a project storage folder with project members <sharing-a-group-storage>`.
ko_kr: GPU Platform는 또한 프로젝트 구성원에게 공유 프로젝트 폴더를 제공합니다. 자세한 내용을 보려면 :ref:`프로젝트 구성원과 프로젝트 스토리지 폴더 공유 <sharing-a-group-storage>` 로 이동하십시오.
