Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sessions_all/sessions_all.po
Languages: ja, ko_kr, th

source: In addition to this, you can use web-based services such as TensorBoard, Jupyter Lab, etc., depending on the type of environments provided by the compute session.
th: นอกจากนี้ คุณสามารถใช้บริการที่ใช้บนเว็บ เช่น TensorBoard, Jupyter Lab และอื่นๆ ตามประเภทของสภาพแวดล้อมที่จัดเตรียมโดยเซสชั่นการคำนวณ

source: You can view the log of the compute session by clicking the last icon in the Control panel of the running compute session.
th: คุณสามารถดูบันทึกของเซสชันการคำนวณได้โดยคลิกที่ไอคอนสุดท้ายในแผงควบคุมของเซสชันการคำนวณที่กำลังทำงานอยู่

source: From 22.09, you can download session log by clicking download button on upper-right side of the dialog. This feature is helpful for tracking artifacts.
th: ตั้งแต่วันที่ 22.09 เป็นต้นไป คุณสามารถดาวน์โหลดบันทึกเซสชันได้โดยการคลิกที่ปุ่มดาวน์โหลดที่มุมขวาบนของกล่องโต้ตอบ ฟีเจอร์นี้มีประโยชน์สำหรับการติดตามสิ่งของต่าง ๆ

source: You can change the name of an active session. Just click the edit icon in the session information column. Write down the new name and click the confirm button. The new session name should also follow the :ref:`the authoring rule<session-naming-rule>`.
th: คุณสามารถเปลี่ยนชื่อของเซสชันที่กำลังใช้งานอยู่ได้ เพียงแค่คลิกที่ไอคอนแก้ไขในคอลัมน์ข้อมูลเซสชัน เขียนชื่อใหม่ลงไปและคลิกปุ่มยืนยัน ชื่อเซสชันใหม่ควรปฏิบัติตาม :ref:`กฎการตั้งชื่อ<session-naming-rule>` ด้วย

source: To terminate a specific session, simply click on the red power icon and click OKAY button in the dialog. Since the data in the folder inside the compute session is deleted as soon as the compute session ends, it is recommended to move the data to the mounted folder or upload it to the mounted folder from the beginning if you want to keep it.
th: ในการสิ้นสุดเซสชันเฉพาะ เพียงคลิกที่ไอคอนพลังงานสีแดงและคลิกปุ่ม OKAY ในกล่องโต้ตอบ เนื่องจากข้อมูลในโฟลเดอร์ภายในเซสชันการคอมพิวเตอร์จะถูกลบทันทีที่เซสชันการคอมพิวเตอร์สิ้นสุดลง จึงแนะนำให้ย้ายข้อมูลไปยังโฟลเดอร์ที่เชื่อมต่อหรืออัปโหลดไปยังโฟลเดอร์ที่เชื่อมต่อตั้งแต่ต้นหากคุณต้องการเก็บรักษาไว้

source: GPU Platform supports three types of inactivity (idleness) criteria for automatic garbage collection of compute sessions: Max Session Lifetime, Network Idle Timeout, and Utilization Checker.
th: GPU Platform รองรับเกณฑ์การไร้กิจกรรม (ความเฉยเมย) สําหรับการเก็บขยะอัตโนมัติของเซสชันการประมวลผลสามประเภท: อายุขัยสูงสุดของเซสชัน, เวลาเงียบสงบของเครือข่าย, และการตรวจสอบการใช้ทรัพยากร.

source: Utilization Threshold: If the resource utilization of a compute session does not exceed the set threshold for a certain duration (idle timeout), that session will be automatically terminated. For example, if the accelerator utilization threshold is set to 1%, and a compute session shows a utilization of less than 1% over the idle itmeout, it becomes a target for termination. Resources with empty values are excluded from the garbage collection criteria.
th: เกณฑ์การใช้ทรัพยากร: หากการใช้ทรัพยากรของเซสชันการคำนวณเกินเกณฑ์ที่ตั้งไว้เป็นระยะเวลาหนึ่ง (หมดเวลาไร้การใช้งาน) เซสชันนั้นจะถูกยุติโดยอัตโนมัติ ตัวอย่างเช่น หากเกณฑ์การใช้ทรัพยากรของอุปกรณ์เร่งความเร็วตั้งไว้ที่ 1% และเซสชันการคำนวณแสดงการใช้ทรัพยากรน้อยกว่า 1% ตลอดระยะเวลาที่ไม่มีการใช้งาน จะกลายเป็นเป้าหมายในการยุติ ทรัพยากรที่มีค่าที่ว่างจะถูกยกเว้นจากเกณฑ์การเก็บขยะแบบอัตโนมัติ

source: Hovering your mouse over the Utilization Checker will display a tooltip with the utilization and threshold values. The text color changes to yellow and then red as the current utilization approaches the threshold (indicating low resource utilization).
th: การนำเมาส์ไปวางบน Utilization Checker จะทำให้แสดงข้อความ tooltip ที่มีค่าการใช้งานและค่าเกณฑ์ ค่าอักษรจะเปลี่ยนเป็นสีเหลืองและจากนั้นเป็นสีแดงเมื่อการใช้งานปัจจุบันเข้าใกล้เกณฑ์ (แสดงถึงการใช้งานทรัพยากรต่ำ)

source: To give more convenient workspace for users, GPU Platform supports environment variable setting in session launching. In this feature, you can add any envs such as ``PATH`` by filling out variable name and value in environment configuration dialog.
th: เพื่อให้มีพื้นที่ทำงานที่สะดวกสบายมากขึ้นสำหรับผู้ใช้ GPU Platform รองรับการตั้งค่าตัวแปรสิ่งแวดล้อมในการเริ่มต้นเซสชัน ในฟีเจอร์นี้ คุณสามารถเพิ่มตัวแปรใดๆ เช่น ``PATH`` โดยการกรอกชื่อและค่าตัวแปรในกล่องโต้ตอบการกำหนดค่าตัวแปรสิ่งแวดล้อม

source: You can input variable name and value in the same line of the input fields.
th: คุณสามารถป้อนชื่อและค่าของตัวแปรในบรรทัดเดียวกันของฟิลด์ป้อนข้อมูล

source: GPU Platform supports preopen ports setting at container startup. When using this feature, there is no need to build separate images when you want to expose the serving port.
th: GPU Platform รองรับการตั้งค่าพอร์ตที่เปิดใช้งานล่วงหน้าเมื่อเริ่มต้นคอนเทนเนอร์ เมื่อใช้ฟีเจอร์นี้ จะไม่จำเป็นต้องสร้างอิมเมจแยกต่างหากเมื่อคุณต้องการเปิดเผยพอร์ตการบริการ

source: GPU Platform supports \"Convert Session to Image\" feature from 24.03. Committing a ``RUNNING`` session will save the current state of the session as a new image. Clicking the commit button in the control column of ``RUNNING`` session will display a dialog to show the information of the session. After entering the session name, you can convert the session to a new image. The session name must be 4 to 32 characters long and can only contain alphanumeric letters, hyphens (``-``), or underscores (``_``).
th: GPU Platform รองรับฟีเจอร์ \"Convert Session to Image\" ตั้งแต่ 24.03 การบันทึกเซสชัน ``RUNNING`` จะบันทึกสถานะปัจจุบันของเซสชันเป็นภาพใหม่ การคลิกที่ปุ่มคอมมิตในคอลัมน์ควบคุมของเซสชัน ``RUNNING`` จะเปิดกล่องโต้ตอบเพื่อแสดงข้อมูลของเซสชัน หลังจากกรอกชื่อเซสชันแล้ว คุณสามารถแปลงเซสชันเป็นภาพใหม่ได้ ชื่อเซสชันต้องมีความยาว 4 ถึง 32 ตัวอักษรและสามารถมีเฉพาะตัวอักษรที่เป็นตัวเลข ตัวอักษรภาษาอังกฤษ ขีดกลาง (``-``) หรือขีดล่าง (``_``) เท่านั้น

source: Currently, GPU Platform supports "Convert Session to Image" only when the session is in ``INTERACTIVE`` mode. To prevent unexpected error, users may not be able to terminate the session during committing process. To stop the ongoing process, check the session, and force-terminate it.
th: ปัจจุบัน GPU Platform รองรับ "แปลงเซสชันเป็นภาพ" เท่านั้นเมื่อเซสชันอยู่ในโหมด ``INTERACTIVE`` เพื่อป้องกันข้อผิดพลาดที่ไม่คาดคิด ผู้ใช้อาจไม่สามารถยุติเซสชันได้ในระหว่างกระบวนการคอมมิท หากต้องการหยุดกระบวนการที่กำลังดำเนินอยู่ ให้ตรวจสอบเซสชันและบังคับยุติ เซสชันนั้น

source: Converting an ongoing session into an image allows you to select this image from the environments in the session launcher when creating a new session. This image is not exposed to other users and is useful for continuing to use the current session state as is. The converted image is tagged with ``Customized<session name>``.
th: การแปลงเซสชันที่กำลังดำเนินอยู่เป็นภาพช่วยให้คุณสามารถเลือกภาพนี้จากสภาพแวดล้อมในตัวเปิดเซสชันเมื่อสร้างเซสชันใหม่ ภาพนี้จะไม่ถูกเปิดเผยต่อผู้ใช้อื่นและมีประโยชน์ในการใช้สถานะเซสชันปัจจุบันต่อไปตามที่เป็นอยู่ ภาพที่แปลงแล้วจะถูกติดแท็กด้วย ``Customized<session name>``

source: GPU Platform provides configuration UI for internal control variable in ``nthreads-var``. GPU Platform sets this value equal to the number of session's CPU cores by default, which has the effect of accelerating typical high-performance computing workloads. Nevertheless, for some multi-thread workloads, multiple processes using OpenMP are used at same time, resulting in an abnormally large number of threads and significant performance degradation. To resolve this issue, setting the number of threads to 1 or 2 would work.
th: GPU Platform มีอินเตอร์เฟซการตั้งค่าสำหรับตัวแปรควบคุมภายในใน ``nthreads-var`` โดยค่าเริ่มต้น GPU Platform จะตั้งค่านี้ให้เท่ากับจำนวนหน่วยประมวลผล CPU ของเซสชัน ซึ่งจะช่วยเร่งงานประมวลผลที่มีประสิทธิภาพสูง อย่างไรก็ตาม สำหรับงานหลายเธรดบางประเภท การใช้หลายโปรเซสที่ใช้ OpenMP ในเวลาเดียวกันจะส่งผลให้มีจำนวนเธรดที่มากผิดปกติและทำให้ประสิทธิภาพลดลงอย่างมาก เพื่อแก้ไขปัญหานี้ การตั้งค่าจำนวนเธรดเป็น 1 หรือ 2 จะได้ผล

source: The web-based terminal internally embeds a utility called `tmux <https://github.com/tmux/tmux/wiki>`_. tmux is a terminal multiplexer that supports to open multiple shell windows within a single shell, so as to allow multiple programs to run in foreground simultaneously. If you want to take advantage of more powerful tmux features, you can refer to the official tmux documentation and other usage examples on the Internet.
th: เทอร์มินัลที่ใช้บนเว็บจะฝังยูทิลิตี้ที่เรียกว่า `tmux <https://github.com/tmux/tmux/wiki>`_ ภายใน tmux เป็นมัลติพlexer เทอร์มินัลที่รองรับการเปิดหลายหน้าต่างเชลล์ภายในเชลล์เดียว เพื่อให้สามารถเรียกใช้งานโปรแกรมหลายโปรแกรมในระดับพื้นหลังพร้อมกันได้ หากคุณต้องการใช้ประโยชน์จากฟีเจอร์ที่ทรงพลังมากขึ้นของ tmux คุณสามารถอ้างอิงเอกสารอย่างเป็นทางการของ tmux และตัวอย่างการใช้งานอื่น ๆ บนอินเทอร์เน็ตได้

source: tmux offers a number of useful features, but it's a bit confusing for first-time users. In particular, tmux has its own clipboard buffer, so when copying the contents of the terminal, you can suffer from the fact that it can be pasted only within tmux by default. Furthermore, it is difficult to expose user system's clipboard to tmux inside web browser, so the terminal contents cannot be copied and pasted to other programs of user's computer. The so-called ``Ctrl-C`` / ``Ctrl-V`` is not working with tmux.
th: tmux มีฟีเจอร์ที่มีประโยชน์หลายอย่าง แต่ก็อาจจะสับสนสำหรับผู้ใช้ที่ไม่เคยใช้มาก่อน โดยเฉพาะ tmux จะมีคลิปบอร์ดของตัวเอง ดังนั้นเมื่อคุณทำการคัดลอกเนื้อหาจากเทอร์มินัล คุณอาจประสบปัญหาที่ว่ามันสามารถวางได้เฉพาะภายใน tmux ตามค่าเริ่มต้น นอกจากนี้ยังยากที่จะเปิดเผยคลิปบอร์ดของระบบผู้ใช้งานให้กับ tmux ภายในเว็บเบราว์เซอร์ ดังนั้นเนื้อหาในเทอร์มินัลจึงไม่สามารถคัดลอกและวางไปยังโปรแกรมอื่นๆ ในคอมพิวเตอร์ของผู้ใช้ได้ คำสั่งที่เรียกว่า ``Ctrl-C`` / ``Ctrl-V`` จึงไม่ทำงานร่วมกับ tmux

source: If you need to copy and paste the terminal contents to your system's clipboard, you can temporarily turn off tmux's mouse support. First, press ``Ctrl-B`` key to enter tmux control mode. Then type ``:set -g mouse off`` and press ``Enter`` (note that you have to type the first colon as well). You can check what you are typing in the status bar at the bottom of the screen. Then drag the desired text from the terminal with the mouse and press the ``Ctrl-C`` or ``Cmd-C`` (in Mac) to copy them to the clipboard of the user's computer.
th: หากคุณต้องการคัดลอกและวางเนื้อหาจากเทอร์มินัลไปยังคลิปบอร์ดของระบบของคุณ คุณสามารถปิดการสนับสนุนเมาส์ของ tmux ชั่วคราวได้ ก่อนอื่นกดปุ่ม ``Ctrl-B`` เพื่อเข้าสู่โหมดการควบคุม tmux จากนั้นพิมพ์ ``:set -g mouse off`` และกด ``Enter`` (โปรดทราบว่าคุณต้องพิมพ์ colon ตัวแรกด้วย) คุณสามารถตรวจสอบสิ่งที่คุณพิมพ์ได้ในแถบสถานะที่ด้านล่างของหน้าจอ จากนั้นลากข้อความที่ต้องการจากเทอร์มินัลด้วยเมาส์และกด ``Ctrl-C`` หรือ ``Cmd-C`` (ใน Mac) เพื่อคัดลอกไปยังคลิปบอร์ดของคอมพิวเตอร์ของผู้ใช้

source: With mouse support turned off, you cannot scroll through the mouse wheel to see the contents of the previous page from the terminal. In this case, you can turn on mouse support again. Press ``Ctrl-B``, and this time, type ``:set -g mouse on``. Now you can scroll mouse wheel to see the contents of the previous page.
th: เมื่อการสนับสนุนเมาส์ถูกปิดใช้งาน คุณไม่สามารถเลื่อนผ่านล้อเมาส์เพื่อดูเนื้อหาของหน้าก่อนหน้าได้จากเทอร์มินัล ในกรณีนี้ คุณสามารถเปิดการสนับสนุนเมาส์อีกครั้ง กด ``Ctrl-B`` และในครั้งนี้ให้พิมพ์ ``:set -g mouse on`` ตอนนี้คุณสามารถเลื่อนล้อเมาส์เพื่อดูเนื้อหาของหน้าก่อนหน้าได้แล้ว

source: ``Ctrl-B`` is tmux's default control mode key. If you set another control key by modifying ``.tmux.conf`` in user home directory, you should press the set key combination instead of ``Ctrl-B``.
th: ``Ctrl-B`` เป็นปุ่มควบคุมโหมดเริ่มต้นของ tmux หากคุณตั้งค่าปุ่มควบคุมอื่นโดยการแก้ไข ``.tmux.conf`` ในโฟลเดอร์โฮมของผู้ใช้ คุณควรกดการรวมปุ่มที่ตั้งค่าแทน ``Ctrl-B``

source: There is also a way to copy the terminal contents and check the previous contents of the terminal simultaneously. It is to check the previous contents using the keyboard. Again, click ``Ctrl-B`` first, and then press the ``Page Up`` and/or ``Page Down`` keys. You can see that you navigate through the terminal's history with just keyboard. To exit search mode, just press the ``q`` key. With this method, you can check the contents of the terminal history even when the mouse support is turned off to allow copy and paste.
th: ยังสามารถสำเนาเนื้อหาของเทอร์มินัลและตรวจสอบเนื้อหาก่อนหน้าของเทอร์มินัลได้ในเวลาเดียวกัน วิธีการคือการตรวจสอบเนื้อหาก่อนหน้าด้วยคีย์บอร์ด ก่อนอื่นให้คลิกที่ ``Ctrl-B`` จากนั้นกดปุ่ม ``Page Up`` และ/หรือ ``Page Down`` คุณจะเห็นว่าคุณนำทางผ่านประวัติของเทอร์มินัลด้วยคีย์บอร์ดเพียงอย่างเดียว เมื่อต้องการออกจากโหมดค้นหาเพียงกดปุ่ม ``q`` วิธีนี้คุณสามารถตรวจสอบเนื้อหาของประวัติเทอร์มินัลแม้ว่าการสนับสนุนเมาส์จะถูกปิดเพื่ออนุญาตการคัดลอกและวาง

source: The main advantage of tmux is that you can launch and use multiple shells in one terminal window. Since seeing is believing, let's press the ``Ctrl-B`` key and then the ``c``. You can see that the contents of the existing window disappears and a new shell environment appears. But the previous window is not terminated. Let's press ``Ctrl-B`` and then ``w``. You can now see the list of shells currently open on tmux like following image. Here, the shell starting with ``0:`` is the shell environment you first saw, and the shell starting with ``1:`` is the one you just created. You can move between shells using the up/down keys. Place the cursor on the shell ``0:`` and press the Enter key to select it.
th: ข้อดีหลักของ tmux คือคุณสามารถเปิดและใช้งานหลายเชลล์ในหน้าต่างเทอร์มินัลเดียว ตั้งแต่เห็นก็เชื่อได้ มาเริ่มกดปุ่ม ``Ctrl-B`` และจากนั้นก็กด ``c`` คุณจะเห็นว่าคอนเทนต์ของหน้าต่างที่มีอยู่หายไปและสภาพแวดล้อมเชลล์ใหม่แสดงขึ้น แต่หน้าต่างก่อนหน้านี้ไม่ได้ถูกปิดไป มา กด ``Ctrl-B`` และจากนั้นก็กด ``w`` คุณจะเห็นรายการของเชลล์ที่เปิดอยู่ใน tmux ปัจจุบันตามภาพนี้ ที่นี่ เชลล์ที่เริ่มต้นด้วย ``0:`` คือสภาพแวดล้อมเชลล์ที่คุณเห็นครั้งแรก และเชลล์ที่เริ่มต้นด้วย ``1:`` คือเชลล์ที่คุณเพิ่งสร้างขึ้น คุณสามารถเคลื่อนย้ายระหว่างเชลล์โดยใช้ปุ่มขึ้น/ลง วางเคอร์เซอร์ไปที่เชลล์ ``0:`` และกดปุ่ม Enter เพื่อเลือกมัน

source: You can see the first shell environment appears. In this way, you can use multiple shell environments within a web terminal. To exit or terminate the current shell, just enter ``exit`` command or press ``Ctrl-B x`` key and then type ``y``.
th: คุณสามารถเห็นสภาพแวดล้อมเชลล์แรกปรากฏขึ้น ในลักษณะนี้ คุณสามารถใช้สภาพแวดล้อมเชลล์หลายตัวภายในเทอร์มินัลเว็บ เพื่อออกหรือสิ้นสุดเชลล์ปัจจุบัน เพียงแค่ป้อนคำสั่ง ``exit`` หรือกดปุ่ม ``Ctrl-B x`` จากนั้นพิมพ์ ``y``

source: Combining the above commands allows you to perform various tasks simultaneously on multiple shells.
th: การรวมคำสั่งข้างต้นช่วยให้คุณสามารถทำงานต่าง ๆ ได้พร้อมกันในหลาย ๆ เชลล์
