Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sessions_all/sessions_all.po
Languages: ja, ko_kr, th

source: Session type: Determines the type of the session. "Interactive" and "Batch" are the two session types currently available. The following are the primary distinctions between the two types:
th: ประเภทเซสชัน: กำหนดประเภทของเซสชัน "แบบโต้ตอบ" และ "แบบชุด" เป็นสองประเภทเซสชันที่มีอยู่ในปัจจุบัน รายละเอียดต่อไปนี้คือความแตกต่างหลักระหว่างสองประเภทนี้:

source: This type has been supported from the initial version of GPU Platform.
th: ประเภทนี้ได้รับการสนับสนุนตั้งแต่เวอร์ชันแรกของ GPU Platform.

source: This type of session is supported via GUI from GPU Platform 22.03 (CLI has supported the batch-type session before the 22.03).
th: ประเภทเซสชันนี้ได้รับการสนับสนุนผ่าน GUI ตั้งแต่ GPU Platform 22.03 (CLI ได้สนับสนุนเซสชันประเภทแบตช์ก่อนหน้า 22.03)

source: Executes the script as soon as the compute session is ready, and then automatically terminates the session as soon as the execution finishes. So, it will more efficiently and flexibly utilize the server farm's resources if a user can write the execution script in advance or is building a pipeline of workloads.
th: ดำเนินการสคริปต์ทันทีที่เซสชันการคอมพิวเตอร์พร้อมใช้งาน และจากนั้นจะสิ้นสุดเซสชันโดยอัตโนมัติเมื่อการดำเนินการเสร็จสิ้น ดังนั้นมันจะใช้ทรัพยากรของฟาร์มเซิร์ฟเวอร์ได้อย่างมีประสิทธิภาพและยืดหยุ่นมากขึ้นหากผู้ใช้สามารถเขียนสคริปต์การดำเนินการล่วงหน้าหรือกำลังสร้างท่อสายงานของงานที่โหลด.

source: You can set the start time of a batch-type compute session. However, it does not guarantee the session will be created at that time. It may still be PENDING due to the lack of resources, etc. Rather, it guarantees that the session WILL NOT run until the start time.
th: คุณสามารถตั้งเวลาเริ่มต้นของเซสชันการคำนวณแบบแบตช์ได้ อย่างไรก็ตามไม่มีการรับประกันว่าเซสชันจะถูกสร้างขึ้นในเวลานั้น อาจยังคงอยู่ในสถานะ PENDING เนื่องจากขาดแคลนทรัพยากร เป็นต้น อย่างไรก็ตามมีการรับประกันว่าเซสชันจะไม่ทำงานจนกว่าจะถึงเวลาเริ่มต้น

source: Session name: You can specify the name of the compute session to be created. If set, this name appears in Session Info, so it is easy to distinguish among multiple computation sessions. If not specified, a random word is assigned automatically. Session names only accept alphanumeric characters between 4 and 64 without spaces.
th: ชื่อเซสชัน: คุณสามารถกำหนดชื่อของเซสชันการคอมพิวเตอร์ที่จะสร้างขึ้น หากกำหนด ชื่อนี้จะแสดงในข้อมูลเซสชัน ดังนั้นจึงง่ายต่อการแยกแยะระหว่างเซสชันการคอมพิวเตอร์หลาย ๆ เซสชัน หากไม่ระบุ จะมีการกำหนดคำสุ่มโดยอัตโนมัติ ชื่อเซสชันจะยอมรับเฉพาะตัวอักษรที่เป็นตัวเลขและตัวอักษรระหว่าง 4 ถึง 64 โดยไม่มีช่องว่าง

source: Click the Next button below, or the Environments & Resource allocation on the right to proceed to the next page. If you want to create a session without any further settings, press the Skip to review button. button. In this case, the settings on the other pages will all use the default values.
th: คลิกปุ่มถัดไปด้านล่าง หรือหน้า Environments & Resource allocation ด้านขวาเพื่อต่อไปยังหน้าถัดไป หากคุณต้องการสร้างเซสชันโดยไม่ต้องตั้งค่าเพิ่มเติมใด ๆ ให้กดปุ่มข้ามไปตรวจสอบ ในกรณีนี้การตั้งค่าบนหน้าต่าง ๆ อื่น ๆ จะใช้ค่าเริ่มต้นทั้งหมด

source: For detailed explanations of each item that can be set on the second page, please refer to the following.
th: สำหรับคำอธิบายรายละเอียดของแต่ละรายการที่สามารถตั้งค่าได้ในหน้าที่สอง โปรดดูที่ด้านล่างนี้

source: Environments: You can choose the base environment for compute sessions such as TensorFlow, PyTorch, C++, etc. When you select TensorFlow, your compute session will automatically include the TensorFlow library. If you choose another environment, the corresponding packages will be installed by default.
th: สภาพแวดล้อม: คุณสามารถเลือกสภาพแวดล้อมพื้นฐานสำหรับเซสชันการคอมพิวเตอร์ เช่น TensorFlow, PyTorch, C++, ฯลฯ เมื่อคุณเลือก TensorFlow เซสชันการคอมพิวเตอร์ของคุณจะรวมไลบรารี TensorFlow โดยอัตโนมัติ หากคุณเลือกสภาพแวดล้อมอื่น แพ็กเกจที่เกี่ยวข้องจะถูกติดตั้งโดยอัตโนมัติ

source: Version: Selects the version of the environment. For example, you can select different versions, such as 1.15, 2.3, etc., for the TensorFlow environment.
th: เวอร์ชัน: เลือกเวอร์ชันของสภาพแวดล้อม ตัวอย่างเช่น คุณสามารถเลือกเวอร์ชันที่แตกต่างกัน เช่น 1.15, 2.3 เป็นต้น สำหรับสภาพแวดล้อม TensorFlow

source: Image Name: You can specify the name of the image to be used for the compute session. Depending on your environment settings, this configurations may not be available.
th: ชื่อภาพ: คุณสามารถระบุชื่อภาพที่จะใช้สำหรับเซสชันการคอมพิวเตอร์ได้ ขึ้นอยู่กับการตั้งค่าสภาพแวดล้อมของคุณ การตั้งค่านี้อาจไม่พร้อมใช้งาน

source: Set Environment Variable: Provides an interface for users to set environment variables in a compute session. See the section :ref:`How to add environment variables before session creation<set-environment-variables>` on how to use.
th: ตั้งค่าตัวแปรสิ่งแวดล้อม: ให้ส่วนติดต่อสำหรับผู้ใช้ในการตั้งค่าตัวแปรสิ่งแวดล้อมในเซสชันการประมวลผล ดูที่ส่วน :ref:`วิธีการเพิ่มตัวแปรสิ่งแวดล้อมก่อนการสร้างเซสชัน<set-environment-variables>` ในการใช้งาน

source: Resource Group: Specifies the resource group in which to create a compute session. A resource group is a unit that groups host servers that each user can access. Usually, servers in a resource group would have the same type of GPU resources. Administrators can classify servers by any criteria, group them into one or more resource groups, and configure which resource groups a user can use. Users can launch a compute session only on servers in resource groups allowed by the administrator. If you are allowed multiple resource groups, you can select any group you want, but you cannot change it if you have only one.
th: กลุ่มทรัพยากร: ระบุกลุ่มทรัพยากรที่ใช้ในการสร้างเซสชั่นการคอมพิวเตอร์ กลุ่มทรัพยากรเป็นหน่วยที่รวมเซิร์ฟเวอร์โฮสต์ที่ผู้ใช้แต่ละคนสามารถเข้าถึงได้ โดยทั่วไปแล้วเซิร์ฟเวอร์ในกลุ่มทรัพยากรจะมีประเภทของทรัพยากร GPU ที่เหมือนกัน ผู้ดูแลระบบสามารถจัดประเภทเซิร์ฟเวอร์ตามเกณฑ์ใด ๆ ก็ได้ แบ่งกลุ่มเป็นหนึ่งหรือมากกว่ากลุ่มทรัพยากร และกำหนดว่ากลุ่มทรัพยากรใดที่ผู้ใช้สามารถใช้ได้ ผู้ใช้สามารถเริ่มเซสชั่นการคอมพิวเตอร์ได้เฉพาะบนเซิร์ฟเวอร์ในกลุ่มทรัพยากรที่ได้รับอนุญาตจากผู้ดูแลระบบ หากคุณได้รับอนุญาตให้เลือกหลายกลุ่มทรัพยากร คุณสามารถเลือกกลุ่มใดก็ได้ที่คุณต้องการ แต่คุณไม่สามารถเปลี่ยนได้หากคุณมีเพียงกลุ่มเดียว

source: Resource Presets: These templates have pre-defined resource sets, such as CPU, memory, and GPU, to be allocated to a compute session. Administrators can define frequently used resource settings in advance. By adjusting the numerical input or sliding the slider, you can allocate the desired amount of resources.
th: การตั้งค่าทรัพยากร: เทมเพลตเหล่านี้มีชุดทรัพยากรที่กำหนดไว้ล่วงหน้า เช่น CPU, หน่วยความจำ และ GPU ที่จะถูกจัดสรรให้กับเซสชันการคอมพิวเตอร์ ผู้ดูแลระบบสามารถกำหนดการตั้งค่าทรัพยากรที่ใช้บ่อยไว้ล่วงหน้า โดยการปรับค่าตัวเลขหรือลากสไลเดอร์ คุณสามารถจัดสรรทรัพยากรที่ต้องการได้

source: The meaning of each item is as follows, and you can check it by clicking the Help (?) button as well.
th: ความหมายของแต่ละรายการมีดังต่อไปนี้ และคุณสามารถตรวจสอบได้โดยการคลิกที่ปุ่มช่วยเหลือ (?) ด้วย

source: CPU: The CPU performs basic arithmetic, logic, controlling, and input/output (I/O) operations specified by the instructions. For high performance computing workloads, many CPUs are helpful, but the program code must be written to use multiple CPUs.
th: CPU: CPU ทำการคำนวณเชิงพีชคณิตพื้นฐาน การทำงานเชิงตรรกะ การควบคุม และการป้อนข้อมูล / การส่งออก (I/O) ตามที่ระบุโดยคำสั่ง สำหรับงานประมวลผลที่มีประสิทธิภาพสูง CPU หลายตัวจะมีประโยชน์ แต่โค้ดโปรแกรมต้องเขียนขึ้นเพื่อใช้ CPU หลายตัว

source: Memory: Computer memory is a temporary storage area. It holds the data and instructions that the Central Processing Unit (CPU) needs. When using a GPU in a machine learning workload, you must allocate at least twice the memory of the GPU to memory. Otherwise, the GPU's idle time will increase, resulting in a performance penalty.
th: หน่วยความจำ: หน่วยความจำของคอมพิวเตอร์เป็นพื้นที่เก็บข้อมูลชั่วคราว มันเก็บข้อมูลและคำสั่งที่หน่วยประมวลผลกลาง (CPU) ต้องการ เมื่อใช้ GPU ในงานการเรียนรู้ของเครื่อง คุณต้องจัดสรรหน่วยความจำอย่างน้อยสองเท่าของหน่วยความจำ GPU มิฉะนั้นเวลาที่ GPU ไม่มีงานทำจะเพิ่มขึ้น ซึ่งส่งผลให้เกิดการลงโทษด้านประสิทธิภาพ

source: Sessions: A session is a unit of computational environment that is created according to a specified environment and resources. If this value is set to a value greater than 1, multiple sessions corresponding to the resource set above are created. If there are not enough resources available, requests to create sessions that cannot be created are put on the waiting queue.
th: เซสชัน: เซสชันเป็นหน่วยของสภาพแวดล้อมการคำนวณที่ถูกสร้างตามสภาพแวดล้อมและทรัพยากรที่ระบุ หากค่าตั้งไว้มากกว่า 1 จะมีการสร้างเซสชันหลาย ๆ ตัวที่ตรงกับชุดทรัพยากรที่กล่าวถึงข้างต้น หากไม่มีทรัพยากรที่เพียงพอสำหรับการสร้างเซสชัน คำขอในการสร้างเซสชันที่ไม่สามารถสร้างได้จะถูกนำไปไว้ในคิวรอ

source: Cluster mode: GPU Platform supports cluster mode, which allows you to create multiple compute sessions at once. For more information, see the section :ref:`Overview of GPU Platform cluster compute session<backendai-cluster-compute-session>`.
th: โหมดกลุ่ม: GPU Platform รองรับโหมดกลุ่ม ซึ่งช่วยให้คุณสามารถสร้างเซสชันการคำนวณหลายเซสชันได้ในคราวเดียว สำหรับข้อมูลเพิ่มเติม กรุณาดูที่ส่วน :ref:`ภาพรวมของเซสชันการคำนวณกลุ่ม GPU Platform<backendai-cluster-compute-session>`

source: High-Performance Computing Optimizations: GPU Platform provides configuring values related to HPC Optimizations. For more information, See the section :ref:`Optimizing Accelerated Computing<optimizing-accelerated-computing>`.
th: การปรับแต่งประสิทธิภาพการคอมพิวเตอร์ประสิทธิภาพสูง: GPU Platform มีการกำหนดค่าที่เกี่ยวข้องกับการปรับแต่ง HPC สำหรับข้อมูลเพิ่มเติม โปรดดูที่ส่วน :ref:`Optimizing Accelerated Computing<optimizing-accelerated-computing>`

source: Click the Next button below, or the Data & Storage on the right to proceed to the next page.
th: คลิกที่ปุ่มถัดไปด้านล่าง หรือที่ข้อมูลและการจัดเก็บทางด้านขวาเพื่อต่อไปยังหน้าถัดไป

source: Here, you can specify the data folders to mount in the compute session. When a compute session is destroyed, all data is deleted altogether by default, but the data stored in the mounted folders will survive. Data in those folders can also be reused by mounting it when creating another compute session. For the information on how to mount a folder and run a compute session, see :ref:`Mounting Folders to a Compute Session<session-mounts>`. Here, we will pass by without mounting any folder. Let's move on to the next page.
th: ที่นี่ คุณสามารถระบุโฟลเดอร์ข้อมูลเพื่อติดตั้งในเซสชันการคอมพิวเตอร์ เมื่อเซสชันการคอมพิวเตอร์ถูกทำลาย ข้อมูลทั้งหมดจะถูกลบโดยอัตโนมัติ แต่ข้อมูลที่เก็บไว้ในโฟลเดอร์ที่ติดตั้งจะยังคงอยู่ ข้อมูลในโฟลเดอร์เหล่านั้นยังสามารถนำกลับมาใช้ใหม่ได้โดยการติดตั้งในขณะที่สร้างเซสชันการคอมพิวเตอร์ใหม่ สำหรับข้อมูลเกี่ยวกับวิธีการติดตั้งโฟลเดอร์และเรียกใช้เซสชันการคอมพิวเตอร์ ให้ดูที่ :ref:`การติดตั้งโฟลเดอร์ไปยังเซสชันการคอมพิวเตอร์<session-mounts>` ที่นี่เราจะผ่านไปโดยไม่ติดตั้งโฟลเดอร์ใด ๆ มาต่อไปยังหน้าถัดไปกันเถอะ

source: On the fourth page, you can set Network configurations such as Preopen Ports.
th: ในหน้าที่สี่ คุณสามารถตั้งค่าการกำหนดค่าเครือข่าย เช่น พอร์ตที่เปิดล่วงหน้า

source: Set Preopen Ports: Provides an interface for users to set preopen ports in a compute session. See the section :ref:`How to add preopen ports before session creation <set_preopen_ports>` on how to use.
th: ตั้งพอร์ตที่เปิดล่วงหน้า: ให้ความสามารถในการตั้งพอร์ตที่เปิดล่วงหน้าสำหรับผู้ใช้ในเซสชันการคอมพิวเตอร์ ดูส่วน :ref:`วิธีการเพิ่มพอร์ตที่เปิดล่วงหน้าก่อนการสร้างเซสชัน <set_preopen_ports>` เกี่ยวกับวิธีการใช้งาน.

source: If you are done with the network setting, click the Next button below, or the Confirm and Launch on the right to proceed to the last page.
th: หากคุณตั้งค่าเครือข่ายเสร็จแล้ว ให้คลิกปุ่มถัดไปด้านล่าง หรือ คลิกยืนยันและเริ่มต้นทางด้านขวาเพื่อดำเนินการไปยังหน้าสุดท้าย

source: Now, we have reached the last page. You can view information of session(s) to create, such as environment itself, allocated resources, mount information, environment variables set on the previous pages, preopen ports, etc. After confirming the settings, click the Launch button. If there's anything you'd like to change, you can return to the previous page by clicking the Previous button, or click the Edit button located at the top right of each card to go directly to the relevant page.
th: ตอนนี้เรามาถึงหน้าสุดท้ายแล้ว คุณสามารถดูข้อมูลของเซสชันที่สร้างขึ้น เช่น สภาพแวดล้อมโดยรวม ทรัพยากรที่จัดสรร ข้อมูลการติดตั้ง ตัวแปรสภาพแวดล้อมที่ตั้งค่าในหน้าก่อนหน้า พอร์ตที่เปิดล่วงหน้า ฯลฯ หลังจากยืนยันการตั้งค่าแล้ว ให้คลิกปุ่ม Launch หากมีสิ่งใดที่คุณต้องการเปลี่ยนแปลง คุณสามารถกลับไปยังหน้าก่อนหน้าโดยการคลิกปุ่ม Previous หรือคลิกปุ่ม Edit ที่ตั้งอยู่มุมขวาบนของแต่ละการ์ดเพื่อไปยังหน้าที่เกี่ยวข้องโดยตรง

source: If there is an issue with the settings, an error will be displayed as follows. Please click Edit to correct the settings.
th: หากมีปัญหาเกี่ยวกับการตั้งค่า จะแสดงข้อผิดพลาดดังนี้ โปรดคลิก แก้ไข เพื่อปรับแก้การตั้งค่า

source: In the RUNNING tab, you can check the information on the currently running sessions. It includes both interactive and batch sessions. BATCH tab and INTERACTIVE tab show only sessions corresponding to each type, but only for sessions not in terminated status. FINISHED tab shows the list of terminated sessions and OTHERS tab shows the compute sessions with errors. For each session, you can check the information such as session environments, the amount of allocated and used resources, session starting time, etc.
th: ในแท็บ RUNNING คุณสามารถตรวจสอบข้อมูลเกี่ยวกับเซสชันที่กำลังทำงานอยู่ในขณะนี้ ซึ่งรวมถึงเซสชันแบบโต้ตอบและแบบชุด แท็บ BATCH และแท็บ INTERACTIVE จะแสดงเฉพาะเซสชันที่ตรงกับแต่ละประเภท แต่เฉพาะสำหรับเซสชันที่ไม่อยู่ในสถานะสิ้นสุด แท็บ FINISHED แสดงรายชื่อเซสชันที่ถูกสิ้นสุดและแท็บ OTHERS แสดงเซสชันการคอมพิวเตอร์ที่มีข้อผิดพลาด สำหรับแต่ละเซสชัน คุณสามารถตรวจสอบข้อมูล เช่น สภาพแวดล้อมของเซสชัน ปริมาณทรัพยากรที่จัดสรรและใช้ไป เวลาเริ่มต้นของเซสชัน เป็นต้น

source: Superadmins can query all compute session information currently running (or terminated) in the cluster, and users can view only the sessions they have created.
th: ซูเปอร์แอดมินสามารถตรวจสอบข้อมูลเซสชันการคอมพิวเตอร์ทั้งหมดที่กำลังทำงานอยู่ (หรือลงท้าย) ในคลัสเตอร์ และผู้ใช้สามารถดูเฉพาะเซสชันที่พวกเขาได้สร้างขึ้นเท่านั้น

source: Compute session list may not be displayed normally due to intermittent network connection problems, and etc. This can be solved by refreshing the browser page.
th: รายการเซสชันการคอมพิวเตอร์อาจไม่แสดงผลตามปกติเนื่องจากปัญหาการเชื่อมต่อเครือข่ายที่ไม่สม่ำเสมอและอื่น ๆ สามารถแก้ไขได้โดยการรีเฟรชหน้าต่างเบราว์เซอร์

source: GPU Platform provides detailed status information for ``PENDING``, ``TERMINATED``, or ``CANCELLED`` sessions. In the case of ``PENDING`` sessions, in particular, you can check why the session is not scheduled and stuck in the ``PENDING`` status. You can see the details by clicking the question mark icon right next to the status of each session.
th: GPU Platform ให้ข้อมูลสถานะโดยละเอียดสำหรับเซสชันที่อยู่ในสถานะ ``PENDING`` , ``TERMINATED`` หรือ ``CANCELLED`` ในกรณีของเซสชันที่อยู่ในสถานะ ``PENDING`` โดยเฉพาะ คุณสามารถตรวจสอบได้ว่าทำไมเซสชันนั้นจึงไม่ได้ถูกกำหนดเวลาและติดอยู่ในสถานะ ``PENDING`` คุณสามารถดูรายละเอียดโดยการคลิกที่ไอคอนเครื่องหมายคำถามที่อยู่ถัดจากสถานะของแต่ละเซสชัน

source: The resource statistics are displayed at the top of the screen. You can check the amount of resources currently used and the total amount of resources that can be allocated. The display bars are divided into upper and lower parts. The upper part shows the resource allocation status in the current scaling group and the lower part shows the allocation status of total accessible resources.
th: สถิติของทรัพยากรถูกแสดงที่ด้านบนของหน้าจอ คุณสามารถตรวจสอบจำนวนทรัพยากรที่ใช้ไปในปัจจุบันและจำนวนทรัพยากรทั้งหมดที่สามารถจัดสรรได้ แถบการแสดงผลถูกแบ่งออกเป็นส่วนบนและส่วนล่าง ส่วนบนจะแสดงสถานะการจัดสรรทรัพยากรในกลุ่มการปรับขนาดปัจจุบันและส่วนล่างจะแสดงสถานะการจัดสรรทรัพยากรที่เข้าถึงได้ทั้งหมด

source: If the GPU resource is marked as FGPU, this means that the server is serving the GPU resources in a virtualized form. GPU Platform supports GPU virtualization technology that a single physical GPU can be divided and shared by multiple users for better utilization. Therefore, if you want to execute a task that does not require a large amount of GPU computation, you can create a compute session by allocating only a portion of a GPU. The amount of GPU resources that 1 FGPU actually allocates may vary from system to system depending on the administrator's setting.
th: ถ้าทรัพยากร GPU ถูกทำเครื่องหมายว่า FGPU หมายความว่าเซิร์ฟเวอร์กำลังให้บริการทรัพยากร GPU ในรูปแบบเสมือน GPU Platform สนับสนุนเทคโนโลยีการทำให้เสมือน GPU ที่ GPU ทางกายภาพเดียวสามารถถูกแบ่งและแชร์โดยผู้ใช้หลายคนเพื่อการใช้งานที่ดีกว่า ดังนั้นถ้าคุณต้องการดำเนินการงานที่ไม่ต้องการการคำนวณ GPU ขนาดใหญ่ คุณสามารถสร้างเซสชั่นการคำนวณโดยการจัดสรรเพียงแค่บางส่วนของ GPU จำนวนทรัพยากร GPU ที่ 1 FGPU แบ่งสรรจริงๆ อาจแตกต่างกันไปตามระบบขึ้นอยู่กับการตั้งค่าของผู้ดูแลระบบ

source: For example, if administrator has set to split one physical GPU into five pieces, 5 FGPU means 1 physical GPU, or 1 FGPU means 0.2 physical GPU. At this configuration, if you create a compute session by allocating 1 FGPU, you can utilize SM (streaming multiprocessor) and GPU memory corresponding to 0.2 physical GPU for the session.
th: ตัวอย่างเช่น หากผู้ดูแลระบบได้กำหนดให้แบ่ง GPU ทางกายภาพหนึ่งตัวออกเป็นห้าชิ้น 5 FGPU หมายถึง 1 GPU ทางกายภาพ หรือ 1 FGPU หมายถึง 0.2 GPU ทางกายภาพ ในการกำหนดค่าดังกล่าว หากคุณสร้างเซสชันการคำนวณโดยการจัดสรร 1 FGPU คุณจะสามารถใช้ SM (Streaming Multiprocessor) และหน่วยความจำ GPU ที่สอดคล้องกับ 0.2 GPU ทางกายภาพสำหรับเซสชันนั้นได้

source: Let's look at how to use and manage compute sessions that are already running. If you look at the Control panel of the session list, there are several icons. When you click the first icon, the app launcher pops up and shows the available app services as below. The app launcher dialog also opens automatically just after the compute session is created.
th: มาดูกันว่าจะแบ่งปันและจัดการเซสชันการคอมพิวเตอร์ที่กำลังทำงานอยู่ได้อย่างไร หากคุณมองที่แผงควบคุมของรายการเซสชัน จะมีไอคอนหลายอัน เมื่อคุณคลิกที่ไอคอนแรก หน้าต่างการเปิดแอปจะเด้งขึ้นและแสดงบริการแอปที่มีอยู่ตามด้านล่าง หน้าต่างการเปิดแอปจะเปิดขึ้นโดยอัตโนมัติหลังจากที่เซสชันการคอมพิวเตอร์ถูกสร้างขึ้น

source: Try preferred port: Without this option checked, a port number for the web service is randomly assigned from the port pool prepared in advance by GPU Platform. If you check this item and enter a specific port number, the entered port number will be tried first. However, there is no guarantee that the desired port will always be assigned because the port may not exist at all in the port pool or another service may already be using the port. In this case, the port number is randomly assigned.
th: ลองพอร์ตที่ต้องการ: หากไม่เลือกตัวเลือกนี้ หมายเลขพอร์ตสำหรับบริการเว็บจะถูกกำหนดแบบสุ่มจากกลุ่มพอร์ตที่เตรียมไว้ล่วงหน้าโดย GPU Platform หากคุณเลือกจุดนี้และป้อนหมายเลขพอร์ตเฉพาะ หมายเลขพอร์ตที่ป้อนจะถูกลองใช้ก่อน อย่างไรก็ตาม ไม่มีการรับประกันว่าพอร์ตที่ต้องการจะถูกกำหนดเสมอไป เนื่องจากพอร์ตอาจไม่มีอยู่ในกลุ่มพอร์ตเลยหรือบริการอื่นอาจใช้พอร์ตนั้นอยู่แล้ว ในกรณีนี้ หมายเลขพอร์ตจะถูกกำหนดแบบสุ่ม

source: A new window pops up and you can see that Jupyter Notebook is running. This notebook was created inside a running compute session and can be used easily with the click of a button without any other settings. Also, there is no need for a separate package installation process because the language environment and library provided by the computation session can be used as it is. For detailed instructions on how to use Jupyter Notebook, please refer to the official documentation.
th: มีหน้าต่างใหม่เด้งขึ้นมาและคุณสามารถเห็นว่า Jupyter Notebook กำลังทำงานอยู่ โน๊ตบุ๊คนี้ถูกสร้างขึ้นภายในเซสชันการคำนวณที่กำลังทำงานและสามารถใช้งานได้อย่างง่ายดายด้วยการคลิกเพียงปุ่มเดียวโดยไม่ต้องตั้งค่าอื่น ๆ นอกจากนี้ยังไม่จำเป็นต้องมีขั้นตอนการติดตั้งแพ็คเกจแยกต่างหากเพราะสภาพแวดล้อมของภาษาและไลบรารีที่จัดเตรียมโดยเซสชันการคำนวณสามารถใช้งานได้ตามปกติ สำหรับคำแนะนำโดยละเอียดเกี่ยวกับวิธีการใช้งาน Jupyter Notebook กรุณาอ้างอิงเอกสารทางการ

source: In the notebook's file explorer, the ``id_container file`` contains a private SSH key. If necessary, you can download it and use it for SSH / SFTP access to the container.
th: ในไฟล์สำรวจไฟล์ของโน้ตบุ๊ก ไฟล์ ``id_container`` จะมีคีย์ SSH ส่วนตัว หากจำเป็น คุณสามารถดาวน์โหลดมันและใช้สำหรับการเข้าถึง SSH / SFTP ไปยังคอนเทนเนอร์ได้

source: Click the NEW button at the top right and select the Notebook for GPU Platform, then the ipynb window appears where you can enter your own code.
th: คลิกที่ปุ่ม NEW ที่มุมขวาบนและเลือก Notebook สำหรับ GPU Platform จากนั้นหน้าต่าง ipynb จะปรากฏขึ้นซึ่งคุณสามารถป้อนโค้ดของคุณเองได้

source: In this window, you can enter and execute any code you want by using the environment that session provides. The code is executed on one of the GPU Platform nodes where the compute session is actually created and there is no need to configure a separate environment on the local machine.
th: ในหน้าต่างนี้ คุณสามารถป้อนและเรียกใช้โค้ดใดก็ได้ที่คุณต้องการโดยใช้สภาพแวดล้อมที่เซสชันจัดเตรียมไว้ โค้ดจะถูกเรียกใช้บนหนึ่งในโหนดของ GPU Platform ซึ่งเซสชันการคำนวณถูกสร้างขึ้นจริงและไม่จำเป็นต้องตั้งค่าสภาพแวดล้อมแยกต่างหากบนเครื่องท้องถิ่น

source: When you close the window, you can find that the ``Untitled.ipynb`` file is created in the notebook file explorer. Note that the files created here are deleted when you terminate the session. The way to preserve those files even after the session is terminated is described in the Data & Storage Folders section.
th: เมื่อคุณปิดหน้าต่าง คุณจะพบว่าไฟล์ ``Untitled.ipynb`` ถูกสร้างขึ้นในตัวสำรวจไฟล์โน้ตบุ๊ก โปรดทราบว่าไฟล์ที่สร้างขึ้นที่นี่จะถูกลบเมื่อคุณสิ้นสุดเซสชัน วิธีการรักษาไฟล์เหล่านั้นให้คงอยู่ แม้เมื่อเซสชันสิ้นสุดลงจะถูกอธิบายไว้ในส่วน Data & Storage Folders

source: Return to the Session list page. This time, let's launch the terminal. Click the terminal icon (the second button in the Control panel) to use the container's ttyd app. A terminal will appear in a new window and you can run shell commands to access the computational session as shown in the following figure. If you are familiar with using commands, you can easily run various Linux commands. You may notice that the ``Untitled.ipynb`` file automatically generated in Jupyter Notebook is listed with the ``ls`` command. This shows that both apps are running in the same container environment.
th: กลับไปที่หน้ารายการเซสชัน ในครั้งนี้ให้เราลองเรียกใช้เทอร์มินัล คลิกที่ไอคอนเทอร์มินัล (ปุ่มที่สองในแผงควบคุม) เพื่อใช้แอป ttyd ของคอนเทนเนอร์ เทอร์มินัลจะปรากฏในหน้าต่างใหม่และคุณสามารถรันคำสั่งเชลล์เพื่อเข้าถึงเซสชันการคำนวณได้ตามที่แสดงในรูปภาพด้านล่าง หากคุณคุ้นเคยกับการใช้คำสั่ง คุณสามารถรันคำสั่ง Linux ได้หลากหลายอย่างง่ายดาย คุณอาจสังเกตเห็นว่าไฟล์ ``Untitled.ipynb`` ที่สร้างขึ้นโดยอัตโนมัติใน Jupyter Notebook แสดงรายการอยู่ด้วยคำสั่ง ``ls`` ซึ่งแสดงให้เห็นว่าแอปทั้งสองกำลังทำงานในสภาพแวดล้อมของคอนเทนเนอร์เดียวกัน

source: If you create a file here, you can immediately see it in the Jupyter Notebook you opened earlier as well. Conversely, changes made to files in Jupyter Notebook can also be checked right from the terminal. This is because they are using the same files in the same compute session.
th: หากคุณสร้างไฟล์ที่นี่ คุณสามารถดูไฟล์นั้นได้ทันทีใน Jupyter Notebook ที่คุณเปิดก่อนหน้านี้เช่นกัน ในทางกลับกัน การเปลี่ยนแปลงที่ทำกับไฟล์ใน Jupyter Notebook ก็สามารถตรวจสอบได้จากเทอร์มินัลโดยตรง นี่เป็นเพราะพวกเขากำลังใช้ไฟล์เดียวกันในเซสชันการประมวลผลเดียวกัน
