Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sessions_all/sessions_all.po
Languages: ja, ko_kr, th

source: Superadmins can query all compute session information currently running (or terminated) in the cluster, and users can only view the sessions they have created.
ja: スーパーユーザーは、クラスタ内で現在実行中（または終了した）すべての計算セッション情報を照会できますが、ユーザーは自分が作成したセッションのみを表示できます。
ko_kr: 수퍼어드민의 경우 현재 클러스터에서 실행 중인 (또는 종료된) 모든 세션 정보를 확인할 수 있고, 일반 사용자의 경우에는 자신이 사용한 세션만 조회 가능합니다.

source: Compute session list may not be displayed normally due to intermittent network connection problems, and etc. This can be solved by refreshing the browser.
ja: 計算セッションのリストが、断続的なネットワーク接続の問題などにより正常に表示されない場合があります。これを解決するには、ブラウザをリフレッシュしてください。
ko_kr: 간헐적인 네트워크 접속 불량 등의 문제로 세션 리스트가 정상적으로 표시되지 않는 경우가 발생할 수 있습니다. 이 때는 브라우저 페이지를 새로고침하면 해결할 수 있습니다.

source: Backend.AI provides detailed status information for ``PENDING``, ``TERMINATED``, or ``CANCELLED`` sessions. In the case of ``PENDING`` sessions, in particular, you can check why the session is not scheduled and stuck in the ``PENDING`` status. You can see the details by clicking the question mark icon right next to the status of each session.
ja: Backend.AI は、``PENDING``、``TERMINATED``、または ``CANCELLED`` セッションの詳細なステータス情報を提供します。特に ``PENDING`` セッションの場合、セッションがスケジュールされずに ``PENDING`` ステータスのままとなっている理由を確認できます。各セッションのステータスのすぐ横にあるクエスチョンマークアイコンをクリックすると、詳細を確認できます。
ko_kr: Backend.AI 는 ``PENDING``, ``TERMINATED``, ``CANCELLED`` 세션에 대한 상세 상태 정보를 제공합니다. 특히, ``PENDING`` 세션의 경우, 세션이 스케줄링 되지 않고 ``PENDING`` 상태에 머물러 있는 이유를 알 수 있어 유용합니다. 상세 정보를 확인하려면, 각 세션 상태를 나타내는 부분 바로 옆에 있는 물음표 아이콘을 클릭하십시오.

source: The resource statistics are displayed at the top of the screen. Users can check the amount of resources currently used and the total amount of resources that can be allocated. Display bars are divided into upper and lower parts. The upper part shows the resource allocation status in the current scaling group and the lower part shows the allocation status of total accessible resources.
ja: リソース統計は画面の上部に表示されます。ユーザーは現在使用されているリソースの量と、割り当て可能なリソースの総量を確認できます。表示バーは上下の部分に分かれています。上部は現在のスケーリンググループにおけるリソースの割り当て状況を示し、下部は利用可能なリソースの総割り当て状況を示します。
ko_kr: 자원 통계는 화면 상단에 표시됩니다. 현재 사용중인 자원의 양과 할당 가능한 총 자원의 양을 확인할 수 있습니다. 디스플레이 바는 상단과 하단으로 나뉩니다. 상단은 현재 스케일링 그룹의 자원 할당 상태를 나타내고 하단은 접근 가능한 총 자원의 할당 상태를 나타냅니다.

source: Upper: (Resources allocated by the user in the current scaling group) / (Total resources allocatable by the user in the current scaling group)
ja: 上限: (現在のスケーリンググループでユーザーによって割り当てられたリソース) / (現在のスケーリンググループでユーザーが割り当て可能な総リソース)
ko_kr: (현재 스케일링 그룹 내에서 사용자가 할당한 자원의 양) / (현재 스케일링 그룹 내에 서 사용자 할당 가능한 자원의 총합)
th: บน: (ทรัพยากรที่ผู้ใช้กำหนดในกลุ่มการปรับขนาดปัจจุบัน) / (ทรัพยากรทั้งหมดที่ผู้ใช้สามารถกำหนดในกลุ่มการปรับขนาดปัจจุบัน)

source: Lower: (Resources allocated by the user) / (Resources allocated by the user + Total resources allocatable by the user in the current scaling group)
ja: 低い: (ユーザーによって割り当てられたリソース) / (ユーザーによって割り当てられたリソース + 現在のスケーリンググループでユーザーが割り当て可能なリソースの合計)
ko_kr: (사용자가 할당한 총 자원 양) / (사용자가 할당한 총 자원 양 + 현재 스케일링 그룹 내에서 사용자가 할당 가능한 자원의 총합)
th: ต่ำกว่า: (ทรัพยากรที่ผู้ใช้จัดสรร) / (ทรัพยากรที่ผู้ใช้จัดสรร + ทรัพยากรทั้งหมดที่สามารถจัดสรรโดยผู้ใช้ในกลุ่มการปรับขนาดปัจจุบัน)

source: Backend.AI supports GPU virtualization technology that a single physical GPU can be divided and shared by multiple users for better utilization. If the GPU resource is marked as FGPU, this means that the server is serving the GPU resources in a virtualized form. Therefore, if users want to execute a task that does not require a large amount of GPU computation, users can create a compute session by allocating only a portion of a GPU. The amount of GPU resources that 1 FGPU actually allocates may vary from system to system depending on the administrator's setting.
ja: Backend.AIは、単一の物理GPUを複数のユーザーで分割して共有することができるGPU仮想化技術をサポートしています。GPUリソースがFGPUとしてマークされている場合、これはサーバーがGPUリソースを仮想化された形で提供していることを意味します。したがって、ユーザーが大規模なGPU計算を必要としないタスクを実行したい場合、ユーザーはGPUの一部のみを割り当ててコンピュートセッションを作成できます。1 FGPUが実際に割り当てるGPUリソースの量は、管理者の設定によってシステムごとに異なる場合があります。
ko_kr: 만약 GPU 자원이 FGPU 로 표시되어 있다면, 이는 서버가 GPU 자원을 가상화된 형태로 제공하고 있다는 것을 의미합니다. Backend.AI 는 하나의 물리 GPU 를 여러 개로 분할해서 여러 사용자가 나누어 사용할 수 있는 가상화 기술을 지원하고 있습니다. 따라서, GPU 연산 소요가 크지 않은 작업을 수행하고자 할 경우에는 GPU 의 일부만 할당하여 연산 세션을 생성 할 수 있습니다. FGPU 가 실제로 할당하는 GPU 자원의 양은 관리자 설정에 따라 시스템 별로 다양할 수 있습니다.

source: For example, if administrator has set to split one physical GPU into five pieces, 5 FGPU means 1 physical GPU, or 1 FGPU means 0.2 physical GPU. At this configuration, if users create a compute session by allocating 1 FGPU, they can utilize SM (streaming multiprocessor) and GPU memory corresponding to 0.2 physical GPU for the session.
ja: たとえば、管理者が1つの物理GPUを5つの部分に分割するように設定している場合、5つのFGPUは1つの物理GPUを意味し、1つのFGPUは0.2の物理GPUを意味します。この設定で、ユーザーが1つのFGPUを割り当てて計算セッションを作成すると、そのセッションのために0.2の物理GPUに相当するSM（ストリーミングマルチプロセッサ）とGPUメモリを利用できます。
ko_kr: 예를 들어, 관리자가 하나의 GPU 를 다섯 조각으로 분할 설정한 경우, 5 FGPU 가 1 물리 GPU, 또는 1 FGPU 가 0.2 물리 GPU 를 뜻합니다. 이 때 1 FGPU 를 설정하여 연산 세션을 생성하면, 그 세션에서는 0.2 물리 GPU 에 해당하는 SM(streaming multiprocessor) 과 GPU 메모리를 활용할 수 있습니다.

source: See Session details
ja: セッションの詳細を見る
ko_kr: 세션 상세정보 확인하기

source: For detailed information on the session, click the session name in the session list. The session details page shows the information of the session, such as the session ID, status, type, environment, mount information, resource allocation, reserved time, elapsed time, and resource usage including network I/O.
ja: セッションに関する詳細情報は、セッションリストのセッション名をクリックしてください。セッション詳細ページでは、セッションID、ステータス、タイプ、環境、マウント情報、リソース割り当て、予約時間、経過時間、ネットワークI/Oを含むリソース使用状況など、セッションの情報が表示されます。
ko_kr: 세션에 대한 상세정보를 확인하려면, 세션 리스트의 세션명을 클릭하십시오. 세션 디테일 페이지는 세션ID, 타입, 실행환경, 마운트정보, 할당된 자원, 예약된 시간과, 경과 시간, 그리고 네트워크 I/O를 포함한 자원 사용량과 같은 세션 정보를 보여줍니다.

source: Use Jupyter Notebook
ja: Jupyter Notebook を使用する
ko_kr: Jupyter Notebook 사용하기
th: ใช้ Jupyter Notebook

source: This section is about isong and managing compute sessions that are already running. On Control panel, there are several icons in the session list. When users click the first icon, the app launcher pops up and shows the available app services as below. The app launcher dialog also opens automatically just after the compute session is created.
ja: このセクションは、すでに実行中のコンピュートセッションの使用と管理についてです。コントロールパネルには、セッションリストにいくつかのアイコンがあります。ユーザーが最初のアイコンをクリックすると、アプリランチャーがポップアップし、以下のように利用可能なアプリサービスが表示されます。コンピュートセッションが作成された直後にも、アプリランチャーダイアログが自動的に開きます。
ko_kr: 이미 실행 중인 연산 세션을 사용하고 관리하는 법에 관해 살펴보겠습니다. 세션 리스트의 Control 열을 보면 몇 가지 아이콘이 있습니다. 제일 첫 아이콘을 클릭하면 다음 그림과 같이 앱 런처가 뜨면서 해당 세션이 지원하는 몇 가지 앱 서비스가 뜨게 됩니다. 앱 런처 대화창은 연산 세션 생성 직후 자동으로 열리기도 합니다.

source: There are two check options under the app icons. Opening the app with each item checked applies the following features, respectively:
ja: アプリアイコンの下に2つのチェックオプションがあります。各項目にチェックを入れてアプリを開くと、次の機能がそれぞれ適用されます。
ko_kr: 앱 아이콘 아래에는 두 가지 체크 옵션이 있습니다. 각 항목을 체크하고 앱을 띄우면 다음과 같은 기능이 반영됩니다:
th: มีตัวเลือกตรวจสอบสองตัวเลือกใต้ไอคอนแอป การเปิดแอปด้วยแต่ละรายการที่เลือกจะใช้คุณลักษณะต่อไปนี้ตามลำดับ:

source: Open app to public: Open the app to the public. Basically, web services such as Terminal and Jupyter Notebook services are not accessible by other users, even if the user knows the service URL, since they are considered unauthenticated. However, checking this option makes it possible for anyone who knows the service URL (and port number) to access and use it. Of course, the user must have a network path to access the service.
ja: アプリを公開する: アプリを一般に公開します。基本的に、Terminal や Jupyter Notebook サービスなどのウェブサービスは、認証されていないと見なされるため、たとえユーザーがサービス URL を知っていても他のユーザーがアクセスできません。ただし、このオプションをチェックすると、サービスの URL (およびポート番号) を知っている人であれば誰でもアクセスして使用することが可能になります。もちろん、ユーザーはサービスにアクセスするためのネットワークパスを持っている必要があります。
ko_kr: Open app to public : 앱을 외부에 공개합니다. 기본적으로 터미널 및 Jupyter Notebook 서비스와 같은 웹 서비스는 별도 인증을 거치므로 서비스 URL을 알고 있더라도 다른 사용자가 액세스 할 수 없습니다. 그러나 이 옵션을 선택하면 서비스 URL(및 포트 번호)을 아는 사람이 접근하고 사용할 수 있습니다. 물론 사용자가 서비스에 접근하려면 네트워크 경로가 있어야합니다.
th: เปิดแอปให้กับสาธารณะ: เปิดแอปให้กับสาธารณะ โดยพื้นฐานแล้ว บริการเว็บเช่น Terminal และ Jupyter Notebook จะไม่สามารถเข้าถึงได้โดยผู้ใช้รายอื่น แม้ว่าผู้ใช้จะทราบ URL ของบริการก็ตาม เนื่องจากถือว่าไม่มีการตรวจสอบสิทธิ์ อย่างไรก็ตาม การตรวจสอบตัวเลือกนี้ทำให้ใครก็ตามที่ทราบ URL ของบริการ (และหมายเลขพอร์ต) สามารถเข้าถึงและใช้งานได้ แน่นอนว่าผู้ใช้ต้องมีเส้นทางเครือข่ายเพื่อเข้าถึงบริการนั้น

source: Try preferred port: Without this option checked, a port number for the web service is randomly assigned from the port pool prepared in advance by Backend.AI. If you check this item and enter a specific port number, the entered port number will be tried first. However, there is no guarantee that the desired port will always be assigned because the port may not exist at all in the port pool or another service may already be using the port. In this case, the port number is randomly assigned.
ja: 優先ポートを試す: このオプションをチェックしない場合、Webサービスのポート番号はBackend.AIによって事前に用意されたポートプールからランダムに割り当てられます。この項目にチェックを入れ、特定のポート番号を入力した場合は、まずそのポート番号が試されます。しかし、ポートプールにそのポートが存在しない場合や、他のサービスがすでにそのポートを使用している場合があるため、必ずしも希望するポートが割り当てられる保証はありません。この場合、ポート番号はランダムに割り当てられます。
ko_kr: Try preferred port: 이 옵션을 선택하지 않으면 Backend.AI에서 미리 준비한 포트 풀에서 웹 서비스의 포트 번호가 무작위로 할당됩니다. 이 항목을 체크하고 특정 포트 번호를 입력하면 입력한 포트 번호를 먼저 시도합니다. 그러나 포트가 포트 풀에 존재하지 않거나 다른 서비스가 이미 포트를 사용 중일 수 있기 때문에 원하는 포트가 항상 할당된다는 보장은 없습니다. 이 경우 포트 번호는 임의로 할당됩니다.

source: Depending on the system configuration, these options may not be shown.
ja: システムの構成によっては、これらのオプションが表示されない場合があります。
ko_kr: 시스템 설정에 따라, 이 옵션들은 보이지 않을 수도 있습니다.
th: ขึ้นอยู่กับการตั้งค่าของระบบ ตัวเลือกเหล่านี้อาจไม่แสดงออกมา

source: Let's click on Jupyter Notebook.
ja: Jupyter Notebook をクリックしましょう。
ko_kr: Jupyter Notebook 을 클릭해봅시다.
th: ให้คลิกที่ Jupyter Notebook

source: Pop up windows will show that Jupyter Notebook is running. This notebook was created inside a running compute session and can be used easily with the click of a button. Also, there is no need for a separate package installation process because the language environment and library provided by the computation session can be used as it is. For detailed instructions on how to use Jupyter Notebook, please refer to the official Jupyter Notebook documentation.
ja: ポップアップウィンドウが表示され、Jupyter Notebook が実行中であることを示します。このノートブックは実行中のコンピュートセッション内で作成されており、ボタンをクリックするだけで簡単に使用できます。また、言語環境やライブラリは計算セッションで提供されるものをそのまま使用できるため、別途パッケージインストールプロセスを必要としません。Jupyter Notebook の使い方についての詳細な手順は、公式の Jupyter Notebook ドキュメントを参照してください。
ko_kr: 새로운 창이 뜨면서 Jupyter Notebook 이 실행되는 것을 확인할 수 있습니다. 이 Notebook 은 실행 중인 연산 세션 내부에서 생성된 것으로, 별다른 설정 없이 버튼 클릭만으로 손쉽게 사 용할 수 있습니다. 또한, 연산 세션이 기본적으로 제공하는 언어 환경 및 라이브러리를 그대로 활용할 수 있어 별도의 패키지 설치 과정이 필요 없습니다. 자세한 Jupyter Notebook 사용 법은 공식 문서 등을 참고하시기 바랍니다.

source: ``id_container file`` in the notebook's file explorer, contains a private SSH key. If necessary, users can download it and use it for SSH / SFTP access to the container.
ja: ノートブックのファイルエクスプローラーにある``id_containerファイル``には、プライベートSSHキーが含まれています。必要であれば、ユーザーはこれをダウンロードし、コンテナへのSSH / SFTPアクセスに利用できます。
ko_kr: Notebook 의 파일 탐색기에서 ``id_container`` 파일은 private SSH key 를 담고 있습니다. 필요할 경우 다운로드 하여 컨테이너로의 SSH/SFTP 접속에 이용할 수 있습니다.

source: Click the 'NEW' button at the top right and select the Notebook for Backend.AI, then the ipynb window appears where users can enter their own code.
ja: 右上の「NEW」ボタンをクリックし、Backend.AIのノートブックを選択すると、ユーザーが自分のコードを入力できるipynbウィンドウが表示されます。
ko_kr: 우측 상단의 NEW 버튼을 클릭한 후 Backend.AI 용 Notebook 을 선택하면 새로운 코드를 입력할 수 있는 ipynb 창이 뜹니다.

source: In this window, users can enter and execute any code that they want by using the environment that session provides. The code is executed on one of the Backend.AI nodes where the compute session is actually created and there is no need to configure a separate environment on the local machine.
ja: このウィンドウでは、ユーザーはセッションが提供する環境を使用して、任意のコードを入力および実行できます。コードは、実際にコンピュータセッションが作成されるBackend.AIノードのいずれかで実行され、ローカルマシンで別の環境を設定する必要はありません。
ko_kr: 이 창에서 세션 환경에 맞는 코드를 입력하고 실행해볼 수 있습니다. 코드는 Backend.AI 서버를 구성하는 노드 중 연산 세션이 실제로 생성된 노드에서 실행이 되며, 로컬 머신에는 별도 환경을 구성할 필요가 없습니다.

source: When window is closed, ``Untitled.ipynb`` file can be founded in the notebook file explorer. Note that the files created here are deleted when session is terminated. The way to preserve those files even after the session is terminated is described in the Data & Storage Folders section.
ja: ウィンドウを閉じると、``Untitled.ipynb``ファイルはノートブックファイルエクスプローラーに見つけることができます。ここで作成されたファイルは、セッションが終了すると削除されることに注意してください。セッションが終了した後でもこれらのファイルを保持する方法は、「データとストレージフォルダー」セクションに記載されています。
ko_kr: 창을 닫으면 Notebook 파일 탐색기에 방금 작업한 ``Untitled.ipynb`` 파일이 생성되어 있는 것을 확인할 수 있습니다. 여기 생성된 파일은 세션을 삭제할 경우 같이 삭제되는 것에 주의하십시오. 생성된 파일을 세션이 사라지더라도 보존하는 방법은 폴더 섹션에서 설명합니다.

source: Use web terminal
ja: ウェブターミナルを使用する
ko_kr: 웹 터미널 활용
th: ใช้เทอร์มินัลเว็บ

source: This section will explain how to use the web terminal. Click the terminal icon(second button in the Control panel) to use the container's ttyd app. A terminal will appear in a new window and users can run shell commands to access the computational session as shown in the following figure. If familiar with the commands, users can easily run various Linux commands. ``Untitled.ipynb`` file can be found in Jupyter Notebook, which is listed with the ``ls`` command. This shows that both apps are running in the same container environment.
ja: このセクションでは、ウェブターミナルの使い方を説明します。コンテナの ttyd アプリを使用するには、コントロールパネルのターミナルアイコン（2番目のボタン）をクリックします。新しいウィンドウにターミナルが表示され、ユーザーはシェルコマンドを実行して計算セッションにアクセスできます。コマンドに慣れている場合は、さまざまな Linux コマンドを簡単に実行できます。 ``Untitled.ipynb`` ファイルは Jupyter Notebook にあり、``ls`` コマンドでリストされます。これにより、両方のアプリケーションが同じコンテナ環境で実行されていることが示されています。
ko_kr: 세션 목록 페이지로 돌아갑니다. 이번에는 터미널을 시작하겠습니다. 컨테이너의 ttyd 앱을 사용하려면 터미널 아이콘(제어판의 두 번째 버튼)을 클릭합니다. 터미널이 새 창에 나타나고 다음 그림과 같이 셸 명령을 실행하여 연산 세션에 접근 할 수 있습니다. 명령 사용에 익숙하다면 다양한 Linux 명령을 쉽게 실행할 수 있습니다. Jupyter Notebook에서 자동으로 생성 된 ``Untitled.ipynb`` 파일이 ``ls`` 명령과 함께 나열되는 것을 볼 수 있습니다. 이는 두 앱이 동일한 컨테이너 환경에서 실행되고 있음을 보여줍니다.

source: Files created here can also be immediately seen in the Jupyter Notebook as well. Conversely, changes made to files in Jupyter Notebook can also be checked right from the terminal. This is because they are using the same files in the same compute session.
ja: ここで作成されたファイルは、Jupyter Notebookでもすぐに確認できます。逆に、Jupyter Notebookでファイルに加えた変更も、ターミナルから直接確認することができます。これは、同じコンピュートセッションで同じファイルを使用しているためです。
ko_kr: 만약 여기서 파일을 만들면 앞서 띄운 Jupyter Notebook 에서 즉시 그 파일을 확인할 수 있 습니다. 반대로, Jupyter Notebook 에서 편집한 파일의 변경 사항도 터미널에서 바로 확인할 수 있습니다. 같은 연산 세션을 사용하고 있기 때문입니다.

source: In addition to this, users can use web-based services such as TensorBoard, Jupyter Lab, etc., depending on the type of environments provided by the compute session.
ja: これに加えて、ユーザーは、計算セッションが提供する環境のタイプに応じて、TensorBoard、Jupyter Labなどのウェブベースのサービスを利用できます。
ko_kr: 이 외에도 연산 세션이 제공하는 서비스의 종류에 따라 TensorBoard, Jupyter Lab 등과 같은 웹 기반 서비스를 이용할 수 있습니다.

source: Query compute session log
ja: コンピュートセッションログをクエリする
ko_kr: 연산 세션 로그 조회
th: บันทึกเซสชันการคำนวณของการค้นหา

source: Users can view the log of the compute session by clicking the last icon in the Control panel of the running compute session.
ja: ユーザーは、実行中の計算セッションのコントロールパネルで最後のアイコンをクリックすることにより、計算セッションのログを確認できます。
ko_kr: 돌아가고 있는 연산 세션의 Control 열의 마지막 아이콘을 클릭하면 연산 세션의 로그를 조회할 수 있습니다.

source: From 22.09, users can download session log by clicking download button on upper-right side of the dialog. This feature is helpful for tracking artifacts.
ja: 2022年9月22日から、ユーザーはダイアログの右上にあるダウンロードボタンをクリックすることで、セッションログをダウンロードできるようになります。この機能は、アーティファクトの追跡に役立ちます。
ko_kr: 22.09 버전부터, 다이얼로그 우상단에 위치한 다운로드 버튼을 클릭해 세션 컨테이너 로그를 내려받을 수 있습니다. 이 기능은 산출물 추적에 유용하게 사용됩니다.

source: Rename running session
ja: 実行中のセッションの名前を変更
ko_kr: 실행중인 세션 이름 변경하기
th: เปลี่ยนชื่อเซสชันที่กำลังรัน

source: Name of the active session can be changed. Click the 'Edit' icon in the session information column. Write down a new name and click the 'Confirm' button. New session name should also follow the :ref:`the authoring rule<session-naming-rule>`.
ja: アクティブセッションの名前は変更できます。セッション情報列の「編集」アイコンをクリックします。新しい名前を書き込み、「確認」ボタンをクリックします。新しいセッション名も :ref:`作成規則<session-naming-rule>` に従う必要があります。
ko_kr: 활성 상태에 있는 세션 이름을 변경할 수 있습니다. 세션 정보 열에 있는 편집 아이콘을 클릭한 후 새 이름을 입력하고 확인 버튼을 누르기만 하면 됩니다. 다만, 새로운 세션 이름도 :ref:`세션 이름 작성 규칙<session-naming-rule>` 은 따라야 합니다.

source: Delete a compute session
ja: コンピュートセッションを削除
ko_kr: 연산 세션 삭제하기
th: ลบเซสชันการคอมพิวเตอร์

source: To terminate a specific session, simply click on the red power icon and click OKAY button in the dialog. Since the data in the folder inside the compute session is deleted as soon as the compute session ends, it is recommended to move the data to the mounted folder or upload it to the mounted folder from the beginning.
ja: 特定のセッションを終了するには、赤い電源アイコンをクリックし、ダイアログでOKAYボタンをクリックします。計算セッションが終了すると、計算セッション内のフォルダにあるデータはすぐに削除されるため、データをマウントされたフォルダに移動するか、最初からマウントされたフォルダにアップロードすることをお勧めします。
ko_kr: 특정 세션을 삭제하기 위해서는 빨간색 전원 아이콘을 누르면 됩니다. 연산 세션 내부 폴더의 데이터는 연산 세션이 종료되는 순간 같이 삭제되므로, 계속 유지해야 하는 데이터라면 마운트 한 폴더에 옮기거나 처음부터 폴더에 업로드하는 것을 권합니다.

source: Idleness Checks
ja: アイドル状態のチェック
ko_kr: 유휴 상태 검사
th: การตรวจสอบความไม่กระตือรือร้น

source: Backend.AI supports three types of inactivity (idleness) criteria for automatic garbage collection of compute sessions: Max Session Lifetime, Network Idle Timeout, and Utilization Checker.
ja: Backend.AIは、コンピュートセッションの自動ガベージコレクションのために、最大セッションの有効期間、ネットワークアイドルタイムアウト、利用率チェッカーの3種類の非アクティブ状態（アイドル）基準をサポートしています。
ko_kr: Backend.AI는 최대 세션 수명 시간, 네트워크 트래픽 기반 유휴 시간, 사용량 기반 자원 수거를 기준으로 세션이 자동으로 삭제될 수 있습니다.

source: Idle checkers(inactivity criterion) will be displayed in the idle checks column of the session list.
ja: アイドルチェッカー（非アクティブ基準）は、セッションリストのアイドルチェック列に表示されます。
ko_kr: 연산 세션 종료 기준은 유휴 상태 검사 컬럼에서 확인할 수 있습니다.
th: ตัวตรวจสอบที่ไม่ทำงาน (เกณฑ์การไม่มีการใช้งาน) จะแสดงในคอลัมน์การตรวจสอบความไม่ทำงานของรายการเซสชัน

source: The meaning of idle checkers are as follows, and more detailed explanations can be found by clicking the information (i) icon in the idle checks column.
ja: アイドルチェッカーの意味は以下の通りであり、詳細な説明はアイドルチェック列の情報 (i) アイコンをクリックすることで確認できます。
ko_kr: 각 항목의 의미는 다음과 같으며, 우측의 정보(i) 버튼을 클릭해서 자세한 설명을 확인할 수도 있습니다.
th: ความหมายของตัวตรวจสอบที่ไม่ทำงานมีดังนี้ และคำอธิบายเพิ่มเติมสามารถดูได้โดยคลิกที่ไอคอนข้อมูล (i) ในคอลัมน์การตรวจสอบที่ไม่ทำงาน

source: Max Session Lifetime: Force-terminate sessions after this time from creation. This measure prevents sessions from running indefinitely.
ja: 最大セッション寿命: 作成からこの時間経過後にセッションを強制終了します。この対策により、セッションが無期限に実行されることを防ぎます。
ko_kr: 최대 세션 수명 시간: 세션 생성 후 이 시간이 지나면 세션을 강제 종료합니다. 이는 세션이 무한히 실행되는 것을 방지하기 위한 조치입니다.
th: อายุการใช้งานเซสชันสูงสุด: บังคับยุติเซสชันหลังจากเวลานี้นับตั้งแต่การสร้าง มาตรการนี้ป้องกันไม่ให้เซสชันทำงานต่อไปไม่มีที่สิ้นสุด

source: Network Idle Timeout: Force-terminate sessions that do not exchange data with the user (browser or web app) after this time. Traffic between the user and the compute session continuously occurs when the user interacts with an app, like terminal or Jupyter, by keyboard input, Jupyter cell creation, etc. Jupyter cell creation, etc. If there is no interaction for a certain period, the condition of garbage collection will be met. Even if there is a process executing a job in the compute session, it is subject to termination if there is no user interaction.
ja: ネットワークアイドルタイムアウト: この時間が経過すると、ユーザー（ブラウザやウェブアプリ）とデータを交換しないセッションを強制終了します。ユーザーがアプリと対話する際、例えばキーボード入力やJupyterセルの作成などを通じて、ユーザーと計算セッション間で継続的にトラフィックが発生します。一定期間、相互作用がない場合、ガベージコレクションの条件が満たされます。計算セッション内でジョブを実行しているプロセスがあったとしても、ユーザーの相互作用がない場合は終了の対象となります。
ko_kr: 네트워크 트래픽 기반 유휴 시간: 사용자(브라우저)와 연산 세션 사이에 이 시간 동안 아무런 네트워크 트래픽이 없을 경우 연산 세션을 삭제합니다. 사용자와 연산 세션 사이의 트래픽은 앱 (터미널, Jupyter 등)을 통해 상호작용(키보드 입력, Jupyter 셀 생성 등) 하는 경우 지속적으로 발생합니다. 만약, 연산 세션을 띄운 채 일정 시간 동안 아무런 입력을 하지 않으면 자동 삭제 조건을 만족하게 됩니다. 연산 세션에서 작업을 수행 중인 프로세스가 있더라도, 사용자와의 상호작용이 없는 경우에는 삭제 대상입니다.
th: การหมดเวลาขณะว่างในการเชื่อมต่อเครือข่าย: บังคับยกเลิกเซสชันที่ไม่ได้แลกเปลี่ยนข้อมูลกับผู้ใช้ (เบราว์เซอร์หรือแอปเว็บ) หลังจากเวลานี้ การรับส่งข้อมูลระหว่างผู้ใช้และเซสชันการคอมพิวเตอร์จะเกิดขึ้นอย่างต่อเนื่องเมื่อผู้ใช้โต้ตอบกับแอป เช่น เทอร์มินัลหรือ Jupyter โดยการพิมพ์จากแป้นพิมพ์ การสร้างเซลล์ Jupyter ฯลฯ การสร้างเซลล์ Jupyter ฯลฯ หากไม่มีการโต้ตอบเป็นระยะเวลาหนึ่ง สภาวะการเก็บขยะจะถูกตอบสนอง แม้ว่าจะมีการประมวลผลที่กำลังดำเนินการงานในเซสชันการคอมพิวเตอร์ แต่ก็จะต้องถูกยกเลิกหากไม่มีการโต้ตอบจากผู้ใช้

source: Utilization Checker: Resources allocated to a compute session are reclaimed based on the utilization of those resources. The decision to delete is based on the following two factors:
ja: 利用率チェッカー: コンピュートセッションに割り当てられたリソースは、それらのリソースの利用率に基づいて回収されます。削除の決定は次の2つの要因に基づいています:
ko_kr: 사용량 기반 자원 수거: 연산 세션에 할당된 자원을 자원의 활용률을 기준으로 회수합니다. 연산 세션의 삭제 여부는 다음 두 가지 요소에 따라 결정됩니다:
th: Utilization Checker: ทรัพยากรที่ถูกจัดสรรให้กับเซสชันการคอมพิวเตอร์จะถูกเรียกคืนตามการใช้ทรัพยากรเหล่านั้น การตัดสินใจในการลบขึ้นอยู่กับสองปัจจัยดังต่อไปนี้:

source: Grace Period: The time during which the utilization idle checker is inactive. Even with low usage, the compute session won't be terminated during this period. However, once the grace period is over, if the average utilization remain below the threshold during the set idle timeout period, the system can terminate the session at any time. The grace period is merely a guaranteed duration during which termination does not occur. This measure is primarily for efficient management of low-usage GPU resources.
ja: 猶予期間: 利用率アイドルチェッカーが無効化されている期間。この期間中は使用率が低くても計算セッションは終了されません。しかし、猶予期間が終了した後、設定されたアイドルタイムアウト期間中に平均利用率が閾値を下回った場合、システムはいつでもセッションを終了することができます。猶予期間は終了が発生しないことが保証される期間にすぎません。この措置は主に低利用のGPUリソースの効果的な管理を目的としています。
ko_kr: 유예 기간: 이 기간 동안은 자원 사용량 기반 체커가 작동하지 않습니다. 즉, 유예 기간이 지나기 전까지는 사용량이 기준보다 낮더라도 연산 세션이 삭제되지 않습니다. 하지만 유예 기간이 지나고 나면, 설정된 유휴 시간(idle timeout) 동안의 평균 자원 사용률이 기준에 미치지 못하는 경우 해당 세션이 삭제될 수 있습니다. 유예 기간은 세션 종료가 이루어지지 않는 것을 보장하는 시간일 뿐입니다. 이는 주로 사용률이 낮은 GPU 자원을 효율적으로 관리하기 위한 조치입니다.
th: ระยะเวลาผ่อนผัน: ช่วงเวลาที่ตัวตรวจสอบการใช้งานที่ไม่ได้ใช้งานจะไม่ทำงาน แม้ว่าจะมีการใช้งานต่ำ เซสชันการคอมพิวเตอร์จะไม่ถูกยุติในระยะเวลานี้ อย่างไรก็ตาม เมื่อตัวระยะเวลาผ่อนผันสิ้นสุดลง หากการใช้งานเฉลี่ยยังคงต่ำกว่าค่ากำหนดในช่วงเวลารอที่ตั้งไว้ ระบบสามารถยุติเซสชันได้ตลอดเวลา ระยะเวลาผ่อนผันเป็นช่วงเวลาที่รับประกันเท่านั้นที่การยุติจะไม่เกิดขึ้น มาตรการนี้มีจุดประสงค์หลักเพื่อการจัดการทรัพยากร GPU ที่มีการใช้งานต่ำอย่างมีประสิทธิภาพ

source: Utilization Threshold: If the resource utilization of a compute session does not exceed the set threshold for a certain duration (idle timeout), that session will be automatically terminated. For example, if the accelerator utilization threshold is set to 1%, and a compute session shows a utilization of less than 1% over the idle timeout, it becomes a target for termination. Resources with empty values are excluded from the garbage collection criteria.
ja: 利用率閾値: コンピュートセッションのリソース利用率が一定期間（アイドルタイムアウト）設定された閾値を超えない場合、そのセッションは自動的に終了されます。例えば、アクセラレーター利用率の閾値が1%に設定されている場合、コンピュートセッションの利用率がアイドルタイムアウト中に1%未満であれば、終了の対象となります。空の値を持つリソースは、ガーベジコレクションの基準から除外されます。
ko_kr: 자원 사용량 기준: 연산 세션의 자원 사용량이 일정 시간(idle timeout) 동안 설정된 기준값을 넘지 못하면, 해당 세션은 자동으로 삭제됩니다. 예를 들어, 가속 장치 사용률 기준을 1%로 설정했다면 idle timeout 시간 동안 평균 가속 장치 사용률이 1% 미만인 연산 세션은 삭제 대상이 됩니다. 값이 설정되지 않는 자원은 자동 삭제 기준에서 제외됩니다.

source: After the grace period, sessions can be terminated anytime if utilization remains low. Briefly using the resources does not extend the grace period. Only the average utilization over the last idle timeout is considered.
ja: 猶予期間が過ぎると、利用率が低いままである場合にはセッションがいつでも終了される可能性があります。リソースを一時的に使用しても、猶予期間は延長されません。直近のアイドルタイムアウトにおける平均利用率のみが考慮されます。
ko_kr: 유예 기간이 지난 후에는 사용량이 낮으면 언제든지 삭제될 수 있습니다. 자원을 잠깐 사용했다고 해서 유예 기간이 연장되지 않습니다. 오직 현 시점으로부터 지난 idle timeout 시간 동안의 평균 자원 사용률만이 고려됩니다.
th: หลังจากช่วงเวลาให้อภัย เซสชันสามารถถูกยกเลิกได้ทุกเมื่อหากการใช้งานยังคงต่ำ การใช้ทรัพยากรอย่างสั้นๆ จะไม่ขยายช่วงเวลาให้อภัย จะพิจารณาเฉพาะการใช้งานเฉลี่ยในช่วงเวลาไม่ใช้งานล่าสุดเท่านั้น
