Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sessions_all/sessions_all.po
Languages: ja, ko_kr, th

source: Compute Sessions
ja: コンピュートセッション
ko_kr: 연산 세션
th: เซสชันการคอมพิวเตอร์

source: The most visited pages in the Backend.AI WebUI would be the 'Sessions' and 'Data & Storage' pages. This document will cover how to query and create container-based compute sessions and utilize various web applications on the 'Sessions' page.
ja: Backend.AI WebUIで最も訪問されるページは、「セッション」と「データ＆ストレージ」ページです。この文書では、コンテナベースのコンピュートセッションをクエリして作成する方法と、「セッション」ページでさまざまなWebアプリケーションを利用する方法について説明します。

source: Start a new session
ja: 新しいセッションを開始
ko_kr: 새로운 세션 시작하기
th: เริ่มเซสชันใหม่

source: After logging in with a user account, click 'Sessions' on the left sidebar. 'Sessions' page lets you start new sessions or use and manage existing running sessions.
ja: ユーザーアカウントでログインした後、左のサイドバーで「セッション」をクリックします。「セッション」ページでは、新しいセッションを開始したり、既存の実行中のセッションを使用および管理することができます。
ko_kr: 사용자 계정으로 로그인 후 좌측 메뉴의 Sessions 를 클릭하여 Sessions 페이지로 이동합니다. Sessions 페이지는 새로운 연산 세션을 시작하거나 이미 실행 중인 연산 세션을 관리할 때 사용할 수 있습니다.

source: From version 24.09, improved version of the session launcher (NEO) is set to default. This enables user to create, manage sessions according to the step-by-step logic. To use dialog-style old version of the session launcher, please refer to :ref:`User Setting Guide <general-settings>`. For more instructions, please refer to the following `link <https://webui.docs.backend.ai/en/23.09_a/sessions_all/sessions_all.html>`_.
ja: バージョン24.09から、セッションランチャー（NEO）の改善版がデフォルトとして設定されています。これにより、ユーザーは段階的なロジックに従ってセッションを作成および管理することができます。ダイアログスタイルの古いバージョンのセッションランチャーを使用するには、:ref:`ユーザー設定ガイド <general-settings>`を参照してください。詳細な指示については、以下の`リンク <https://webui.docs.backend.ai/en/23.09_a/sessions_all/sessions_all.html>`_を参照してください。
ko_kr: Backend.AI 24.09 버전부터는 세션 런처(NEO)의 개선된 버전을 기본 런처로 제공합니다. 이전의 대화식 세션 런처를 사용하고 싶다면, :ref:`사용자 설정 가이드 <general-settings>` 를 참고하세요. 이전의 대화식 세션 런처의 사용방법에 대한 자세한 내용은 다음 `링크 <https://webui.docs.backend.ai/ko/23.09_a/sessions_all/sessions_all.html>`_ 를 참고하세요.

source: Click the 'START' button to start a new compute session.
ja: 'START'ボタンをクリックして、新しいコンピュートセッションを開始します。
ko_kr: 새로운 연산 세션을 시작하려면 START 버튼을 클릭하세요.

source: In the first page, users can select the type of session, 'interactive' or 'batch'. If needed, setting the name of the session (optional) is also available.
ja: 最初のページでは、ユーザーはセッションのタイプを「インタラクティブ」または「バッチ」から選択できます。必要に応じて、セッション名の設定（オプション）も可能です。
ko_kr: 첫 번째 페이지에서는 세션의 형태인 interactive 또는 batch 를 선택해야 합니다. 그리고 세션 이름을 지정할 수 있습니다. (선택사항)

source: Session type: Determines the type of the session. There are two different types of session, \"Interactive\" and \"Batch\". The following are the primary distinctions between the two types:
ja: セッションタイプ: セッションのタイプを決定します。セッションには「インタラクティブ」と「バッチ」の2つの異なるタイプがあります。以下は、2つのタイプの主な違いです:
ko_kr: Session type: 세션의 형태를 결정합니다. 현재 가능한 세션 형태는 “Interactive” 와 “Batch” 두 가지가 있습니다. 두 형태의 주요한 차이점은 다음과 같습니다:

source: Interactive compute session
ja: インタラクティブ計算セッション
ko_kr: Interactive 형태 연산 세션
th: ช่วงการคำนวณแบบโต้ตอบ

source: This is the type which has been supported from the initial version of the Backend.AI.
ja: これはBackend.AIの初期バージョンからサポートされているタイプです。
ko_kr: Backend.AI 초기 버전부터 지원하던 형태입니다.

source: The compute session is used in a way that the user interacts with after creating a session without specifying a pre-defined execution script or command.
ja: コンピュートセッションは、ユーザーが事前定義された実行スクリプトやコマンドを指定せずにセッションを作成した後に対話する方法で使用されます。
ko_kr: 사용자가 별도의 실행 스크립트를 지정하지 않고 일단 세션을 생성한 후 상호 작용하는 방식으로 세션을 사용하게 됩니다.
th: เซสชันการคอมพิวเตอร์ถูกใช้งานในลักษณะที่ผู้ใช้มีปฏิสัมพันธ์หลังจากสร้างเซสชันโดยไม่ต้องระบุสคริปต์หรือคำสั่งการดำเนินการที่กำหนดไว้ล่วงหน้า

source: The session is not terminated automatically unless user explicitly destroys the session or session garbage collectors are set by the admin.
ja: セッションは、ユーザーが明示的にセッションを破壊するか、または管理者によってセッションガーベジコレクタが設定されない限り、自動的に終了しません。
ko_kr: 사용자가 명시적으로 삭제하지 않는 한 세션은 자동 삭제되지 않습니다. 다만, 관리자가 별도의 세션 자동 수거 설정을 켜둔 경우에는, 그 조건에 따라 자동으로 삭제될 수도 있습니다.
th: เซสชันจะไม่ถูกยกเลิกโดยอัตโนมัติ เว้นแต่ผู้ใช้จะทำการทำลายเซสชันอย่างชัดเจนหรือผู้ดูแลระบบตั้งค่าโปรแกรมทำความสะอาดเซสชัน

source: Batch compute session
ja: バッチ計算セッション
ko_kr: Batch 형태 연산 세션
th: เซสชันการคำนวณแบบชุด

source: This type of session is supported via GUI from Backend.AI 22.03 (CLI has supported the batch-type session before the 22.03).
ja: このタイプのセッションは、Backend.AI 22.03からGUIを通じてサポートされています（CLIは22.03以前からバッチタイプのセッションをサポートしていました）。
ko_kr: Backend.AI 22.03 부터 GUI 를 통해 제공합니다. 다만, CLI 의 경우에는 그 이전부터 지원하고 있었습니다.

source: Pre-define the script that will be executed when a compute session is ready.
ja: 計算セッションの準備が整ったときに実行されるスクリプトを事前定義します。
ko_kr: 사용자가 연산 세션을 생성할 때 실행할 스크립트를 미리 지정합니다.
th: กำหนดสคริปต์ล่วงหน้าที่จะถูกดำเนินการเมื่อเซสชันการคอมพิวเตอร์พร้อมใช้งาน

source: This session will execute the script as soon as the compute session is ready, and then automatically terminates the session as soon as the execution finishes. It will utilize the server farm's resources efficiently and flexibly if a user can write the execution script in advance or is building a pipeline of workloads.
ja: このセッションは、コンピュートセッションが準備完了次第、スクリプトを実行し、実行が完了すると自動的にセッションを終了します。ユーザーが事前に実行スクリプトを書いたり、ワークロードのパイプラインを構築したりできる場合、サーバーファームのリソースを効率的かつ柔軟に活用します。
ko_kr: 자원이 할당되는 즉시 해당 스크립트를 실행하고, 스크립트가 종료되는 그 즉시 연산 세션을 자동으로 삭제합니다. 따라서, 실행할 코드가 사전에 정의되어 있거나 작업을 파이프라이닝 하는 경우에는, 연산 서버 팜(server farm)의 자원을 보다 효율적으로 활용할 수 있는 장점이 있습니다.

source: Users can set the start time of a batch-type compute session. However, keep in mind that this feature does not guarantee that the session will start at the registered time. It may still stay at 'PENDING' due to the lack of resources, etc. Rather, it guarantees that the session WILL NOT run until the start time.
ja: ユーザーはバッチタイプの計算セッションの開始時間を設定できます。ただし、この機能はセッションが登録された時間に開始されることを保証するものではないことに注意してください。リソース不足などの理由で、「PENDING」のままになる可能性があります。むしろ、開始時間までセッションが実行されないことが保証されています。
ko_kr: 연산 세션 시작 시점을 지정할 수 있습니다. 다만, 시작 시점에 반드시 연산 세션이 자원을 할당받을 수 있는 것은 아닙니다(자원 부족 등의 이유로 PENDING 상태에 계속 머물 수 있습니다). 시작 시점 이전에는 자원이 있어도 연산 세션을 스케줄링 하지 않는 개념으로 이해하는 것이 정확합니다.

source: Session name: Users can specify the name of the compute session to be created. If set, this name appears in Session Info, so it is distinguishable among multiple compute sessions. If not specified, random word will be assigned automatically. Session names only accept alphanumeric characters between 4 and 64 without spaces.
ja: セッション名: ユーザーは作成する計算セッションの名前を指定できます。設定した場合、この名前はセッション情報に表示されるため、複数の計算セッションの中で区別可能です。指定しない場合、自動的にランダムな単語が割り当てられます。セッション名は、スペースなしで4文字から64文字の英数字のみを受け付けます。
ko_kr: Session name: 생성할 연산 세션의 이름을 지정할 수 있습니다. 지정하면 Session Info에 이 이름이 나타나므로 연산 세션의 구분이 용이합니다. 지정하지 않으면 임의의 이름이 자동으로 지정됩니다. 세션 이름은 4-64자 사이의 알파벳 또는 숫자만 받아들이며, 공백은 허용되지 않습니다.

source: If users create a session with the ``super admin`` or ``admin`` account, they can additionally assign a session owner. If you enable the toggle, a user email field will appear.
ja: ユーザーが ``super admin`` または ``admin`` アカウントでセッションを作成すると、追加でセッションオーナーを割り当てることができます。トグルを有効にすると、ユーザーのメールフィールドが表示されます。
ko_kr: ``super admin`` 혹은 ``admin`` 계정으로 세션을 생성하는 경우, 추가적으로 세션 소유자를 할당할 수 있습니다. 토글을 클릭해 할당을 활성화하면 사용자 이메일 입력 필드가 나타납니다.

source: Enter the email of the user you want to assign the session to, click the search button, and the user's access key will be automatically registered. You can also select a project and resource group.
ja: セッションを割り当てたいユーザーのメールアドレスを入力し、検索ボタンをクリックすると、そのユーザーのアクセストークンが自動的に登録されます。また、プロジェクトとリソースグループを選択することもできます。
ko_kr: 세션 할당을 위한 사용자 이메일을 입력하고 검색 버튼을 클릭하면, 해당 사용자의 access key가 자동으로 등록됩니다. 추가적으로 프로젝트와 자원 그룹을 선택해 할당할 수 있습니다.

source: Click the 'Next' button below, or the 'Environments & Resource allocation' menu on the right to proceed to the next page. If you want to create a session without any further settings, press the 'Skip to review' button. In this case, settings on the other pages will all use the default values.
ja: 以下の「次へ」ボタンをクリックするか、右の「環境とリソース割り当て」メニューをクリックして次のページに進んでください。追加の設定を行わずにセッションを作成したい場合は、「レビューにスキップ」ボタンを押してください。この場合、他のページの設定はすべてデフォルト値が使用されます。
ko_kr: 다음 페이지로 진행하려면 아래쪽의 Next 버튼을 클릭하거나, 우측의 Environments & Resource allocation 버튼을 클릭하십시오. 추가 설정 없이 세션을 생성하려면 Skip to review 버튼을 누르십시오. 이 경우, 다른 페이지의 설정은 모두 기본값을 사용하게 됩니다.

source: For detailed explanations of each item that can be set on the second page, please refer to the following:
ja: 2ページ目で設定できる各項目の詳細な説明については、以下を参照してください：
ko_kr: 두 번째 페이지에서 설정할 수 있는 각 항목에 대한 자세한 설명은 다음을 참고하십시오.

source: Environments: Users can select the base environment for compute sessions such as TensorFlow, PyTorch, C++, etc. The compute session will automatically included into the base environment library. If users choose another environment, the corresponding packages will be installed by default.
ja: 環境: ユーザーは、TensorFlow、PyTorch、C++ などの計算セッションのベース環境を選択できます。計算セッションは自動的にベース環境ライブラリに含まれます。ユーザーが別の環境を選択すると、対応するパッケージがデフォルトでインストールされます。
ko_kr: Environments: TensorFlow, PyTorch, C++ 등과 같은 연산 세션의 기본 환경을 지정합니다. TensorFlow를 선택하면 연산 세션에서 TensorFlow 라이브러리를 사용할 수 있습니다. 다른 환경을 선택하면 해당 환경이 기본적으로 설치된 연산 세션을 생성하게 됩니다.

source: Version: Users can specify the version of the environment. There are multiple versions in a single environment. For example, TensorFlow has multiple versions such as 1.15, 2.3, etc.,
ja: バージョン: ユーザーは環境のバージョンを指定できます。単一の環境内に複数のバージョンがあります。たとえば、TensorFlowには1.15、2.3などの複数のバージョンがあります。

source: Image Name: Users can specify the name of the image to be used for the compute session. This configuration may not be available depending on the environment settings.
ja: イメージ名: ユーザーは、計算セッションに使用するイメージの名前を指定できます。この設定は、環境設定に応じて利用できない場合があります。
ko_kr: Image Name: 연산 세션에 사용할 이미지의 이름을 지정할 수 있습니다. 환경 설정에 따라 이 설정이 사용 불가능할 수도 있습니다.

source: Set Environment Variable: Provides an interface for users to set environment variables in a compute session. Refer to the :ref:`How to add environment variables before session creation<set-environment-variables>` section to learn more.
ja: 環境変数の設定: ユーザーが計算セッション内で環境変数を設定するためのインターフェースを提供します。セッション作成前に環境変数を追加する方法については、:ref:`環境変数をセッション作成前に追加する方法<set-environment-variables>`セクションを参照してください。
ko_kr: Set Environment Variable: 사용자가 연산 세션에 환경 변수를 설정할 수 있는 인터페이스를 제공합니다. 사용 방법은 :ref:`세션 생성하기 전에 환경 변수를 추가하는 방법<set-environment-variables>` 섹션을 참고하십시오.

source: Resource Group: Specifies the resource group in which to create a compute session. A resource group is a unit that groups host servers that each user can access. Usually, servers in a resource group would have the same type of GPU resources. Administrators can classify servers by any criteria, group them into one or more resource groups, configure which resource groups a user can use. Users can launch a compute session only on servers in resource groups allowed by the administrator. If multiple resource groups are allowed, users could select any group they want. However, it cannot be changed when system only allows single-setting.
ja: リソースグループ: コンピュートセッションを作成するリソースグループを指定します。リソースグループは、各ユーザーがアクセスできるホストサーバーをグループ化する単位です。通常、リソースグループ内のサーバーは同じタイプのGPUリソースを持っています。管理者は任意の基準でサーバーを分類し、1つまたは複数のリソースグループにグループ化し、ユーザーが使用できるリソースグループを設定できます。ユーザーは、管理者が許可したリソースグループのサーバーでのみコンピュートセッションを開始できます。複数のリソースグループが許可されている場合、ユーザーは希望する任意のグループを選択できます。ただし、システムが単一設定のみを許可している場合は変更できません。
ko_kr: Resource Group: 연산 세션을 생성할 자원 그룹을 지정합니다. 자원 그룹은 각 사용자가 접근할 수 있는 호스트 서버를 묶은 단위이며, 주로 같은 종류의 GPU 자원을 보유하고 있는 서버들을 하나의 자원 그룹으로 설정합니다. 관리자는 서버를 종류별로 구분하여 자원 그룹으로 묶고, 사용자가 사용할 수 있는 자원 그룹의 종류를 지정할 수 있습니다. 사용자는 관리자가 허가한 자원 그룹 서버에만 연산 세션을 생성할 수 있습니다. 자원 그룹이 여러 개인 경우 원하는 그룹을 선택할 수 있지만, 하나만있는 경우에는 변경할 수 없습니다.

source: Resource Presets: These templates have pre-defined resource sets, such as CPU, memory, and GPU, to be allocated to a compute session. Administrators can define frequently used resource settings in advance. By adjusting the numerical input or sliding the slider, users can allocate the desired amount of resources.
ja: リソースプリセット：これらのテンプレートには、コンピュートセッションに割り当てるためのCPU、メモリ、GPUなどの事前定義されたリソースセットがあります。管理者は、よく使用されるリソース設定をあらかじめ定義できます。数値入力を調整するか、スライダーをスライドさせることで、ユーザーは必要なリソース量を割り当てることができます。
ko_kr: Resource Presets: 이 템플릿은 연산 세션에 할당할 CPU, 메모리, GPU 등의 자원 세트를 미리 정의해 둔 것입니다. 관리자는 미리 자주 사용하는 자원 설정을 정의할 수 있습니다. 숫자 입력을 조정하거나 슬라이더를 움직이면 원하는 자원량을 할당할 수 있습니다.

source: The meaning of each item is as follows. Clicking the Help (?) button will also give more information.
ja: 各項目の意味は以下の通りです。ヘルプ (?) ボタンをクリックすることでも、より詳しい情報を得ることができます。
ko_kr: 각 항목의 의미는 다음과 같습니다. 도움 (?) 버튼을 클릭하면 자세한 정보를 확인할 수 있습니다.

source: CPU: The CPU performs basic arithmetic, logic, controlling, and input/output (I/O) operations specified by the instructions. In general, more CPUs are beneficial for high-performance computing workloads. But, to reflect the advantage of more CPUs, program code must be written to adapt multiple CPUs.
ja: CPU: CPUは、命令によって指定された基本的な算術、論理、制御、および入出力（I/O）操作を実行します。一般的に、より多くのCPUは高性能計算ワークロードにとって有益です。しかし、より多くのCPUの利点を反映させるためには、プログラムコードが複数のCPUに適応するように書かれなければなりません。
ko_kr: CPU: CPU는 명령어로 지정된 기본 산술, 논리, 제어 및 입출력 (I/O) 작업을 수행합니다. 고성능 컴퓨팅 워크로드의 경우 많은 CPU가 도움이 되지만, 여러 CPU를 사용하도록 프로그램 코드를 작성해야 합니다. (그렇지 않으면 대부분의 CPU는 사용되지 않을 것입니다.)

source: Memory: Computer memory is a temporary storage area. It holds the data and instructions that the Central Processing Unit (CPU) needs. When using a GPU in a machine learning workload, at least twice the memory of the GPU to memory need to be allocated. Otherwise, GPU's idle time will increase, resulting penalty in a performance.
ja: メモリ: コンピュータのメモリは、一時的なストレージエリアです。これは、中央処理装置（CPU）が必要とするデータと指示を保持します。機械学習のワークロードでGPUを使用する場合、少なくともGPUのメモリの2倍のメモリを割り当てる必要があります。そうしないと、GPUのアイドルタイムが増加し、パフォーマンスにペナルティが生じます。
ko_kr: 컴퓨터 메모리는 임시 저장 영역입니다. 중앙 처리 장치 (CPU)에 필요한 데이터와 명령들을 보관하는 역할을 합니다.머신 러닝 워크로드를 처리할 때 GPU를 연산 장치로 사용하는 경우, GPU 메모리의 두 배 이상의 메모리를 할당해야 합니다. 그렇지 않으면 GPU의 유휴 시간이 증가하여 성능이 저하됩니다.

source: Shared Memory: The amount of shared memory in GB to allocate for the compute session. Shared memory will use some part of the memory set in RAM. Therefore, it cannot be greater than the amount specified in RAM.
ja: 共有メモリ: コンピュートセッションに割り当てる共有メモリの量をGB単位で指定します。共有メモリはRAMに設定されたメモリの一部を使用します。したがって、RAMで指定された量を超えることはできません。
ko_kr: Shared Memory: 연산 세션에 할당할 공유 메모리의 용량 (GB). RAM에 설정된 메모리 중 일부를 떼어 공유 메모리로 사용합니다. 따라서, RAM에 지정된 양보다 클 수 없습니다.
th: หน่วยความจำที่แชร์: ปริมาณหน่วยความจำที่แชร์ในหน่วย GB ที่จะจัดสรรสำหรับเซสชันการประมวลผล หน่วยความจำที่แชร์จะใช้บางส่วนของหน่วยความจำที่ตั้งค่าใน RAM ดังนั้นจึงไม่สามารถมากกว่าปริมาณที่ระบุใน RAM ได้

source: AI Accelerator: AI accelerators (GPUs or NPUs) are well-suited for the matrix/vector computations involved in machine learning. AI accelerators speed up training / inference algorithms by orders of magnitude, reducing running times from weeks to days.
ja: AIアクセラレータ: AIアクセラレータ（GPUまたはNPU）は、機械学習に関与する行列/ベクトル計算に適しています。AIアクセラレータは、トレーニング/推論アルゴリズムをオーダーで高速化し、実行時間を数週間から数日に短縮します。
ko_kr: AI Accelerator: AI 가속기 (GPU 및 NPU)는 기계 학습과 관련된 행렬 / 벡터 계산에 적합합니다. AI 가속기는 훈련 및 인퍼런스 알고리즘을 몇 배나 가속화하여 기계 학습 워크로드의 실행 시간을 몇 주에서 며칠로 줄입니다.
th: AI Accelerator: AI accelerator (GPU หรือ NPU) เหมาะสำหรับการคำนวณเมทริกซ์/เวกเตอร์ที่เกี่ยวข้องกับการเรียนรู้ของเครื่อง AI accelerator เร่งความเร็วอัลกอริธึมการฝึกอบรม / การอนุมานโดยมาก ทำให้เวลาในการประมวลผลลดลงจากหลายสัปดาห์เหลือไม่กี่วัน

source: Sessions: Session is a unit of computational environment that is created according to a specified environment and resources. If this value is set to a value greater than 1, multiple sessions corresponding to the resource set above are created. If there are not enough resources available, requests to create sessions that cannot be created are put on the waiting queue.
ja: セッション: セッションは、指定された環境とリソースに従って作成される計算環境の単位です。この値が1より大きい値に設定されると、上記のリソースセットに対応する複数のセッションが作成されます。十分なリソースが利用できない場合、作成できないセッションを作成するための要求は待機キューに入れられます。
ko_kr: 세션은 지정된 환경과 자원에 따라 생성되는 계산 환경 단위입니다. 이 값을 1보다 큰 값으로 설정하면 위의 자원 설정을 이용한 여러 세션이 지정한 값 만큼 동시에 생성됩니다. 세션 시작 요청 시 사용 가능한 자원이 충분하지 않은 경우, 생성하지 못한 세션 시작 요청들은 생성 대기열에 추가됩니다.

source: Cluster mode: Cluster mode allows users to create multiple compute sessions at once. For more information, refer to the :ref:`Overview of Backend.AI cluster compute session<backendai-cluster-compute-session>`.
ja: クラスタモード: クラスタモードでは、ユーザーは複数の計算セッションを同時に作成できます。詳細については、:ref:`Backend.AIクラスタ計算セッションの概要<backendai-cluster-compute-session>`を参照してください。
ko_kr: Cluster mode: Backend.AI 는 한 번에 여러 연산 세션을 생성할 수 있는 클러스터 모드를 지원합니다. 더 자세한 정보는 :ref:`Backend.AI 클러스터 연산 세션 개요<backendai-cluster-compute-session>` 섹션을 참고하세요

source: High-Performance Computing Optimizations: Backend.AI provides configuring values related to HPC Optimizations. For more information, See the section :ref:`Optimizing Accelerated Computing<optimizing-accelerated-computing>`.
ja: 高性能コンピューティング最適化: Backend.AI は HPC 最適化に関連する値を設定する機能を提供します。詳細は、:ref:`Optimizing Accelerated Computing<optimizing-accelerated-computing>` のセクションを参照してください。
ko_kr: High-Performance Computing Optimizations: Backend.AI 는 HPC 최적화 관련 값을 설정할 수 있습니다. 더 자세한 정보는 :ref:`가속화 컴퓨팅 최적화하기<optimizing-accelerated-computing>` 섹션을 참고하세요.

source: Click the 'Next' button below, or the 'Data & Storage' menu on the right to proceed to the next page.
ja: 以下の「次へ」ボタンをクリックするか、右側の「データとストレージ」メニューをクリックして次のページに進んでください。
ko_kr: 다음 페이지로 진행하려면 아래쪽의 Next 버튼을 클릭하거나, 우측의 Data & Storage 버튼을 클릭하세요.

source: Here, users can specify the data folders to mount in the compute session. Folder explorer can be used by clicking folder name. For further information, please refer :ref:`Explore Folder<explore_folder>` section.
ja: ここでは、ユーザーが計算セッションでマウントするデータフォルダーを指定できます。フォルダー名をクリックすることでフォルダーエクスプローラーを使用できます。詳細については、:ref:`Explore Folder<explore_folder>`セクションを参照してください。
ko_kr: Data & Storage 에선 연산 세션에 마운트 가능한 폴더 목록을 확인할 수 있습니다. 폴더 이름을 클릭해 파일 탐색기를 사용할 수 있습니다. 파일 탐색기에 대한 자세한 설명은 :ref:`폴더 내용 조회하기 <explore_folder>` 섹션을 참고하세요.

source: New folder can be created by clicking the '+ Add' button next to the searcher. When new folder is created, it will automatically be selected as the folder to mount. For further information, please refer :ref:`Create Storage Folder<create_storage_folder>` section.
ja: 新しいフォルダーは、検索バーの横にある「+ 追加」ボタンをクリックすることで作成できます。新しいフォルダーが作成されると、自動的にマウントするフォルダーとして選択されます。詳細については、:ref:`ストレージフォルダーの作成<create_storage_folder>`セクションを参照してください。
ko_kr: 또한 파일 이름 검색기 옆의 + 버튼을 클릭하여 새로운 폴더를 생성할 수 있습니다. 새로운 폴더를 생성하는 경우, 마운트 할 폴더로 자동 선택됩니다. 폴더 생성 모달에 대한 자세한 사용 방법은 :ref:`Storage 폴더 생성<create_storage_folder>` 를 참고하세요.

source: When a compute session is destroyed, data deletion is set to default. However, data stored in the mounted folders will survive. Data in those folders can also be reused by mounting it when creating another compute session. For further information on how to mount a folder and run a compute session, refer to :ref:`Mounting Folders to a Compute Session<session-mounts>`.
ja: コンピュートセッションが破棄されると、データの削除はデフォルトで設定されます。ただし、マウントされたフォルダに保存されているデータは生き残ります。これらのフォルダ内のデータは、別のコンピュートセッションを作成する際にマウントすることで再利用することもできます。フォルダをマウントしてコンピュートセッションを実行する方法については、:ref:`Mounting Folders to a Compute Session<session-mounts>`を参照してください。
ko_kr: 여기서는 연산 세션에 마운트 할 데이터 폴더를 지정할 수 있습니다. 연산 세션이 삭제되면 기본적으로 모든 데이터가 함께 삭제되지만, 여기서 마운트 한 폴더에 저장된 데이터는 삭제되지 않습니다. 마운트 폴더에 저장된 데이터는 다른 연산 세션을 생성할 때 다시 마운트하여 재사용 할 수도 있습니다. 폴더를 마운트하고 연산 세션을 실행하는 방법에 대한 정보는 :ref:`연산 세션에 폴더 마운트<session-mounts>` 장을 참고하십시오. 여기서는 폴더를 마운트 하지 않고 그냥 지나가겠습니다. 다음 페이지로 이동합시다.

source: On the fourth page, Network configuration can be done such as Preopen Ports.
ja: 第四ページでは、プレオープンポートなどのネットワーク構成が行えます。
ko_kr: 네 번째 페이지에서는 사전 개방 포트와 같은 네트워크 구성을 설정할 수 있습니다.

source: Set Preopen Ports: Provides an interface for users to set preopen ports in a compute session. Refer to the :ref:`How to add preopen ports before session creation <set_preopen_ports>` ofor further information.
ja: プリオープンポートの設定：計算セッションでプリオープンポートを設定するためのインターフェースを提供します。詳細については、:ref:`セッション作成前にプリオープンポートを追加する方法 <set_preopen_ports>`を参照してください。
ko_kr: Set Preopen Ports: 사용자가 연산 세션에 사전 개방 포트를 설정할 수 있는 인터페이스를 제공합니다. 사용 방법은 :ref:`세션 생성하기 전에 사전 개방 포트를 추가하는 방법<set_preopen_ports>` 섹션을 참고하십시오.

source: If you are done with the network setting, click the 'Next' button below, or 'Confirm and Launch' button on the right to proceed to the last page.
ja: ネットワーク設定が完了したら、下の「次へ」ボタンをクリックするか、右の「確認して起動」ボタンをクリックして最後のページに進んでください。
ko_kr: 네트워크 설정을 완료했다면, 아래쪽의 Next 버튼을 클릭하거나, 우측의 Confirm and Launch 버튼을 클릭하여 마지막 페이지로 이동합니다.

source: On the last page, users could view information of session(s) to create, such as environment itself, allocated resources, mount information, environment variables set on the previous pages, preopen ports, etc., Review the settings, users could launch the session by clicking 'Launch' button. Click the 'Edit' button located at the top right of each card to redirect to relevant page.
ja: 最後のページでは、ユーザーは作成するセッションの情報（環境自体、割り当てられたリソース、マウント情報、前のページで設定された環境変数、事前にオープンされたポートなど）を確認できます。設定を確認した後、ユーザーは「Launch」ボタンをクリックすることでセッションを開始できます。各カードの右上にある「Edit」ボタンをクリックすると、関連ページへリダイレクトされます。
ko_kr: 마지막 페이지에 도착했습니다. 이전 페이지에서 설정한 연산 세션 환경, 자원 할당량과 마운트 정보, 설정된 환경변수, 사전 개방 포트 등의 정보를 볼 수 있습니다. 원하는 설정인지 마지막으로 확인한 후 Launch 버튼을 클릭합니다. 만약, 변경하고 싶은 설정이 있다면 Previous 버튼을 클릭하여 이전 페이지로 돌아갈 수 있습니다. 혹은, 각 카드 우측 상단에 있는 Edit 버튼을 눌러 해당 페이지로 돌아갈 수 있습니다.

source: If there is an issue with the settings, an error message will be displayed as follows. Users can edit their settings when this happens.
ja: 設定に問題がある場合、次のようなエラーメッセージが表示されます。この場合、ユーザーは設定を編集できます。
ko_kr: 설정에 문제가 있는 경우, 다음과 같이 오류가 표시됩니다. 설정을 수정하려면 Edit를 클릭하십시오.

source: A warning dialog appears, stating that there are no mounted folders. Ignore the warning for now and click the Start button to proceed.
ja: 警告ダイアログが表示され、マウントされたフォルダがないことを示しています。今はその警告を無視して、進めるために「開始」ボタンをクリックしてください。
ko_kr: 아무 폴더를 마운트 하지 않았다는 경고 대화 상자가 나타납니다. 이번에는 경고를 무시하고 Start 버튼을 클릭하여 진행합니다.
th: กล่องโต้ตอบเตือนจะปรากฏขึ้น โดยระบุว่าไม่มีโฟลเดอร์ที่ติดตั้งอยู่ ในขณะนี้ให้ข้ามการเตือนนี้ไปและคลิกปุ่มเริ่มต้นเพื่อดำเนินการต่อ

source: Now a new compute session is created in the RUNNING tab.
ja: 新しいコンピュートセッションが RUNNING タブに作成されます。
ko_kr: Running 탭에서 새로운 연산 세션이 생성되는 것을 확인합시다.
th: ตอนนี้เซสชันการคอมพิวเตอร์ใหม่ถูกสร้างขึ้นในแท็บ RUNNING.

source: In the RUNNING tab, users can check the information on the currently running sessions. This includes both interactive and batch sessions. 'BATCH' tab and 'INTERACTIVE' tab only show sessions corresponding to each type, not in terminated status. 'FINISHED' tab shows the list of terminated sessions and OTHERS tab shows the compute sessions with errors. For each session, users can check the information such as session environments, the amount of allocated and used resources, session starting time, etc.
ja: RUNNINGタブでは、ユーザーは現在実行中のセッションに関する情報を確認できます。これには、インタラクティブセッションとバッチセッションの両方が含まれます。 'BATCH'タブと'INTERACTIVE'タブは、それぞれのタイプに対応するセッションのみを表示し、終了したステータスのものは表示しません。 'FINISHED'タブは終了したセッションのリストを表示し、OTHERSタブはエラーのあるコンピュートセッションを表示します。各セッションについて、ユーザーはセッション環境、割り当てられたリソースと使用したリソースの量、セッション開始時間などの情報を確認できます。
ko_kr: RUNNING 탭에서 현재 실행중인 세션에 대한 정보를 확인할 수 있습니다. 여기서는 interactive, batch 타입의 세션 모두 보여줍니다. BATCH 탭과 INTERACTIVE 탭은 각 타입에 해당하는 세션들만 보여주는데, 이 때 종료된 세션은 해당하지 않습니다. FINISHED 탭에는 종료 된 세션 목록이 표시되고 OTHERS 탭에는 오류가 있는 컴퓨팅 세션이 표시됩니다. 세션 별로 세션 환경, 할당 및 사용 자원량, 세션 시작 시간 등의 정보를 확인할 수 있습니다.

source: 'Session Launcher' page provides a set of options for creating sessions. As of 24.09, ``Recent History`` feature has been added to remember information about previously created sessions.
ja: 『セッションランチャー』ページは、セッションを作成するための一連のオプションを提供します。24.09時点で、以前に作成されたセッションに関する情報を記憶するための「最近の履歴」機能が追加されました。
ko_kr: Backend.AI 24.09 버전 이후로 세션런처 페이지 우측 상단에 최근 생성된 세션 정보를 확인할 수 있는 ``최근 기록`` 기능이 추가되었습니다.

source: The Recent History modal remembers information about the five most recently created sessions. If users select the one they want to create, click the 'Apply' button to redirect ``Confirm and Launch`` page.
ja: 最近の履歴モーダルは、最近作成された5つのセッションに関する情報を記憶します。ユーザーが作成したいセッションを選択した場合は、'適用'ボタンをクリックして``確認と起動``ページにリダイレクトします。
ko_kr: 최근 기록 모달은 가장 최근에 생성된 5개의 세션에 대한 정보를 저장합니다. 생성을 원하는 기록을 선택한 후 적용 버튼을 클릭하면, 세션 생성의 마지막 단계인 ``검토 및 시작`` 페이지로 이동합니다.
