Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/sessions_all/sessions_all.po
Languages: ja, ko_kr, th

source: Hovering the mouse over the Utilization Checker will display a tooltip with the utilization and threshold values. The text color changes to yellow and then red as the current utilization approaches the threshold (indicating low resource utilization).
ja: Utilization Checkerにマウスをホバーすると、利用率と閾値の値が表示されるツールチップが表示されます。現在の利用率が閾値に近づくにつれて、テキストの色は黄色から赤に変わります（リソースの利用状況が低いことを示しています）。
ko_kr: 사용량 기반 자원 수거에 마우스를 가져가면, 사용률과 수거 기준값을 보여주는 툴팁이 나타납니다. 현재 사용률이 수거 기준값에 접근할수록(사용량이 저조할수록) 글자 색이 노란색, 빨간색 순으로 변하게 됩니다.

source: Depending on the environment settings, idle checkers and resource types of utilization checker's tooltip may be different.
ja: 環境設定によって、アイドルチェッカーや利用率チェッカーのツールチップのリソースタイプが異なる場合があります。
ko_kr: 환경 설정 값에 따라, 유휴 상태 검사 기준과 사용량 기반 자원 수거 툴팁에 나타나는 자원 항목이 다르게 보일 수 있습니다.
th: ขึ้นอยู่กับการตั้งค่าของสภาพแวดล้อม ตัวตรวจสอบที่ไม่ทำงานและประเภทของทรัพยากรในการตรวจสอบการใช้งานอาจแตกต่างกันได้

source: How to add environment variable before creating a session
ja: セッションを作成する前に環境変数を追加する方法
ko_kr: 세션 생성하기 전에 환경 변수를 추가하는 방법
th: วิธีการเพิ่มตัวแปรสภาพแวดล้อมก่อนที่จะสร้างเซสชัน

source: To give more convenient workspace for users, Backend.AI supports environment variable setting in session launching. In this feature, users can add any envs such as ``PATH`` by filling out variable name and value in environment configuration dialog.
ja: ユーザーにとってより便利なワークスペースを提供するために、Backend.AIはセッション起動時に環境変数の設定をサポートしています。この機能では、ユーザーは環境設定ダイアログに変数名と値を入力することで、``PATH``などの任意の環境変数を追加できます。
ko_kr: Backend.AI에서는 사용자에게 더 편리한 환경을 제공하기 위해, 세션 시작 화면에서 세션에 추가될 환경 변수 추가 기능을 지원합니다. 이 기능에서 여러분은 ``PATH`` 를 비롯한 모든 환경 변수를 환경변수 설정 다이얼로그에서 환경 변수명과 환경 변수 값을 입력해서 추가할 수 있습니다.

source: To add environment variable, simply click + Add environment variables button of the Variable. Also, you can remove the variable by clicking ``-`` button of the row that you want to get rid of.
ja: 環境変数を追加するには、変数の + Add environment variables ボタンをクリックします。また、削除したい行の ``-`` ボタンをクリックすることで変数を削除することもできます。
ko_kr: 더 많은 환경 변수를 추가하고 싶을 경우, 입력 필드 첫번째 행의 오른쪽에 있는 ``+ Add environment variables`` 버튼을 클릭하면 됩니다. 또한 환경 변수를 지우고 싶을 경우, 역시 지우고자 하는 행의 ``-`` 버튼을 클릭하면 됩니다.
th: เพื่อเพิ่มตัวแปรสภาพแวดล้อม เพียงคลิกปุ่ม + เพิ่มตัวแปรสภาพแวดล้อม ของตัวแปร นอกจากนี้คุณยังสามารถลบตัวแปรได้โดยการคลิกปุ่ม ``-`` ของแถวที่คุณต้องการลบออก

source: Env Configuration Button
ja: 環境設定ボタン
th: ปุ่มการกำหนดค่าหมายถึง

source: You can write down variable name and value in the same line of the input fields.
ja: 入力フィールドの同じ行に変数名と値を書き込むことができます。
ko_kr: 환경 변수 명과 값을 같은 행의 입력 필드에 입력할 수 있습니다.

source: How to add preopen ports before creating a session
ja: セッションを作成する前にpreopenポートを追加する方法
ko_kr: 세션 생성하기 전에 사전 개방 포트를 추가하는 방법
th: วิธีการเพิ่มพอร์ตที่เปิดก่อนที่จะสร้างเซสชัน

source: Backend.AI supports preopen ports setting at container startup. When using this feature, there is no need to build separate images when you want to expose the serving port.
ja: Backend.AIはコンテナ起動時にプリオープンポートの設定をサポートしています。この機能を使用すると、サービングポートを公開したいときに別々のイメージを作成する必要がありません。
ko_kr: Backend.AI는 컨테이너 시작 전 사전 개방 포트를 설정하는 것을 지원합니다. 이 기능을 사용하면, 서빙 포트를 노출하기 위해 별도의 이미지를 추가로 빌드할 필요가 없습니다.

source: To add preopen ports, simply enter multiple values separated by either a comma (,) or a space.
ja: プレオープンポートを追加するには、単にカンマ（,）またはスペースで区切って複数の値を入力します。
ko_kr: 사전 개방 포트를 추가하려면 쉼표(,)나 공백으로 구분하여 여러 값을 입력할 수 있습니다.
th: เพื่อเพิ่มพอร์ตที่เปิดล่วงหน้า เพียงป้อนค่าหลายค่าโดยแยกด้วยเครื่องหมายจุลภาค (,) หรือช่องว่าง

source: Preopen Ports Configuration
ja: 事前オープンポートの設定
th: การกำหนดค่าพอร์ตที่เปิดก่อน

source: In the forth page of session creation page, users can add, update and delete written preopen ports. To see more detail information, please click Help (?) button.
ja: セッション作成ページの4ページ目では、ユーザーは記述されたプレオープンポートを追加、更新、削除することができます。詳細情報を見るには、ヘルプ（？）ボタンをクリックしてください。
ko_kr: 해당 다이얼로그에서 사전 개방 포트를 추가하거나, 작성한 사전 개방 포트를 갱신, 삭제할 수 있습니다. 더욱 자세한 설명이 필요한 경우, 다이얼로그 헤더 부분에 있는 도움말 (?) 버튼을 클릭해주세요.
th: ในหน้าที่สี่ของหน้าสร้างเซสชัน ผู้ใช้สามารถเพิ่ม แก้ไข และลบพอร์ต preopen ที่เขียนไว้แล้ว สำหรับข้อมูลรายละเอียดเพิ่มเติม กรุณาคลิกที่ปุ่มช่วยเหลือ (?)

source: Users can put port numbers in between 1024 ~ 65535, to the input fields. Then, click the save button. Users can check the configured preopen ports in the session app launcher.
ja: ユーザーはポート番号を1024から65535の間で入力フィールドに入力できます。それから、保存ボタンをクリックします。ユーザーはセッションアプリランチャーで設定された事前オープンポートを確認できます。
ko_kr: 입력란에 1024 ~ 65535 사이의 포트값을 입력한 뒤, SAVE 버튼을 클릭하세요. 설정된 사전 개방 포트값은 세션 앱 런처에서 확인할 수 있습니다.
th: ผู้ใช้สามารถใส่หมายเลขพอร์ตในช่วง 1024 ~ 65535 ลงในช่องข้อมูล แล้วคลิกที่ปุ่มบันทึก ผู้ใช้สามารถตรวจสอบพอร์ตที่เปิดใช้งานล่วงหน้าที่กำหนดไว้ในตัวเปิดแอปเซสชันได้

source: The preopen ports are **the internal ports within the container**. Therefore, unlike other apps, when users click the preopen ports in the session app launcher, a blank page will appear. Please bind a server to the respective port before use.
ja: プリオープンポートは、**コンテナ内の内部ポート** です。したがって、他のアプリと異なり、ユーザーがセッションアプリランチャーでプリオープンポートをクリックすると、空白のページが表示されます。使用前に、それぞれのポートにサーバーをバインドしてください。
ko_kr: 사전 개방 포트는 **컨테이너 내부 포트** 입니다. 따라서, 다른 앱들과 달리 세션 앱 런처에서 사전 개방 포트를 클릭하면 빈 페이지가 나타납니다.
th: พอร์ตที่เปิดล่วงหน้าคือ **พอร์ตภายในภาชนะ** ดังนั้น ต่างจากแอปอื่น เมื่อผู้ใช้คลิกพอร์ตที่เปิดล่วงหน้าในตัวเปิดแอปเซสชัน จะมีหน้าว่างปรากฏขึ้น กรุณาผูกเซิร์ฟเวอร์กับพอร์ตที่เกี่ยวข้องก่อนใช้งาน

source: Save session commit
ja: セッションのコミットを保存
ko_kr: 세션 커밋 저장하기
th: บันทึกการทำธุรกรรมการเซสชัน

source: Backend.AI supports \"Convert Session to Image\" feature from 24.03. Committing a ``RUNNING`` session will save the current state of the session as a new image. Clicking the commit button in the control column of ``RUNNING`` session will display a dialog to show the information of the session. After entering the session name, users can convert the session to a new image. The session name must be 4 to 32 characters long and can only contain alphanumeric letters, hyphens (``-``), or underscores (``_``).
ja: Backend.AIは、24.03から「セッションを画像に変換」機能をサポートしています。「RUNNING」セッションをコミットすると、そのセッションの現在の状態が新しい画像として保存されます。「RUNNING」セッションの制御列にあるコミットボタンをクリックすると、セッションの情報を表示するダイアログが表示されます。セッション名を入力した後、ユーザーはセッションを新しい画像に変換できます。セッション名は4文字以上32文字以下である必要があり、アルファベット、数字、ハイフン（``-``）、またはアンダースコア（``_``）のみを含むことができます。
ko_kr: Backend.AI는 24.03 버전부터 “세션을 이미지로 변환하는 기능“을 지원합니다. ``RUNNING`` 세션을 커밋하면 세션의 현재 상태가 새 이미지로 저장됩니다. ``RUNNING`` 세션의 제어 열에 있는 커밋 버튼을 클릭하면 세션 정보를 보여주는 다이얼로그가 표시됩니다. 세션 이름을 입력한 후 새 이미지로 세션을 변환할 수 있습니다. 세션 이름은 4자에서 32자까지의 알파벳 문자, 하이픈(``-``), 밑줄(``_``)만 포함해야 합니다.

source: Push session to customized image
ja: カスタマイズされたイメージにセッションをプッシュ
ko_kr: 사용자 정의 이미지를 세션으로 푸시
th: ส่งเซสชันไปยังภาพที่กำหนดเอง

source: After filling out session name in the input field, click the 'PUSH SESSION TO CUSTOMIZED IMAGE' button. The customized image created in this way can be used in future session creations. However, directories mounted to the container for image commits are considered external resources and are not included in the final image. Remember that ``/home/work`` is a mount folder (scratch directory), so it is not included.
ja: 入力フィールドにセッション名を入力した後、「PUSH SESSION TO CUSTOMIZED IMAGE」ボタンをクリックします。このようにして作成されたカスタマイズされたイメージは、今後のセッション作成に使用できます。ただし、イメージコミットのためにコンテナにマウントされたディレクトリは外部リソースと見なされ、最終イメージには含まれません。``/home/work`` はマウントフォルダ（スクラッチディレクトリ）であることを忘れないでください、したがって、それは含まれていません。
ko_kr: 입력 필드에 세션 이름을 작성한 후 'PUSH SESSION TO CUSTOMIZED IMAGE' 버튼을 클릭하세요. 이 방법으로 생성된 사용자 정의 이미지는 향후 세션 생성에서 사용할 수 있습니다. 그러나 이미지 커밋을 위해 컨테이너에 마운트된 디렉토리는 외부 리소스로 간주되어 최종 이미지에 포함되지 않습니다. ``/home/work`` 디렉토리가 마운트된 폴더(스크래치 디렉토리)임을 기억해주세요.
th: หลังจากกรอกชื่อเซสชันในฟิลด์ข้อมูลแล้ว ให้คลิกที่ปุ่ม 'เพิ่มเซสชันไปยังภาพที่ปรับแต่ง' ภาพที่ปรับแต่งที่สร้างขึ้นในลักษณะนี้สามารถใช้ในการสร้างเซสชันในอนาคตได้ อย่างไรก็ตาม โฟลเดอร์ที่ถูกติดตั้งไปยังคอนเทนเนอร์สำหรับการคอมมิตภาพจะถือว่าเป็นทรัพยากรภายนอกและจะไม่รวมอยู่ในภาพสุดท้าย จำไว้ว่ ``/home/work`` เป็นโฟลเดอร์ที่ติดตั้ง (โฟลเดอร์ชั่วคราว) ดังนั้นมันจึงไม่ถูกฉายรวมด้วย

source: Currently, Backend.AI supports "Convert Session to Image" only when the session is in ``INTERACTIVE`` mode. To prevent unexpected error, users may not be able to terminate the session during committing process. To stop the ongoing process, check the session, and force-terminate it.
ja: 現在、Backend.AI はセッションが ``INTERACTIVE`` モードのときにのみ「Convert Session to Image」をサポートしています。予期しないエラーを防ぐため、ユーザーはコミット処理中にセッションを終了できない場合があります。進行中のプロセスを停止するには、セッションを確認し、強制終了してください。
ko_kr: 현재 Backend.AI는 세션이 ``INTERACTIVE`` 모드일 때만 “세션을 이미지로 변환“ 기능을 지원합니다. 커밋 프로세스 중에 예기치 않은 오류를 방지하기 위해, 세션 종료를 명령하더라도 실제로는 종료되지 않을 수 있습니다. 진행 중인 프로세스를 중지하려면 세션을 확인하고 강제로 종료하세요.

source: The number of times to "Convert Session to Image" may be limited by the user resource policy. In this case, :ref:`remove the existing customized image<delete-customized-image>` and try again. If this does not resolves the problem, please contact the administrator.
ja: 「Convert Session to Image」の回数は、ユーザーリソースポリシーによって制限される場合があります。この場合、:ref:`既存のカスタマイズイメージを削除<delete-customized-image>`して再試行してください。これで問題が解決しない場合は、管理者に連絡してください。
ko_kr: 사용자 자원 정책에 의해 “세션을 이미지로 변환“ 작업 횟수가 제한될 수 있습니다. 이 경우, :ref:`기존 사용자 정의 이미지를 제거<delete-customized-image>` 한 후 다시 시도하거나 관리자에게 문의하세요.
th: จำนวนครั้งในการ "แปลงเซสชันเป็นภาพ" อาจถูกจำกัดโดยนโยบายทรัพยากรของผู้ใช้ ในกรณีนี้ :ref:`ลบภาพที่ปรับแต่งที่มีอยู่<delete-customized-image>` และลองอีกครั้ง หากยังไม่ได้ผล โปรดติดต่อผู้ดูแลระบบ

source: Utilizing converted images of ongoing sessions
ja: 実行中のセッションの変換されたイメージを利用する
ko_kr: 진행 중인 세션의 변환된 이미지 활용
th: การใช้ภาพที่ถูกแปลงจากเซสชันที่กำลังดำเนินอยู่

source: Converting an ongoing session into an image allows users to select this image from the environments in the session launcher when creating a new session. This image is not exposed to other users and is useful for continuing to use the current session state as is. The converted image is tagged with ``Customized<session name>``.
ja: 進行中のセッションを画像に変換すると、ユーザーは新しいセッションを作成する際にセッションランチャー内の環境からこの画像を選択できるようになります。この画像は他のユーザーには公開されず、現在のセッションの状態をそのまま使用し続けるのに便利です。変換された画像には ``Customized<セッション名>`` というタグが付けられます。
ko_kr: 진행 중인 세션을 이미지로 변환하면, 다음 세션 생성 시 세션 런처의 환경 설정에서 해당 이미지를 선택하여 사용할 수 있습니다. 이 이미지는 다른 사용자에게 공개되지 않으며, 현재 세션의 상태를 그대로 유지하여 사용하는 데 유용합니다. 변환된 이미지는 ``Customized<session name>`` 태그가 붙습니다.

source: Select customized image
ja: カスタマイズされたイメージを選択
ko_kr: 사용자 정의 이미지 선택
th: เลือกภาพที่กำหนดเอง

source: To manually enter the environment name for future session creation, please click the copy icon.
ja: 将来のセッション作成のために環境名を手動で入力するには、コピーアイコンをクリックしてください。
ko_kr: 향후 세션 생성을 위해 환경 이름을 수동으로 입력하려면, 복사 아이콘을 누릅니다.
th: ในการป้อนชื่อสภาพแวดล้อมด้วยตนเองเพื่อสร้างเซสชันในอนาคต โปรดคลิกที่ไอคอนคัดลอก

source: Copy customized image
ja: カスタマイズされたイメージをコピー
ko_kr: 사용자 정의 이미지 복사
th: คัดลอกภาพที่กำหนดเอง

source: Optimizing Accelerated Computing
ja: アクセラレーテッドコンピューティングの最適化
ko_kr: 가속 컴퓨팅 최적화하기
th: การเพิ่มประสิทธิภาพการคำนวณที่เร่งความเร็ว

source: Backend.AI provides configuration UI for internal control variable in ``nthreads-var``. Backend.AI sets this value equal to the number of session's CPU cores by default, which has the effect of accelerating typical high-performance computing workloads. Nevertheless, for some multi-thread workloads, multiple processes using OpenMP are used at same time, resulting in an abnormally large number of threads and significant performance degradation. To resolve this issue, setting the number of threads to 1 or 2 would work.
ja: Backend.AI は内部制御変数のための構成UIとして ``nthreads-var`` を提供します。Backend.AI は、この値をセッションのCPUコア数と同じに設定するのがデフォルトであり、これにより一般的な高性能コンピューティングのワークロードを加速させる効果があります。しかし、一部のマルチスレッドワークロードでは、複数のプロセスが OpenMP を同時に使用するため、異常に大量のスレッドが生成され、パフォーマンスが大幅に低下します。この問題を解決するには、スレッドの数を1または2に設定すると効果的です。
ko_kr: Backend.AI 는 ``nthread-var`` 의 내부 컨트롤 변수 설정 인터페이스를 제공합니다.Backend.AI 는 기본적으로 이 값을 세션의 CPU 코어 수와 같도록 설정해두며, 이는 일반적인 고성능 컴퓨팅 워크로드를 가속하는 효과가 있습니다. 그러나, 일부 멀티스레드 워크로드의 경우 OpenMP를 사용하는 다중 프로세스가 동시에 실행되어 비정상적으로 많은 스레드가 생성되고, 현저한 성능 저하가 발생할 수 있습니다. 이러한 문제를 해결하려면, 스레드 값을 1 또는 2로 조정하십시오.

source: Session HPC Optimization
ja: セッション HPC 最適化
ko_kr: 세션 HPC 최적화
th: การเพิ่มประสิทธิภาพเซสชัน HPC

source: Advanced web terminal usage
ja: 高度なウェブターミナルの使用
ko_kr: 웹 터미널 고급 사용법
th: การใช้งานเทอร์มินัลเว็บขั้นสูง

source: The web-based terminal internally embeds a utility called `tmux <https://github.com/tmux/tmux/wiki>`_. tmux is a terminal multiplexer that supports to open multiple shell windows within a single shell, so as to allow multiple programs to run in foreground simultaneously. If users want to take advantage of more powerful tmux features, they can refer to the official tmux documentation and other usage examples on the Internet.
ja: ウェブベースのターミナルは、内部で `tmux <https://github.com/tmux/tmux/wiki>`_ というユーティリティを組み込んでいます。tmuxは、単一のシェル内で複数のシェルウィンドウを開くことをサポートするターミナルマルチプレクサであり、複数のプログラムを同時に前景で実行できるようにします。ユーザーがより強力なtmux機能を活用したい場合は、公式のtmuxドキュメントやインターネット上の他の使用例を参照することができます。
ko_kr: 위에서 사용 해보았던 웹 기반 터미널은 내부적으로 `tmux <https://github.com/tmux/tmux/wiki>`_ 라는 유틸리티를 사용하고 있습니다. tmux 는 하나의 쉘 내에서 여러 개의 창을 띄워 다중 작업 할 수 있도록 지원하는 terminal multiplexer 로, 쉘이 닫히더라도 작업하던 내용을 보존할 수 있는 등 다양한 장점을 가지고 있습니다. 보다 강력한 터미널 기능을 활용하고 싶다면 tmux 공식 문서 및 기타 인터넷 상의 다양한 사용 예제를 참고하십시오.

source: Here we are introducing some simple but useful features.
ja: ここでは、いくつかのシンプルですが便利な機能を紹介します。
ko_kr: 여기서는 몇 가지 간단하지만 유용한 기능을 소개하겠습니다.
th: ที่นี่เรากำลังแนะนำฟีเจอร์ที่ง่ายแต่มีประโยชน์บางอย่าง

source: Copy terminal contents
ja: 端末の内容をコピーする
ko_kr: 터미널 내용 복사하기
th: คัดลอกเนื้อหาของเทอร์มินัล

source: tmux offers a number of useful features, but it's a bit confusing for first-time users. In particular, tmux has its own clipboard buffer, so when copying the contents of the terminal, users can suffer from the fact that it can be pasted only within tmux by default. Furthermore, it is difficult to expose user system's clipboard to tmux inside web browser, so the terminal contents cannot be copied and pasted to other programs of user's computer. The so-called ``Ctrl-C`` / ``Ctrl-V`` is not working with tmux.
ja: tmux は多くの便利な機能を提供していますが、初めて使用するユーザーには少し混乱を招くことがあります。特に、tmux には独自のクリップボードバッファがあるため、端末の内容をコピーする際、ユーザーはデフォルトで tmux 内部でのみペーストできるという制約に悩まされることがあります。さらに、ウェブブラウザ内の tmux にユーザーのシステムクリップボードを露出させることは難しいため、端末の内容をユーザーのコンピュータの他のプログラムにコピー＆ペーストすることができません。いわゆる「Ctrl-C」 / 「Ctrl-V」は tmux では機能しません。
ko_kr: tmux 는 다양한 장점을 가지고 있지만 처음 접하는 사용자라면 다소 혼란스러운 부분도 있습니 다. 특히, tmux 는 자체 클립보드 버퍼를 가지고 있어 터미널의 내용을 복사할 경우 기본적으로 tmux 내에서만 붙여넣을 수 있다는 부분에서 어려움을 겪을 수 있습니다. 여기에 웹 기반 터미 널에서는 사용자 시스템의 클립보드를 tmux 에 노출시키기 어렵다는 한계가 더해져서, tmux 쉘을 사용하고 있는 상태에서는 마우스 드래그를 통해 터미널 내용을 복사한 후 사용자 컴퓨터의 다른 프로그램에 붙여넣을 수가 없습니다. 소위 말하는 ``Ctrl-C`` / ``Ctrl-V`` 가 작동하지 않는 것입니다.

source: If copy and paste of terminal contents is needed to system's clipboard, users can temporarily turn off tmux's mouse support. First, press ``Ctrl-B`` key to enter tmux control mode. Then type ``:set -g mouse off`` and press ``Enter`` (note to type the first colon as well). Users can check what they are typing in the status bar at the bottom of the screen. Then drag the desired text from the terminal with the mouse and press the ``Ctrl-C`` or ``Cmd-C`` (in Mac) to copy them to the clipboard of the user's computer.
ja: ターミナルの内容をシステムのクリップボードにコピー＆ペーストする必要がある場合、ユーザーは一時的にtmuxのマウスサポートをオフにすることができます。まず、``Ctrl-B``キーを押してtmuxのコントロールモードに入ります。次に``:set -g mouse off``と入力し、``Enter``を押します（最初のコロンも入力することに注意してください）。ユーザーは画面の下部にあるステータスバーで入力内容を確認できます。その後、マウスを使ってターミナルから目的のテキストをドラッグし、``Ctrl-C``または``Cmd-C``（Macの場合）を押して、ユーザーのコンピュータのクリップボードにコピーします。
ko_kr: 만약 터미널 내용을 사용자 시스템의 클립보드로 복사하여 붙여넣기를 할 필요가 있을 때는 잠시 tmux 의 마우스 지원 설정을 끌 수 있습니다. 먼저 ``Ctrl-B`` 키를 눌러 tmux 의 제어 모드로 진입합니다. 그 후 ``:set -g mouse off`` 를 입력하고 엔터키를 누릅니다 (처음 콜론까지 입력해야 합니다). 입력하는 내용은 tmux 하단의 상태바에서 확인할 수 있습니다. 그 후 터미널에서 마우스로 원하는 텍스트를 드래그 하고 ``Ctrl-C`` 또는 ``Cmd-C`` 키를 누르면 사용자 컴퓨터의 클립보드에 해당 내용이 복사 됩니다.

source: With mouse support turned off, scrolling through the mouse wheel is not supprted, to see the contents of the previous page from the terminal. In this case, users can turn on mouse support. Press ``Ctrl-B``, and this time, type ``:set -g mouse on``. Now scrolling through mouse wheelis available to see the contents of the previous page.
ja: マウスサポートがオフの状態では、ターミナルから前のページの内容を表示するためにマウスホイールをスクロールすることはサポートされていません。この場合、ユーザーはマウスサポートをオンにすることができます。 ``Ctrl-B`` を押し、今度は ``:set -g mouse on`` と入力します。これで、マウスホイールを使って前のページの内容を表示できるようになります。
ko_kr: 마우스 지원을 끈 상태에서는 마우스 휠로 스크롤하여 터미널의 이전 페이지 내용을 확인할 수 없습니다. 이 때는 다시 마우스 지원을 켜면 됩니다. ``Ctrl-B`` 를 누른 후 이번에는 ``:set -g mouse on`` 을 입력해봅시다. 이제 마우스 휠을 스크롤하여 이전 페이지의 내용을 볼 수 있게 되었습니다.

source: If you remember ``:set -g mouse off`` or ``:set -g mouse on`` after ``Ctrl-B``, you can use the web terminal more conveniently.
ja: ``Ctrl-B`` の後に ``:set -g mouse off`` または ``:set -g mouse on`` を覚えておくと、Webターミナルをより便利に使用できます。
ko_kr: 이와 같이 ``Ctrl-B`` 후 ``:set -g mouse off`` 또는 ``:set -g mouse on`` 을 기억하면 조금 더 편리하게 웹 터미널을 활용할 수 있습니다.
th: หากคุณจำ ``:set -g mouse off`` หรือ ``:set -g mouse on`` หลังจาก ``Ctrl-B`` ได้ คุณจะสามารถใช้เทอร์มินัลเว็บได้สะดวกมากขึ้น

source: ``Ctrl-B`` is tmux's default control mode key. If users set another control key by modifying ``.tmux.conf`` in user home directory, they should press the set key combination instead of ``Ctrl-B``.
ja: ``Ctrl-B`` は tmux のデフォルトコントロールモードキーです。ユーザーがホームディレクトリの ``.tmux.conf`` を変更して別のコントロールキーを設定した場合は、``Ctrl-B`` の代わりに設定したキーの組み合わせを押す必要があります。
ko_kr: ``Ctrl-B`` 키는 tmux 의 기본 제어 모드 키입니다. 만약 홈 디렉토리의 ``.tmux.conf`` 를 수정하여 다른 제어 키를 설정한 경우에는, ``Ctrl-B`` 대신 설정된 키 조합을 눌러야 합니다.

source: In the Windows environment, refer to the following shortcuts.
ja: Windows環境では、以下のショートカットを参照してください。
ko_kr: 윈도우즈 환경에서는 다음 단축키를 참고하세요.
th: ในสภาพแวดล้อม Windows ให้ดูที่ทางลัดต่อไปนี้

source: Copy: Hold down ``Shift``, right-click and drag
ja: コピー: ``Shift`` を押しながら右クリックしてドラッグ
ko_kr: 복사: ``Shift`` 키를 누른 상태에서 마우스 우클릭해서 드래그
th: คัดลอก: กดปุ่ม ``Shift`` ค้างไว้ คลิกขวาและลาก

source: Paste: Press ``Ctrl-Shift-V``
ja: 貼り付け: ``Ctrl-Shift-V`` を押します。
ko_kr: 불여넣기: ``Ctrl-Shift-V`` 키를 누름
th: วาง: กด ``Ctrl-Shift-V``

source: Check the terminal history using keyboard
ja: キーボードを使用してターミナル履歴を確認する
ko_kr: 키보드를 이용해 터미널 이전 내용 확인하기
th: ตรวจสอบประวัติเทอร์มินัลโดยใช้แป้นพิมพ์

source: There is also a way to copy the terminal contents and check the previous contents of the terminal simultaneously. It is to check the previous contents using the keyboard. Again, click ``Ctrl-B`` first, and then press the ``Page Up`` and/or ``Page Down`` keys. To exit search mode, just press the ``q`` key. With this method, users can check the contents of the terminal history even when the mouse support is turned off.
ja: ターミナルの内容をコピーし、ターミナルの以前の内容を同時に確認する方法もあります。それは、キーボードを使用して以前の内容を確認することです。まず ``Ctrl-B`` をクリックし、その後 ``Page Up`` および/または ``Page Down`` キーを押します。検索モードを終了するには、単に ``q`` キーを押します。この方法を使用することで、ユーザーはマウスサポートがオフになっている場合でもターミナル履歴の内容を確認できます。
ko_kr: 터미널 내용 복사도 하면서 터미널의 이전 내용도 확인하고 싶은 경우에도 방법이 있습니다. 바로 키보드를 이용해서 이전 내용을 확인하는 것입니다. 이번에도 ``Ctrl-B`` 를 먼저 클릭 해준 뒤 ``Page Up`` 과 ``Page Down`` 키를 눌러 봅시다. 키보드 만으로 터미널의 이전 내용을 탐색할 수 있다는 것을 확인할 수 있습니다. 탐색 모드에서 빠져 나오려면 ``q`` 키를 눌러주면 됩니다. 이 방법을 이용하면 마우스 지원을 끈 상태에서도 터미널 이전 내용 확인이 가능합니다.

source: Spawn multiple shells
ja: 複数のシェルを生成
ko_kr: 여러 개의 쉘 띄우기
th: สร้างเชลล์หลายตัว

source: The main advantage of tmux is to launch and use multiple shells in one terminal window. Pressing ``Ctrl-B`` key and ``c``. will show the new shell environment. Previous window is not visible at this point, but is not terminated. Press ``Ctrl-B`` and ``w``. List of shells currently open on tmux is shown. Shell starting with ``0:`` is the initial shell environment, and the shell starting with ``1:`` is the one just created. Users can move between shells using the up/down keys. Place the cursor on the shell ``0:`` and press the Enter key to select it.
ja: tmuxの主な利点は、1つのターミナルウィンドウで複数のシェルを起動して使用できることです。``Ctrl-B``キーと``c``を押すと、新しいシェル環境が表示されます。この時点では前のウィンドウは表示されていませんが、終了しているわけではありません。``Ctrl-B``と``w``を押すと、現在tmuxで開いているシェルのリストが表示されます。``0:``で始まるシェルが初期シェル環境であり、``1:``で始まるシェルが最近作成されたものです。ユーザーは上下キーを使用してシェル間を移動できます。シェル``0:``にカーソルを置いてEnterキーを押すと、それが選択されます。
ko_kr: tmux 의 가장 큰 장점은 하나의 터미널 창에서 여러 개의 쉘을 띄우고 사용할 수 있다는 점입니 다. 백문이 불여일견이니 ``Ctrl-B`` 키를 누른 후 ``c`` 키를 이어서 눌러봅시다. 기존 창의 내용이 사라지고 새로운 쉘 환경이 뜬 것을 확인할 수 있습니다. 그러면 기존 창은 사라진 것일까요? 그렇지 않습니다. ``Ctrl-B`` 누른 후 ``w`` 키를 눌러 봅시다. 다음과 같이 현재 tmux 상에서 열려 있는 쉘 리스트가 조회되는 것을 볼 수 있습니다. 여기서 ``0:`` 으로 시작하는 쉘이 처음 보던 쉘 환경이고, ``1:`` 로시작하는 쉘은 방금 새로 생성한 쉘입니다. 위/아래 방향 키를 이용해서 쉘 사이를 이동할 수 있습니다. ``0:`` 번 쉘에 커서를 가져다 두고 엔터 키를 눌러 선택 해보겠습니다.

source: tmux's multiple session management
ja: tmuxの複数セッション管理
th: การจัดการหลายเซสชันของ tmux

source: In this way, users can use multiple shell environments within a web terminal. To exit or terminate the current shell, just enter ``exit`` command or press ``Ctrl-B x`` key and then type ``y``.
ja: このようにして、ユーザーはウェブ terminal 内で複数のシェル環境を使用できます。現在のシェルを終了または終了するには、単に ``exit`` コマンドを入力するか、``Ctrl-B x`` キーを押してから ``y`` と入力してください。
ko_kr: 첫 번째 쉘 환경이 나타나는 것을 볼 수 있습니다. 이러한 방식으로 웹 터미널 내에서 여러 쉘 환경을 사용할 수 있습니다. 현재 쉘을 종료하려면 ``exit`` 명령을 입력하거나 ``Ctrl-B x`` 키를 누른 다음 ``y`` 를 입력하십시오.

source: In summary:
ja: まとめ:
ko_kr: 정리하면 다음과 같습니다:
th: โดยสรุป:

source: ``Ctrl-B c``: create a new tmux shell
ja: ``Ctrl-B c``: 新しい tmux シェルを作成
ko_kr: ``Ctrl-B c``: 새로운 tmux 쉘 생성
th: ``Ctrl-B c``: สร้างเซลล์ tmux ใหม่

source: ``Ctrl-B w``: query current tmux shells and move around among them
ja: ``Ctrl-B w``: 現在の tmux シェルを照会し、その間を移動します
ko_kr: ``Ctrl-B w``: tmux 쉘 조회 및 이동/선택
th: ``Ctrl-B w``: สอบถามเชลล์ tmux ปัจจุบันและเคลื่อนที่ไปรอบ ๆ ระหว่างพวกเขา

source: ``exit`` or ``Ctrl-B x``: terminate the current shell
ja: ``exit`` または ``Ctrl-B x``: 現在のシェルを終了します
ko_kr: ``exit`` 또는 ``Ctrl-B x``: 현재 tmux 쉘 종료
th: ``exit`` หรือ ``Ctrl-B x``: สิ้นสุดเชลล์ปัจจุบัน

source: Combining the above commands allows users to perform various tasks simultaneously on multiple shells.
ja: 上記のコマンドを組み合わせることで、ユーザーは複数のシェルで同時にさまざまなタスクを実行できます。
ko_kr: 위 명령을 조합하여 여러 개의 쉘에서 동시에 다양한 작업을 수행할 수 있습니다.

source: The most visited pages in the GPU Platform Web-UI would be the Sessions and Data & Storage pages. Here, you will learn how to query and create container-based compute sessions and utilize various web applications on the Sessions page.
th: หน้าที่มีการเข้าชมมากที่สุดใน GPU Platform Web-UI จะเป็นหน้าการประชุมและหน้าข้อมูล & การจัดเก็บ ที่นี่คุณจะได้เรียนรู้วิธีการเรียกค้นและสร้างเซสชันการประมวลผลที่ใช้คอนเทนเนอร์ และใช้แอปพลิเคชันเว็บต่างๆ บนหน้าการประชุม

source: After logging in with a user account, click Sessions on the left sidebar to visit the Sessions page. Sessions page lets you start new sessions or use and manage existing running sessions.
th: หลังจากเข้าสู่ระบบด้วยบัญชีผู้ใช้งาน ให้คลิกที่ Sessions ในแถบด้านซ้ายเพื่อไปที่หน้าทางเข้า หน้าทางเข้าช่วยให้คุณเริ่มต้นเซสชันใหม่หรือใช้และจัดการเซสชันที่กำลังทำงานอยู่แล้ว

source: Click the START button to start a new compute session. From version 24.03, GPU Platform offers an improved version of the session launcher (NEO). If you want to use the previous dialog-style session launcher, press the Classic button in the notification and create your session. For instructions on how to use it, please refer to the following `link <https://webui.docs.backend.ai/en/23.09_a/sessions_all/sessions_all.html>`_.
th: คลิกปุ่ม START เพื่อเริ่มเซสชันการคำนวณใหม่ จากเวอร์ชัน 24.03 เป็นต้นไป GPU Platform เสนอโหมดการเริ่มเซสชันที่ปรับปรุง (NEO) หากคุณต้องการใช้การเริ่มเซสชันแบบกล่องโต้ตอบก่อนหน้า ให้กดปุ่ม Classic ในการแจ้งเตือนและสร้างเซสชันของคุณ สำหรับคำแนะนำในการใช้งาน โปรดดูที่ `ลิงก์ <https://webui.docs.backend.ai/en/23.09_a/sessions_all/sessions_all.html>`_.

source: In the first page, you need to choose the type of session, interactive or batch. And you can set the session name, which is optional.
th: ในหน้าก่อนหน้า คุณต้องเลือกประเภทของเซสชันว่าเป็นแบบโต้ตอบหรือแบบชุด และคุณสามารถตั้งชื่อเซสชันได้ ซึ่งเป็นทางเลือกเพิ่มเติม
