Repository: lablup/backend.ai-docs-webui
Catalog: docs/locale/*/LC_MESSAGES/import_run/import_run.po
Languages: ja, ko, th

source: Import & Run notebooks and web based Git repositories
ja: ノートブックとウェブベースのGitリポジトリをインポートして実行
ko: Jupyter notebook과 웹 기반 Git 저장소 불러오기 및 실행
th: นำเข้าและรันโน้ตบุ๊คและที่เก็บ Git แบบเว็บ

source: Backend.AI supports executing Jupyter notebook files and importing web based Git repositories such as GitHub and GitLab on the fly. You don't need to create or download into your local storage and re-upload it. The only thing you have to do is input a valid URL you want to execute or import, and click the button on the right side.
ja: Backend.AIは、Jupyterノートブックファイルの実行や、GitHubやGitLabなどのウェブベースのGitリポジトリの即時インポートをサポートしています。ローカルストレージに作成またはダウンロードして再アップロードする必要はありません。実行またはインポートしたい有効なURLを入力し、右側のボタンをクリックするだけです。
ko: Backend.AI에서는 즉석으로 Jupyter notebook 파일을 실행하거나 GitHub, GitLab 과 같은 웹 기반 Git 저장소를 가져올 수 있습니다. 파일을 받거나 실행하기 위해 로컬 저장소에서 직접 생성하거나 다운로드 받고 다시 업로드하지 않아도 됩니다. 유효한 URL 을 입력하고 각 기능에 해당하는 패널의 우측에 있는 버튼을 클릭하기만 하면 됩니다.
th: Backend.AI รองรับการรันไฟล์ Jupyter notebook และการนำเข้าคลัง Git ที่เป็นเว็บ เช่น GitHub และ GitLab ได้อย่างทันที คุณไม่จำเป็นต้องสร้างหรือดาวน์โหลดไปยังที่เก็บข้อมูลในเครื่องแล้วอัปโหลดอีกครั้ง สิ่งที่คุณต้องทำคือป้อน URL ที่ถูกต้องที่คุณต้องการรันหรือ นำเข้า และคลิกที่ปุ่มด้านขวา

source: Import and run Jupyter notebooks
ja: Jupyterノートブックをインポートして実行する
ko: Jupyter notebook 파일 가져오기 및 실행
th: นำเข้าและรันสมุดบันทึก Jupyter

source: To import Jupyter notebooks and run, you need one thing, the valid URL for the notebook file. For example, if you want execute Jupyter notebook that's in github, you can copy and paste the URL and click IMPORT & RUN button.
ja: Jupyterノートブックをインポートして実行するには、ノートブックファイルの有効なURLが必要です。たとえば、GitHubにあるJupyterノートブックを実行したい場合は、URLをコピーして貼り付け、「IMPORT & RUN」ボタンをクリックできます。
ko: Jupyter notebook 파일을 가져와서 실행하기 위해서는 notebook 파일에 대한 유효한 URL이 필요합니다. GitHub에 있는 Jupyter notebook을 실행하고자 한다면, 입력 필드에 해당 파일의 URL을 복사해서 붙여넣은 뒤, IMPORT & RUN 버튼을 클릭하면 됩니다.
th: ในการนำเข้าสมุดบันทึก Jupyter และรัน คุณต้องมีสิ่งหนึ่งคือ URL ที่ถูกต้องสำหรับไฟล์สมุดบันทึก ตัวอย่างเช่น หากคุณต้องการรันสมุดบันทึก Jupyter ที่อยู่ใน github คุณสามารถคัดลอกและวาง URL แล้วคลิกปุ่ม IMPORT & RUN

source: When you trying to IMPORT & RUN Jupyter notebook file with local address, It will be regarded as invalid. You have to input URL which is not starting from localhost.
ja: ローカルアドレスでJupyterノートブックファイルをインポート＆実行しようとする場合、それは無効と見なされます。localhostで始まらないURLを入力する必要があります。
ko: 로컬 주소의 Jupyte notebook 파일을 불러와서 실행할 경우 실행이 되지 않습니다. localhost로 시작되는 주소 이외의 URL을 입력해주십시오.
th: เมื่อคุณพยายามนำเข้าและเรียกใช้งานไฟล์ Jupyter notebook ด้วยที่อยู่ภายในเครื่อง มันจะถูกถือว่าไม่ถูกต้อง คุณต้องป้อน URL ที่ไม่เริ่มต้นจาก localhost

source: Import & Run Jupyter notebook
ja: Jupyterノートブックをインポート＆実行
th: นำเข้าและรันโน้ตบุ๊ค Jupyter

source: After clicking the button, the dialog appears. This is a session launcher dialog same as when you starts the session at Sessions page or Summary page. Difference between import notebook and starting a new session is that import notebook automatically imports jupyter notebook in the URL, but simple starting a new session doesn't do that. the rest is same. Click LAUNCH button to the notebook after setting the environments and resource allocation as needed.
ja: ボタンをクリックすると、ダイアログが表示されます。これは、セッションページやサマリーページでセッションを開始するときと同じセッションランチャーダイアログです。ノートブックのインポートと新しいセッションの開始の違いは、ノートブックのインポートではURL内のjupyterノートブックが自動的にインポートされますが、新しいセッションを単に開始した場合はそれが行われない点です。その他の点は同じです。必要に応じて環境設定とリソース割り当てを行った後、LAUNCHボタンをクリックしてノートブックを起動します。
ko: 버튼을 클릭하면 다이얼로그가 띄워집니다. 이 다이얼로그는 세션 페이지나 요약 페이지에서 세션 시작시 나타나는 다이얼로그와 같습니다. 다만 notebook 불러오기에서는 세션을 시작하면서 불러온 jupyter notebook을 자동으로 실행하는 것이지만, 단순히 세션을 시작하는 것은 그렇지 않다는 점이 다릅니다. 나머지는 동일합니다.실행 환경과 필요한 자원 할당을 완료한 뒤 LAUNCH 버튼을 클릭하여 세션을 생성합니다.
th: หลังจากคลิกปุ่มแล้ว กล่องโต้ตอบจะปรากฏขึ้น นี่คือตัวจัดการเซสชันแบบเดียวกับเมื่อคุณเริ่มเซสชันที่หน้าการเซสชันหรือหน้าสรุป ความแตกต่างระหว่างการนำเข้าโน้ตบุ๊กและการเริ่มเซสชันใหม่คือการนำเข้าโน้ตบุ๊กจะนำเข้าโน้ตบุ๊ก Jupyter อัตโนมัติจาก URL แต่การเริ่มเซสชันใหม่อย่างง่ายจะไม่ทำเช่นนั้น ที่เหลือเหมือนกัน คลิกปุ่ม LAUNCH ไปยังโน้ตบุ๊กหลังจากตั้งค่าสภาพแวดล้อมและการจัดสรรทรัพยากรตามที่ต้องการ

source: The pop-up blocker must be turned off before clicking LAUNCH button to immediately see the running notebook window. Also, if there's not enough resources to execute the session, imported Jupyter notebook will not run.
ja: ポップアップブロッカーは、LAUNCHボタンをクリックしてすぐに稼働中のノートブックウィンドウを表示するためにオフにする必要があります。また、セッションを実行するのに十分なリソースがない場合は、インポートされたJupyterノートブックは実行されません。
ko: 노트북 실행 화면을 즉시 확인하려면 실행 전 반드시 팝업 차단을 해제해 주시기 바랍니다. 또한 세션을 생성하기에 충분한 자원이 없을 경우, 불러온 Jupyter notebook 파일은 실행되지 않습니다.
th: ต้องปิดการบล็อกป๊อปอัพก่อนคลิกปุ่ม LAUNCH เพื่อดูหน้าต่างโน้ตบุ๊คที่กำลังทำงานทันที นอกจากนี้ หากไม่มีทรัพยากรเพียงพอในการดำเนินการเซสชัน โน้ตบุ๊ค Jupyter ที่นำเข้ามาจะไม่ทำงาน

source: Session Launcher In Importing Jupyter notebook
ja: Jupyterノートブックのインポートにおけるセッションランチャー
th: ตัวโหลดเซสชันในการนำเข้าบันทึกย่อ Jupyter

source: You can see the importing operation is successfully completed in Sessions page.
ja: セッションページでインポート操作が正常に完了したことが確認できます。
ko: 세션 페이지에서 불러오기 작업이 성공적으로 완료된 것을 확인할 수 있습니다.
th: คุณสามารถเห็นว่าการนำเข้าดำเนินการเสร็จสมบูรณ์แล้วในหน้าเซสชัน

source: Session page with imported Jupyter notebook
ja: インポートされたJupyterノートブックを使用したセッションページ
th: หน้าเซสชันที่มีโน้ตบุ๊ก Jupyter ที่นำเข้า

source: Create executable Jupyter notebook button
ja: 実行可能なJupyterノートブックボタンの作成
ko: Jupyter notebook을 바로 실행할 수 있는 버튼 생성하기
th: สร้างปุ่ม Jupyter notebook ที่สามารถทำงานได้

source: You can also create HTML or Markdown button about Jupyter notebook URL, too. Input a valid Jupyter notebook URL and click CREATE button. It will show code blocks that directly links to creating a session with notebook. You can see the badge code working by inserting it in the GitHub repositories or where it supports html or markdown.
ja: JupyterノートブックURLに関するHTMLまたはMarkdownボタンを作成することもできます。有効なJupyterノートブックURLを入力し、CREATEボタンをクリックしてください。ノートブックとセッションを直接リンクするコードブロックが表示されます。GitHubリポジトリやhtmlまたはmarkdownをサポートしている場所にバッジコードを挿入することで、バッジコードが機能する様子を見ることができます。
ko: Jupyter notebook URL에 대해 HTML이나 Markdown에 삽입할 수 있는 버튼도 만들 수 있습니다. 유효한 Jupyter notebook URL을 입력 필드 란에 기입하고, CREATE 버튼을 클릭하십시오. 노트북 파일을 바로 실행하는 세션을 생셩해주는 코드 블록이 생성됩니다. 배지 코드가 잘 동작하는 것을 GitHub 저장소 또는 html이나 markdown 파일을 지원하는 그 어떤 곳에서도 사용이 가능합니다.
th: คุณสามารถสร้างปุ่ม HTML หรือ Markdown เกี่ยวกับ URL ของ Jupyter notebook ได้เช่นกัน ป้อน URL ของ Jupyter notebook ที่ถูกต้องแล้วคลิกปุ่ม CREATE จะมีการแสดงบล็อคโค้ดที่เชื่อมโยงโดยตรงไปยังการสร้างเซสชันกับโน้ตบุ๊ค คุณสามารถดูโค้ดแบดจ์ที่ทำงานโดยการแทรกมันในที่เก็บ GitHub หรือที่ที่รองรับ HTML หรือ Markdown

source: your account must be logined before clicking the button. Otherwise, you have to login first.
ja: ボタンをクリックする前に、アカウントにログインしている必要があります。そうでない場合は、まずログインする必要があります。
ko: 버튼 클릭 전 반드시 로그인이 되어있어야 합니다. 아닐 경우 실행 전 반드시 로그인이 필요합니다.
th: บัญชีของคุณต้องเข้าสู่ระบบก่อนที่จะคลิกปุ่ม หากไม่เช่นนั้นคุณต้องเข้าสู่ระบบก่อน

source: Create a Jupyter notebook button
ja: Jupyterノートブックボタンを作成
th: สร้างปุ่ม Jupyter notebook

source: Importing GitHub Repositories
ja: GitHub リポジトリをインポートする
ko: GitHub 저장소 불러오기
th: การนำเข้าคลังข้อมูล GitHub

source: Importing a GitHub repository is similar to import and running jupyter notebook. All you have to do is to fill out with github repository URL and click GET TO FOLDER button. If you can access to more than one storage host, you can select one from the list.
ja: GitHubリポジトリのインポートは、Jupyterノートブックをインポートして実行するのと似ています。必要なのはGitHubリポジトリのURLを入力し、GET TO FOLDERボタンをクリックすることだけです。複数のストレージホストにアクセスできる場合は、リストから1つ選択することができます。
ko: GitHub 저장소 불러오기는 Jupyter notebook 불러오기 및 실행하기와 비슷합니다. GitHub 저장소의 URL을 입력 필드에 적은 뒤 GET TO FOLDER 버튼을 클릭하면 됩니다. 하나 이상의 스토리지 호스트를 사용하는 경우에는 Host 목록에서 하나를 선택하십시오.
th: การนำเข้าที่เก็บ GitHub มีความคล้ายคลึงกับการนำเข้าและรัน jupyter notebook สิ่งที่คุณต้องทำคือกรอก URL ของที่เก็บ GitHub และคลิกที่ปุ่ม GET TO FOLDER หากคุณสามารถเข้าถึงโฮสต์ที่เก็บข้อมูลมากกว่าหนึ่งแห่ง คุณสามารถเลือกหนึ่งในรายการได้

source: Import GitHub repository
ja: GitHubリポジトリをインポート
th: นำเข้าคลังข้อมูล GitHub

source: If there are not enough resources to start a session or folder count is at the limit, then importing repository will fail. Please check resource statistics panel and Data & Storage page before importing the repository.
ja: セッションを開始するためのリソースが不足しているか、フォルダ数が制限に達している場合、リポジトリのインポートは失敗します。リポジトリをインポートする前に、リソース統計パネルとデータ & ストレージページを確認してください。
ko: 만약 세션을 생성할 수 있는 충분한 자원이 없거나, 폴더 생성 가능한 갯수가 최대 값에 도달했을 경우, 저장소 불러오기 작업은 불가능합니다. 저장소를 불러오기 전 반드시 Resource statistics 패널과 Data & Storage 페이지를 확인하시기 바랍니다.
th: หากไม่มีทรัพยากรเพียงพอในการเริ่มเซสชันหรือจำนวนโฟลเดอร์ถึงขีดจำกัด การนำเข้าของเก็บจะล้มเหลว โปรดตรวจสอบแผงสถิตทรัพยากรและหน้าข้อมูล & การจัดเก็บก่อนที่จะนำเข้าของเก็บ

source: You can see the repository is successfully imported as a data folder with its name.
ja: リポジトリがその名前でデータフォルダとして正常にインポートされていることが確認できます。
ko: 저장소가 하나의 폴더로써 성공적으로 불러와진 것을 확인할 수 있습니다.
th: คุณสามารถเห็นได้ว่ารีโพสิตอรีถูกนำเข้าสำเร็จเป็นโฟลเดอร์ข้อมูลพร้อมชื่อของมัน

source: Import GitHub repository result
ja: GitHub リポジトリのインポート結果
th: นำเข้าผลลัพธ์ของที่เก็บ GitHub

source: Importing GitLab Repositories
ja: GitLabリポジトリのインポート
ko: GitLab 저장소 불러오기
th: การนำเข้ากระบวนการ GitLab

source: From 22.03, Backend.AI supports importing from GitLab. It's almost the same as :ref:`Importing GitHub Repositories<importing-github-repositories>`, but you need to explicitly set the branch name to import.
ja: 22.03から、Backend.AIはGitLabからのインポートをサポートしています。これはほとんどの場合、 :ref:`GitHubリポジトリのインポート<importing-github-repositories>` と同じですが、インポートするブランチ名を明示的に設定する必要があります。
ko: Backend.AI 22.03 버전부터 GitLab 저장소 불러오기를 지원합니다. :ref:`GitHub 저장소 불러오기<importing-github-repositories>` 와 거의 같은 방법으로 불러올 수 있지만, GitLab의 경우에는 브랜치 이름을 명시적으로 지정해야 합니다.
th: ตั้งแต่วันที่ 22.03 เป็นต้นไป Backend.AI รองรับการนำเข้าจาก GitLab ซึ่งคล้ายกับ :ref:`การนำเข้าคลังข้อมูล GitHub<importing-github-repositories>` แต่คุณต้องกำหนดชื่อสาขาที่จะนำเข้าอย่างชัดเจน

source: Import GitLab repository
ja: GitLabリポジトリをインポート
th: นำเข้าคลัง GitLab

source: If there's data folder that has the same name already, the system will append ``_`` (underscore) and number in the imported repository folder.
ja: 同じ名前のデータフォルダがすでにある場合、システムはインポートされたリポジトリフォルダに「_」（アンダースコア）と番号を追加します。
ko: 이미 동일한 이름의 데이터 폴더가 존재할 경우, 시스템에서는 자동으로 불러오는 저장소 명 뒤에 ``_`` (밑줄)과 번호를 추가하게 됩니다.
th: หากมีโฟลเดอร์ข้อมูลที่มีชื่อเดียวกันอยู่แล้ว ระบบจะเพิ่ม ``_`` (ขีดล่าง) และหมายเลขในโฟลเดอร์ที่นำเข้าภายในคลังข้อมูล
